robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
/* RCC - Reset and clock control */
#define CH32V_RCC_BASE                    0x40021000
#define CH32V_RCC_CTLR_OFFSET             0x0000
#define CH32V_RCC_CTLR                    (CH32V_RCC_BASE + CH32V_RCC_CTLR_OFFSET)
#define CH32V_RCC_CTLR_HSION              (1 <<  0) /* 00000001: Internal High Speed clock enable */
#define CH32V_RCC_CTLR_HSIRDY             (1 <<  1) /* 00000002: Internal High Speed clock ready flag */
#define CH32V_RCC_CTLR_HSITRIM            (0x1f << 3) /* 000000f8: Internal High Speed clock trimming */
#define CH32V_RCC_CTLR_HSITRIM_MASK       (0x1f << 3)
#define CH32V_RCC_CTLR_HSICAL             (0xff << 8) /* 0000ff00: Internal High Speed clock Calibration */
#define CH32V_RCC_CTLR_HSICAL_MASK        (0xff << 8)
#define CH32V_RCC_CTLR_HSEON              (1 << 16) /* 00010000: External High Speed clock enable */
#define CH32V_RCC_CTLR_HSERDY             (1 << 17) /* 00020000: External High Speed clock ready flag */
#define CH32V_RCC_CTLR_HSEBYP             (1 << 18) /* 00040000: External High Speed clock Bypass */
#define CH32V_RCC_CTLR_CSSON              (1 << 19) /* 00080000: Clock Security System enable */
#define CH32V_RCC_CTLR_PLLON              (1 << 24) /* 01000000: PLL enable */
#define CH32V_RCC_CTLR_PLLRDY             (1 << 25) /* 02000000: PLL clock ready flag */
#define CH32V_RCC_CTLR_PLL2ON             (1 << 26) /* 04000000: PLL2 enable */
#define CH32V_RCC_CTLR_PLL2RDY            (1 << 27) /* 08000000: PLL2 clock ready flag */
#define CH32V_RCC_CTLR_PLL3ON             (1 << 28) /* 10000000: PLL3 enable */
#define CH32V_RCC_CTLR_PLL3RDY            (1 << 29) /* 20000000: PLL3 clock ready flag */
#define CH32V_RCC_CFGR0_OFFSET            0x0004
#define CH32V_RCC_CFGR0                   (CH32V_RCC_BASE + CH32V_RCC_CFGR0_OFFSET)
#define CH32V_RCC_CFGR0_SW                (0x3 << 0) /* 00000003: System clock Switch */
#define CH32V_RCC_CFGR0_SW_MASK           (0x3 << 0)
#define CH32V_RCC_CFGR0_SWS               (0x3 << 2) /* 0000000c: System Clock Switch Status */
#define CH32V_RCC_CFGR0_SWS_MASK          (0x3 << 2)
#define CH32V_RCC_CFGR0_HPRE              (0xf << 4) /* 000000f0: AHB prescaler */
#define CH32V_RCC_CFGR0_HPRE_MASK         (0xf << 4)
#define CH32V_RCC_CFGR0_PPRE1             (0x7 << 8) /* 00000700: APB Low speed prescaler (APB1) */
#define CH32V_RCC_CFGR0_PPRE1_MASK        (0x7 << 8)
#define CH32V_RCC_CFGR0_PPRE2             (0x7 << 11) /* 00003800: APB High speed prescaler (APB2) */
#define CH32V_RCC_CFGR0_PPRE2_MASK        (0x7 << 11)
#define CH32V_RCC_CFGR0_ADCPRE            (0x3 << 14) /* 0000c000: ADC prescaler */
#define CH32V_RCC_CFGR0_ADCPRE_MASK       (0x3 << 14)
#define CH32V_RCC_CFGR0_PLLSRC            (1 << 16) /* 00010000: PLL entry clock source */
#define CH32V_RCC_CFGR0_PLLXTPRE          (1 << 17) /* 00020000: HSE divider for PLL entry */
#define CH32V_RCC_CFGR0_PLLMUL            (0xf << 18) /* 003c0000: PLL Multiplication Factor */
#define CH32V_RCC_CFGR0_PLLMUL_MASK       (0xf << 18)
#define CH32V_RCC_CFGR0_USBPRE            (0x3 << 22) /* 00c00000: USB prescaler */
#define CH32V_RCC_CFGR0_USBPRE_MASK       (0x3 << 22)
#define CH32V_RCC_CFGR0_MCO               (0xf << 24) /* 0f000000: Microcontroller clock output */
#define CH32V_RCC_CFGR0_MCO_MASK          (0xf << 24)
#define CH32V_RCC_CFGR0_ADC_CLK_ADJ       (1 << 31) /* 80000000: ADC clock ADJ */
#define CH32V_RCC_INTR_OFFSET             0x0008
#define CH32V_RCC_INTR                    (CH32V_RCC_BASE + CH32V_RCC_INTR_OFFSET)
#define CH32V_RCC_INTR_LSIRDYF            (1 <<  0) /* 00000001: LSI Ready Interrupt flag */
#define CH32V_RCC_INTR_LSERDYF            (1 <<  1) /* 00000002: LSE Ready Interrupt flag */
#define CH32V_RCC_INTR_HSIRDYF            (1 <<  2) /* 00000004: HSI Ready Interrupt flag */
#define CH32V_RCC_INTR_HSERDYF            (1 <<  3) /* 00000008: HSE Ready Interrupt flag */
#define CH32V_RCC_INTR_PLLRDYF            (1 <<  4) /* 00000010: PLL Ready Interrupt flag */
#define CH32V_RCC_INTR_PLL2RDYF           (1 <<  5) /* 00000020: PLL2 Ready Interrupt flag */
#define CH32V_RCC_INTR_PLL3RDYF           (1 <<  6) /* 00000040: PLL3 Ready Interrupt flag */
#define CH32V_RCC_INTR_CSSF               (1 <<  7) /* 00000080: Clock Security System Interrupt flag */
#define CH32V_RCC_INTR_LSIRDYIE           (1 <<  8) /* 00000100: LSI Ready Interrupt Enable */
#define CH32V_RCC_INTR_LSERDYIE           (1 <<  9) /* 00000200: LSE Ready Interrupt Enable */
#define CH32V_RCC_INTR_HSIRDYIE           (1 << 10) /* 00000400: HSI Ready Interrupt Enable */
#define CH32V_RCC_INTR_HSERDYIE           (1 << 11) /* 00000800: HSE Ready Interrupt Enable */
#define CH32V_RCC_INTR_PLLRDYIE           (1 << 12) /* 00001000: PLL Ready Interrupt Enable */
#define CH32V_RCC_INTR_PLL2RDYIE          (1 << 13) /* 00002000: PLL2 Ready Interrupt Enable */
#define CH32V_RCC_INTR_PLL3RDYIE          (1 << 14) /* 00004000: PLL3 Ready Interrupt Enable */
#define CH32V_RCC_INTR_LSIRDYC            (1 << 16) /* 00010000: LSI Ready Interrupt Clear */
#define CH32V_RCC_INTR_LSERDYC            (1 << 17) /* 00020000: LSE Ready Interrupt Clear */
#define CH32V_RCC_INTR_HSIRDYC            (1 << 18) /* 00040000: HSI Ready Interrupt Clear */
#define CH32V_RCC_INTR_HSERDYC            (1 << 19) /* 00080000: HSE Ready Interrupt Clear */
#define CH32V_RCC_INTR_PLLRDYC            (1 << 20) /* 00100000: PLL Ready Interrupt Clear */
#define CH32V_RCC_INTR_PLL2RDYC           (1 << 21) /* 00200000: PLL2 Ready Interrupt Clear */
#define CH32V_RCC_INTR_PLL3RDYC           (1 << 22) /* 00400000: PLL3 Ready Interrupt Clear */
#define CH32V_RCC_INTR_CSSC               (1 << 23) /* 00800000: Clock security system interrupt clear */
#define CH32V_RCC_APB2PRSTR_OFFSET        0x000c
#define CH32V_RCC_APB2PRSTR               (CH32V_RCC_BASE + CH32V_RCC_APB2PRSTR_OFFSET) /* read-write */
#define CH32V_RCC_APB2PRSTR_AFIORST       (1 <<  0) /* 00000001: Alternate function I/O reset */
#define CH32V_RCC_APB2PRSTR_IOPARST       (1 <<  2) /* 00000004: IO port A reset */
#define CH32V_RCC_APB2PRSTR_IOPBRST       (1 <<  3) /* 00000008: IO port B reset */
#define CH32V_RCC_APB2PRSTR_IOPCRST       (1 <<  4) /* 00000010: IO port C reset */
#define CH32V_RCC_APB2PRSTR_IOPDRST       (1 <<  5) /* 00000020: IO port D reset */
#define CH32V_RCC_APB2PRSTR_IOPERST       (1 <<  6) /* 00000040: IO port E reset */
#define CH32V_RCC_APB2PRSTR_ADC1RST       (1 <<  9) /* 00000200: ADC 1 interface reset */
#define CH32V_RCC_APB2PRSTR_ADC2RST       (1 << 10) /* 00000400: ADC 2 interface reset */
#define CH32V_RCC_APB2PRSTR_TIM1RST       (1 << 11) /* 00000800: TIM1 timer reset */
#define CH32V_RCC_APB2PRSTR_SPI1RST       (1 << 12) /* 00001000: SPI 1 reset */
#define CH32V_RCC_APB2PRSTR_TIM8RST       (1 << 13) /* 00002000: TIM8 timer reset */
#define CH32V_RCC_APB2PRSTR_USART1RST     (1 << 14) /* 00004000: USART1 reset */
#define CH32V_RCC_APB2PRSTR_TIM9RST       (1 << 19) /* 00080000: TIM9 timer reset */
#define CH32V_RCC_APB2PRSTR_TIM10RST      (1 << 20) /* 00100000: TIM10 timer reset */
#define CH32V_RCC_APB1PRSTR_OFFSET        0x0010
#define CH32V_RCC_APB1PRSTR               (CH32V_RCC_BASE + CH32V_RCC_APB1PRSTR_OFFSET) /* read-write */
#define CH32V_RCC_APB1PRSTR_TIM2RST       (1 <<  0) /* 00000001: Timer 2 reset */
#define CH32V_RCC_APB1PRSTR_TIM3RST       (1 <<  1) /* 00000002: Timer 3 reset */
#define CH32V_RCC_APB1PRSTR_TIM4RST       (1 <<  2) /* 00000004: Timer 4 reset */
#define CH32V_RCC_APB1PRSTR_TIM5RST       (1 <<  3) /* 00000008: Timer 5 reset */
#define CH32V_RCC_APB1PRSTR_TIM6RST       (1 <<  4) /* 00000010: Timer 6 reset */
#define CH32V_RCC_APB1PRSTR_TIM7RST       (1 <<  5) /* 00000020: Timer 7 reset */
#define CH32V_RCC_APB1PRSTR_UART6RST      (1 <<  6) /* 00000040: UART 6 reset */
#define CH32V_RCC_APB1PRSTR_UART7RST      (1 <<  7) /* 00000080: UART 7 reset */
#define CH32V_RCC_APB1PRSTR_UART8RST      (1 <<  8) /* 00000100: UART 8 reset */
#define CH32V_RCC_APB1PRSTR_WWDGRST       (1 << 11) /* 00000800: Window watchdog reset */
#define CH32V_RCC_APB1PRSTR_SPI2RST       (1 << 14) /* 00004000: SPI2 reset */
#define CH32V_RCC_APB1PRSTR_SPI3RST       (1 << 15) /* 00008000: SPI3 reset */
#define CH32V_RCC_APB1PRSTR_USART2RST     (1 << 17) /* 00020000: USART 2 reset */
#define CH32V_RCC_APB1PRSTR_USART3RST     (1 << 18) /* 00040000: USART 3 reset */
#define CH32V_RCC_APB1PRSTR_USART4RST     (1 << 19) /* 00080000: USART 4 reset */
#define CH32V_RCC_APB1PRSTR_USART5RST     (1 << 20) /* 00100000: USART 5 reset */
#define CH32V_RCC_APB1PRSTR_I2C1RST       (1 << 21) /* 00200000: I2C1 reset */
#define CH32V_RCC_APB1PRSTR_I2C2RST       (1 << 22) /* 00400000: I2C2 reset */
#define CH32V_RCC_APB1PRSTR_USBDRST       (1 << 23) /* 00800000: USBD reset */
#define CH32V_RCC_APB1PRSTR_CAN1RST       (1 << 25) /* 02000000: CAN1 reset */
#define CH32V_RCC_APB1PRSTR_CAN2RST       (1 << 26) /* 04000000: CAN2 reset */
#define CH32V_RCC_APB1PRSTR_BKPRST        (1 << 27) /* 08000000: Backup interface reset */
#define CH32V_RCC_APB1PRSTR_PWRRST        (1 << 28) /* 10000000: Power interface reset */
#define CH32V_RCC_APB1PRSTR_DACRST        (1 << 29) /* 20000000: DAC interface reset */
#define CH32V_RCC_AHBPCENR_OFFSET         0x0014
#define CH32V_RCC_AHBPCENR                (CH32V_RCC_BASE + CH32V_RCC_AHBPCENR_OFFSET) /* read-write */
#define CH32V_RCC_AHBPCENR_DMA1EN         (1 <<  0) /* 00000001: DMA clock enable */
#define CH32V_RCC_AHBPCENR_DMA2EN         (1 <<  1) /* 00000002: DMA2 clock enable */
#define CH32V_RCC_AHBPCENR_SRAMEN         (1 <<  2) /* 00000004: SRAM interface clock enable */
#define CH32V_RCC_AHBPCENR_FLITFEN        (1 <<  4) /* 00000010: FLITF clock enable */
#define CH32V_RCC_AHBPCENR_CRCEN          (1 <<  6) /* 00000040: CRC clock enable */
#define CH32V_RCC_AHBPCENR_FSMCEN         (1 <<  8) /* 00000100: FSMC clock enable */
#define CH32V_RCC_AHBPCENR_TRNG_EN        (1 <<  9) /* 00000200: TRNG clock enable */
#define CH32V_RCC_AHBPCENR_SDIOEN         (1 << 10) /* 00000400: SDIO clock enable */
#define CH32V_RCC_AHBPCENR_USBHS_EN       (1 << 11) /* 00000800: USBHS clock enable */
#define CH32V_RCC_AHBPCENR_OTG_EN         (1 << 12) /* 00001000: OTG clock enable */
#define CH32V_RCC_AHBPCENR_DVP_EN         (1 << 13) /* 00002000: DVP clock enable */
#define CH32V_RCC_AHBPCENR_ETHMACEN       (1 << 14) /* 00004000: Ethernet MAC clock enable */
#define CH32V_RCC_AHBPCENR_ETHMACTXEN     (1 << 15) /* 00008000: Ethernet MAC TX clock enable */
#define CH32V_RCC_AHBPCENR_ETHMACRXEN     (1 << 16) /* 00010000: Ethernet MAC RX clock enable */
#define CH32V_RCC_APB2PCENR_OFFSET        0x0018
#define CH32V_RCC_APB2PCENR               (CH32V_RCC_BASE + CH32V_RCC_APB2PCENR_OFFSET) /* read-write */
#define CH32V_RCC_APB2PCENR_AFIOEN        (1 <<  0) /* 00000001: Alternate function I/O clock enable */
#define CH32V_RCC_APB2PCENR_IOPAEN        (1 <<  2) /* 00000004: I/O port A clock enable */
#define CH32V_RCC_APB2PCENR_IOPBEN        (1 <<  3) /* 00000008: I/O port B clock enable */
#define CH32V_RCC_APB2PCENR_IOPCEN        (1 <<  4) /* 00000010: I/O port C clock enable */
#define CH32V_RCC_APB2PCENR_IOPDEN        (1 <<  5) /* 00000020: I/O port D clock enable */
#define CH32V_RCC_APB2PCENR_IOPEEN        (1 <<  6) /* 00000040: I/O port E clock enable */
#define CH32V_RCC_APB2PCENR_ADC1EN        (1 <<  9) /* 00000200: ADC1 interface clock enable */
#define CH32V_RCC_APB2PCENR_ADC2EN        (1 << 10) /* 00000400: ADC 2 interface clock enable */
#define CH32V_RCC_APB2PCENR_TIM1EN        (1 << 11) /* 00000800: TIM1 Timer clock enable */
#define CH32V_RCC_APB2PCENR_SPI1EN        (1 << 12) /* 00001000: SPI 1 clock enable */
#define CH32V_RCC_APB2PCENR_TIM8EN        (1 << 13) /* 00002000: TIM8 Timer clock enable */
#define CH32V_RCC_APB2PCENR_USART1EN      (1 << 14) /* 00004000: USART1 clock enable */
#define CH32V_RCC_APB2PCENR_TIM9_EN       (1 << 19) /* 00080000: TIM9 Timer clock enable */
#define CH32V_RCC_APB2PCENR_TIM10_EN      (1 << 20) /* 00100000: TIM10 Timer clock enable */
#define CH32V_RCC_APB1PCENR_OFFSET        0x001c
#define CH32V_RCC_APB1PCENR               (CH32V_RCC_BASE + CH32V_RCC_APB1PCENR_OFFSET) /* read-write */
#define CH32V_RCC_APB1PCENR_TIM2EN        (1 <<  0) /* 00000001: Timer 2 clock enable */
#define CH32V_RCC_APB1PCENR_TIM3EN        (1 <<  1) /* 00000002: Timer 3 clock enable */
#define CH32V_RCC_APB1PCENR_TIM4EN        (1 <<  2) /* 00000004: Timer 4 clock enable */
#define CH32V_RCC_APB1PCENR_TIM5EN        (1 <<  3) /* 00000008: Timer 5 clock enable */
#define CH32V_RCC_APB1PCENR_TIM6EN        (1 <<  4) /* 00000010: Timer 6 clock enable */
#define CH32V_RCC_APB1PCENR_TIM7EN        (1 <<  5) /* 00000020: Timer 7 clock enable */
#define CH32V_RCC_APB1PCENR_USART6_EN     (1 <<  6) /* 00000040: USART 6 clock enable */
#define CH32V_RCC_APB1PCENR_USART7_EN     (1 <<  7) /* 00000080: USART 7 clock enable */
#define CH32V_RCC_APB1PCENR_USART8_EN     (1 <<  8) /* 00000100: USART 8 clock enable */
#define CH32V_RCC_APB1PCENR_WWDGEN        (1 << 11) /* 00000800: Window watchdog clock enable */
#define CH32V_RCC_APB1PCENR_SPI2EN        (1 << 14) /* 00004000: SPI 2 clock enable */
#define CH32V_RCC_APB1PCENR_SPI3EN        (1 << 15) /* 00008000: SPI 3 clock enable */
#define CH32V_RCC_APB1PCENR_USART2EN      (1 << 17) /* 00020000: USART 2 clock enable */
#define CH32V_RCC_APB1PCENR_USART3EN      (1 << 18) /* 00040000: USART 3 clock enable */
#define CH32V_RCC_APB1PCENR_UART4EN       (1 << 19) /* 00080000: UART 4 clock enable */
#define CH32V_RCC_APB1PCENR_UART5EN       (1 << 20) /* 00100000: UART 5 clock enable */
#define CH32V_RCC_APB1PCENR_I2C1EN        (1 << 21) /* 00200000: I2C 1 clock enable */
#define CH32V_RCC_APB1PCENR_I2C2EN        (1 << 22) /* 00400000: I2C 2 clock enable */
#define CH32V_RCC_APB1PCENR_USBDEN        (1 << 23) /* 00800000: USBD clock enable */
#define CH32V_RCC_APB1PCENR_CAN1EN        (1 << 25) /* 02000000: CAN1 clock enable */
#define CH32V_RCC_APB1PCENR_CAN2EN        (1 << 26) /* 04000000: CAN2 clock enable */
#define CH32V_RCC_APB1PCENR_BKPEN         (1 << 27) /* 08000000: Backup interface clock enable */
#define CH32V_RCC_APB1PCENR_PWREN         (1 << 28) /* 10000000: Power interface clock enable */
#define CH32V_RCC_APB1PCENR_DACEN         (1 << 29) /* 20000000: DAC interface clock enable */
#define CH32V_RCC_BDCTLR_OFFSET           0x0020
#define CH32V_RCC_BDCTLR                  (CH32V_RCC_BASE + CH32V_RCC_BDCTLR_OFFSET)
#define CH32V_RCC_BDCTLR_LSEON            (1 <<  0) /* 00000001: External Low Speed oscillator enable */
#define CH32V_RCC_BDCTLR_LSERDY           (1 <<  1) /* 00000002: External Low Speed oscillator ready */
#define CH32V_RCC_BDCTLR_LSEBYP           (1 <<  2) /* 00000004: External Low Speed oscillator bypass */
#define CH32V_RCC_BDCTLR_RTCSEL           (0x3 << 8) /* 00000300: RTC clock source selection */
#define CH32V_RCC_BDCTLR_RTCSEL_MASK      (0x3 << 8)
#define CH32V_RCC_BDCTLR_RTCEN            (1 << 15) /* 00008000: RTC clock enable */
#define CH32V_RCC_BDCTLR_BDRST            (1 << 16) /* 00010000: Backup domain software reset */
#define CH32V_RCC_RSTSCKR_OFFSET          0x0024
#define CH32V_RCC_RSTSCKR                 (CH32V_RCC_BASE + CH32V_RCC_RSTSCKR_OFFSET)
#define CH32V_RCC_RSTSCKR_LSION           (1 <<  0) /* 00000001: Internal low speed oscillator enable */
#define CH32V_RCC_RSTSCKR_LSIRDY          (1 <<  1) /* 00000002: Internal low speed oscillator ready */
#define CH32V_RCC_RSTSCKR_RMVF            (1 << 24) /* 01000000: Remove reset flag */
#define CH32V_RCC_RSTSCKR_PINRSTF         (1 << 26) /* 04000000: PIN reset flag */
#define CH32V_RCC_RSTSCKR_PORRSTF         (1 << 27) /* 08000000: POR/PDR reset flag */
#define CH32V_RCC_RSTSCKR_SFTRSTF         (1 << 28) /* 10000000: Software reset flag */
#define CH32V_RCC_RSTSCKR_IWDGRSTF        (1 << 29) /* 20000000: Independent watchdog reset flag */
#define CH32V_RCC_RSTSCKR_WWDGRSTF        (1 << 30) /* 40000000: Window watchdog reset flag */
#define CH32V_RCC_RSTSCKR_LPWRRSTF        (1 << 31) /* 80000000: Low-power reset flag */
#define CH32V_RCC_AHBRSTR_OFFSET          0x0028
#define CH32V_RCC_AHBRSTR                 (CH32V_RCC_BASE + CH32V_RCC_AHBRSTR_OFFSET)
#define CH32V_RCC_AHBRSTR_USBHDRST        (1 << 12) /* 00001000: USBHD reset */
#define CH32V_RCC_AHBRSTR_DVPRST          (1 << 13) /* 00002000: DVP reset */
#define CH32V_RCC_AHBRSTR_ETHMACRST       (1 << 14) /* 00004000: Ethernet MAC reset */
#define CH32V_RCC_CFGR2_OFFSET            0x002c
#define CH32V_RCC_CFGR2                   (CH32V_RCC_BASE + CH32V_RCC_CFGR2_OFFSET) /* read-write */
#define CH32V_RCC_CFGR2_PREDIV1           (0xf << 0) /* 0000000f: PREDIV1 division factor */
#define CH32V_RCC_CFGR2_PREDIV1_MASK      (0xf << 0)
#define CH32V_RCC_CFGR2_PREDIV2           (0xf << 4) /* 000000f0: PREDIV2 division factor */
#define CH32V_RCC_CFGR2_PREDIV2_MASK      (0xf << 4)
#define CH32V_RCC_CFGR2_PLL2MUL           (0xf << 8) /* 00000f00: PLL2 Multiplication Factor */
#define CH32V_RCC_CFGR2_PLL2MUL_MASK      (0xf << 8)
#define CH32V_RCC_CFGR2_PLL3MUL           (0xf << 12) /* 0000f000: PLL3 Multiplication Factor */
#define CH32V_RCC_CFGR2_PLL3MUL_MASK      (0xf << 12)
#define CH32V_RCC_CFGR2_PREDIV1SRC        (1 << 16) /* 00010000: PREDIV1 entry clock source */
#define CH32V_RCC_CFGR2_I2S2SRC           (1 << 17) /* 00020000: I2S2 clock source */
#define CH32V_RCC_CFGR2_I2S3SRC           (1 << 18) /* 00040000: I2S3 clock source */
#define CH32V_RCC_CFGR2_TRNG_SRC          (1 << 19) /* 00080000: TRNG clock source */
#define CH32V_RCC_CFGR2_ETH1G_SRC         (0x3 << 20) /* 00300000: ETH1G clock source */
#define CH32V_RCC_CFGR2_ETH1G_SRC_MASK    (0x3 << 20)
#define CH32V_RCC_CFGR2_ETH1G_125M_EN     (1 << 22) /* 00400000: ETH1G _125M clock enable */
#define CH32V_RCC_CFGR2_USBHS_PREDIY      (0x7 << 24) /* 07000000: USB HS PREDIV division factor */
#define CH32V_RCC_CFGR2_USBHS_PREDIY_MASK (0x7 << 24)
#define CH32V_RCC_CFGR2_USBHS_PLL_SRC     (1 << 27) /* 08000000: USB HS Multiplication Factor clock source */
#define CH32V_RCC_CFGR2_USBHS_CKPEF_SEL   (0x3 << 28) /* 30000000: USB HS Peference Clock source */
#define CH32V_RCC_CFGR2_USBHS_CKPEF_SEL_MASK (0x3 << 28)
#define CH32V_RCC_CFGR2_USBHS_PLLALIVE    (1 << 30) /* 40000000: USB HS Multiplication control */
#define CH32V_RCC_CFGR2_USBHS_CLK_SRC     (1 << 31) /* 80000000: USB HS clock source */

/* EXTEND - Extend configuration */
#define CH32V_EXTEND_BASE                 0x40023800
#define CH32V_EXTEND_EXTEND_CTR_OFFSET    0x0000
#define CH32V_EXTEND_EXTEND_CTR           (CH32V_EXTEND_BASE + CH32V_EXTEND_EXTEND_CTR_OFFSET)
#define CH32V_EXTEND_EXTEND_CTR_USBDLS    (1 <<  0) /* 00000001: USBD Lowspeed Enable */
#define CH32V_EXTEND_EXTEND_CTR_USBDPU    (1 <<  1) /* 00000002: USBD pullup Enable */
#define CH32V_EXTEND_EXTEND_CTR_ETH_10M_EN (1 <<  2) /* 00000004: ETH 10M Enable */
#define CH32V_EXTEND_EXTEND_CTR_ETH_RGMII_EN (1 <<  3) /* 00000008: ETH RGMII Enable */
#define CH32V_EXTEND_EXTEND_CTR_PLL_HSI_PRE (1 <<  4) /* 00000010: Whether HSI is divided */
#define CH32V_EXTEND_EXTEND_CTR_LOCKUP_EN (1 <<  6) /* 00000040: LOCKUP_Eable */
#define CH32V_EXTEND_EXTEND_CTR_LOCKUP_RSTF (1 <<  7) /* 00000080: LOCKUP RESET */
#define CH32V_EXTEND_EXTEND_CTR_ULLDO_TRIM (0x3 << 8) /* 00000300: ULLDO_TRIM */
#define CH32V_EXTEND_EXTEND_CTR_ULLDO_TRIM_MASK (0x3 << 8)
#define CH32V_EXTEND_EXTEND_CTR_LDO_TRIM  (0x3 << 10) /* 00000c00: LDO_TRIM */
#define CH32V_EXTEND_EXTEND_CTR_LDO_TRIM_MASK (0x3 << 10)
#define CH32V_EXTEND_EXTEND_CTR_HSE_KEEP_LP (1 << 12) /* 00001000: HSE_KEEP_LP */

/* OPA - OPA configuration */
#define CH32V_OPA_BASE                    0x40023804
#define CH32V_OPA_CR_OFFSET               0x0000
#define CH32V_OPA_CR                      (CH32V_OPA_BASE + CH32V_OPA_CR_OFFSET)
#define CH32V_OPA_CR_EN1                  (1 <<  0) /* 00000001: OPA Enable1 */
#define CH32V_OPA_CR_MODE1                (1 <<  1) /* 00000002: OPA MODE1 */
#define CH32V_OPA_CR_NSEL1                (1 <<  2) /* 00000004: OPA NSEL1 */
#define CH32V_OPA_CR_PSEL1                (1 <<  3) /* 00000008: OPA PSEL1 */
#define CH32V_OPA_CR_EN2                  (1 <<  4) /* 00000010: OPA Enable2 */
#define CH32V_OPA_CR_MODE2                (1 <<  5) /* 00000020: OPA MODE2 */
#define CH32V_OPA_CR_NSEL2                (1 <<  6) /* 00000040: OPA NSEL2 */
#define CH32V_OPA_CR_PSEL2                (1 <<  7) /* 00000080: OPA PSEL2 */
#define CH32V_OPA_CR_EN3                  (1 <<  8) /* 00000100: OPA Eable3 */
#define CH32V_OPA_CR_MODE3                (1 <<  9) /* 00000200: OPA MODE3 */
#define CH32V_OPA_CR_NSEL3                (1 << 10) /* 00000400: OPA NSEL3 */
#define CH32V_OPA_CR_PSEL3                (1 << 11) /* 00000800: OPA PSEL3 */
#define CH32V_OPA_CR_EN4                  (1 << 12) /* 00001000: OPA Enable4 */
#define CH32V_OPA_CR_MODE4                (1 << 13) /* 00002000: OPA MODE4 */
#define CH32V_OPA_CR_NSEL4                (1 << 14) /* 00004000: OPA NSEL4 */
#define CH32V_OPA_CR_PSEL4                (1 << 15) /* 00008000: OPA PSEL4 */

