robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
/* DMA1 - DMA1 controller */
#define CH32V_DMA1_BASE                   0x40020000
#define CH32V_DMA1_INTFR_OFFSET           0x0000
#define CH32V_DMA1_INTFR                  (CH32V_DMA1_BASE + CH32V_DMA1_INTFR_OFFSET) /* read-only */
#define CH32V_DMA1_INTFR_GIF1             (1 <<  0) /* 00000001: Channel 1 Global interrupt flag */
#define CH32V_DMA1_INTFR_TCIF1            (1 <<  1) /* 00000002: Channel 1 Transfer Complete flag */
#define CH32V_DMA1_INTFR_HTIF1            (1 <<  2) /* 00000004: Channel 1 Half Transfer Complete flag */
#define CH32V_DMA1_INTFR_TEIF1            (1 <<  3) /* 00000008: Channel 1 Transfer Error flag */
#define CH32V_DMA1_INTFR_GIF2             (1 <<  4) /* 00000010: Channel 2 Global interrupt flag */
#define CH32V_DMA1_INTFR_TCIF2            (1 <<  5) /* 00000020: Channel 2 Transfer Complete flag */
#define CH32V_DMA1_INTFR_HTIF2            (1 <<  6) /* 00000040: Channel 2 Half Transfer Complete flag */
#define CH32V_DMA1_INTFR_TEIF2            (1 <<  7) /* 00000080: Channel 2 Transfer Error flag */
#define CH32V_DMA1_INTFR_GIF3             (1 <<  8) /* 00000100: Channel 3 Global interrupt flag */
#define CH32V_DMA1_INTFR_TCIF3            (1 <<  9) /* 00000200: Channel 3 Transfer Complete flag */
#define CH32V_DMA1_INTFR_HTIF3            (1 << 10) /* 00000400: Channel 3 Half Transfer Complete flag */
#define CH32V_DMA1_INTFR_TEIF3            (1 << 11) /* 00000800: Channel 3 Transfer Error flag */
#define CH32V_DMA1_INTFR_GIF4             (1 << 12) /* 00001000: Channel 4 Global interrupt flag */
#define CH32V_DMA1_INTFR_TCIF4            (1 << 13) /* 00002000: Channel 4 Transfer Complete flag */
#define CH32V_DMA1_INTFR_HTIF4            (1 << 14) /* 00004000: Channel 4 Half Transfer Complete flag */
#define CH32V_DMA1_INTFR_TEIF4            (1 << 15) /* 00008000: Channel 4 Transfer Error flag */
#define CH32V_DMA1_INTFR_GIF5             (1 << 16) /* 00010000: Channel 5 Global interrupt flag */
#define CH32V_DMA1_INTFR_TCIF5            (1 << 17) /* 00020000: Channel 5 Transfer Complete flag */
#define CH32V_DMA1_INTFR_HTIF5            (1 << 18) /* 00040000: Channel 5 Half Transfer Complete flag */
#define CH32V_DMA1_INTFR_TEIF5            (1 << 19) /* 00080000: Channel 5 Transfer Error flag */
#define CH32V_DMA1_INTFR_GIF6             (1 << 20) /* 00100000: Channel 6 Global interrupt flag */
#define CH32V_DMA1_INTFR_TCIF6            (1 << 21) /* 00200000: Channel 6 Transfer Complete flag */
#define CH32V_DMA1_INTFR_HTIF6            (1 << 22) /* 00400000: Channel 6 Half Transfer Complete flag */
#define CH32V_DMA1_INTFR_TEIF6            (1 << 23) /* 00800000: Channel 6 Transfer Error flag */
#define CH32V_DMA1_INTFR_GIF7             (1 << 24) /* 01000000: Channel 7 Global interrupt flag */
#define CH32V_DMA1_INTFR_TCIF7            (1 << 25) /* 02000000: Channel 7 Transfer Complete flag */
#define CH32V_DMA1_INTFR_HTIF7            (1 << 26) /* 04000000: Channel 7 Half Transfer Complete flag */
#define CH32V_DMA1_INTFR_TEIF7            (1 << 27) /* 08000000: Channel 7 Transfer Error flag */
#define CH32V_DMA1_INTFCR_OFFSET          0x0004
#define CH32V_DMA1_INTFCR                 (CH32V_DMA1_BASE + CH32V_DMA1_INTFCR_OFFSET) /* write-only */
#define CH32V_DMA1_INTFCR_CGIF1           (1 <<  0) /* 00000001: Channel 1 Global interrupt clear */
#define CH32V_DMA1_INTFCR_CGIF2           (1 <<  4) /* 00000010: Channel 2 Global interrupt clear */
#define CH32V_DMA1_INTFCR_CGIF3           (1 <<  8) /* 00000100: Channel 3 Global interrupt clear */
#define CH32V_DMA1_INTFCR_CGIF4           (1 << 12) /* 00001000: Channel 4 Global interrupt clear */
#define CH32V_DMA1_INTFCR_CGIF5           (1 << 16) /* 00010000: Channel 5 Global interrupt clear */
#define CH32V_DMA1_INTFCR_CGIF6           (1 << 20) /* 00100000: Channel 6 Global interrupt clear */
#define CH32V_DMA1_INTFCR_CGIF7           (1 << 24) /* 01000000: Channel 7 Global interrupt clear */
#define CH32V_DMA1_INTFCR_CTCIF1          (1 <<  1) /* 00000002: Channel 1 Transfer Complete clear */
#define CH32V_DMA1_INTFCR_CTCIF2          (1 <<  5) /* 00000020: Channel 2 Transfer Complete clear */
#define CH32V_DMA1_INTFCR_CTCIF3          (1 <<  9) /* 00000200: Channel 3 Transfer Complete clear */
#define CH32V_DMA1_INTFCR_CTCIF4          (1 << 13) /* 00002000: Channel 4 Transfer Complete clear */
#define CH32V_DMA1_INTFCR_CTCIF5          (1 << 17) /* 00020000: Channel 5 Transfer Complete clear */
#define CH32V_DMA1_INTFCR_CTCIF6          (1 << 21) /* 00200000: Channel 6 Transfer Complete clear */
#define CH32V_DMA1_INTFCR_CTCIF7          (1 << 25) /* 02000000: Channel 7 Transfer Complete clear */
#define CH32V_DMA1_INTFCR_CHTIF1          (1 <<  2) /* 00000004: Channel 1 Half Transfer clear */
#define CH32V_DMA1_INTFCR_CHTIF2          (1 <<  6) /* 00000040: Channel 2 Half Transfer clear */
#define CH32V_DMA1_INTFCR_CHTIF3          (1 << 10) /* 00000400: Channel 3 Half Transfer clear */
#define CH32V_DMA1_INTFCR_CHTIF4          (1 << 14) /* 00004000: Channel 4 Half Transfer clear */
#define CH32V_DMA1_INTFCR_CHTIF5          (1 << 18) /* 00040000: Channel 5 Half Transfer clear */
#define CH32V_DMA1_INTFCR_CHTIF6          (1 << 22) /* 00400000: Channel 6 Half Transfer clear */
#define CH32V_DMA1_INTFCR_CHTIF7          (1 << 26) /* 04000000: Channel 7 Half Transfer clear */
#define CH32V_DMA1_INTFCR_CTEIF1          (1 <<  3) /* 00000008: Channel 1 Transfer Error clear */
#define CH32V_DMA1_INTFCR_CTEIF2          (1 <<  7) /* 00000080: Channel 2 Transfer Error clear */
#define CH32V_DMA1_INTFCR_CTEIF3          (1 << 11) /* 00000800: Channel 3 Transfer Error clear */
#define CH32V_DMA1_INTFCR_CTEIF4          (1 << 15) /* 00008000: Channel 4 Transfer Error clear */
#define CH32V_DMA1_INTFCR_CTEIF5          (1 << 19) /* 00080000: Channel 5 Transfer Error clear */
#define CH32V_DMA1_INTFCR_CTEIF6          (1 << 23) /* 00800000: Channel 6 Transfer Error clear */
#define CH32V_DMA1_INTFCR_CTEIF7          (1 << 27) /* 08000000: Channel 7 Transfer Error clear */
#define CH32V_DMA1_CFGR1_OFFSET           0x0008
#define CH32V_DMA1_CFGR1                  (CH32V_DMA1_BASE + CH32V_DMA1_CFGR1_OFFSET) /* read-write */
#define CH32V_DMA1_CFGR1_EN               (1 <<  0) /* 00000001: Channel enable */
#define CH32V_DMA1_CFGR1_TCIE             (1 <<  1) /* 00000002: Transfer complete interrupt enable */
#define CH32V_DMA1_CFGR1_HTIE             (1 <<  2) /* 00000004: Half Transfer interrupt enable */
#define CH32V_DMA1_CFGR1_TEIE             (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V_DMA1_CFGR1_DIR              (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V_DMA1_CFGR1_CIRC             (1 <<  5) /* 00000020: Circular mode */
#define CH32V_DMA1_CFGR1_PINC             (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V_DMA1_CFGR1_MINC             (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V_DMA1_CFGR1_PSIZE            (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V_DMA1_CFGR1_PSIZE_MASK       (0x3 << 8)
#define CH32V_DMA1_CFGR1_MSIZE            (0x3 << 10) /* 00000c00: Memory size */
#define CH32V_DMA1_CFGR1_MSIZE_MASK       (0x3 << 10)
#define CH32V_DMA1_CFGR1_PL               (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V_DMA1_CFGR1_PL_MASK          (0x3 << 12)
#define CH32V_DMA1_CFGR1_MEM2MEM          (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V_DMA1_CNTR1_OFFSET           0x000c
#define CH32V_DMA1_CNTR1                  (CH32V_DMA1_BASE + CH32V_DMA1_CNTR1_OFFSET) /* read-write */
#define CH32V_DMA1_CNTR1_NDT              (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V_DMA1_CNTR1_NDT_MASK         (0xffff << 0)
#define CH32V_DMA1_PADDR1_OFFSET          0x0010
#define CH32V_DMA1_PADDR1                 (CH32V_DMA1_BASE + CH32V_DMA1_PADDR1_OFFSET) /* read-write */
#define CH32V_DMA1_PADDR1_PA              (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA1_PADDR1_PA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_MADDR1_OFFSET          0x0014
#define CH32V_DMA1_MADDR1                 (CH32V_DMA1_BASE + CH32V_DMA1_MADDR1_OFFSET) /* read-write */
#define CH32V_DMA1_MADDR1_MA              (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA1_MADDR1_MA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_CFGR2_OFFSET           0x001c
#define CH32V_DMA1_CFGR2                  (CH32V_DMA1_BASE + CH32V_DMA1_CFGR2_OFFSET) /* read-write */
#define CH32V_DMA1_CFGR2_EN               (1 <<  0) /* 00000001: Channel enable */
#define CH32V_DMA1_CFGR2_TCIE             (1 <<  1) /* 00000002: Transfer complete interrupt enable */
#define CH32V_DMA1_CFGR2_HTIE             (1 <<  2) /* 00000004: Half Transfer interrupt enable */
#define CH32V_DMA1_CFGR2_TEIE             (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V_DMA1_CFGR2_DIR              (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V_DMA1_CFGR2_CIRC             (1 <<  5) /* 00000020: Circular mode */
#define CH32V_DMA1_CFGR2_PINC             (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V_DMA1_CFGR2_MINC             (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V_DMA1_CFGR2_PSIZE            (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V_DMA1_CFGR2_PSIZE_MASK       (0x3 << 8)
#define CH32V_DMA1_CFGR2_MSIZE            (0x3 << 10) /* 00000c00: Memory size */
#define CH32V_DMA1_CFGR2_MSIZE_MASK       (0x3 << 10)
#define CH32V_DMA1_CFGR2_PL               (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V_DMA1_CFGR2_PL_MASK          (0x3 << 12)
#define CH32V_DMA1_CFGR2_MEM2MEM          (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V_DMA1_CNTR2_OFFSET           0x0020
#define CH32V_DMA1_CNTR2                  (CH32V_DMA1_BASE + CH32V_DMA1_CNTR2_OFFSET) /* read-write */
#define CH32V_DMA1_CNTR2_NDT              (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V_DMA1_CNTR2_NDT_MASK         (0xffff << 0)
#define CH32V_DMA1_PADDR2_OFFSET          0x0024
#define CH32V_DMA1_PADDR2                 (CH32V_DMA1_BASE + CH32V_DMA1_PADDR2_OFFSET) /* read-write */
#define CH32V_DMA1_PADDR2_PA              (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA1_PADDR2_PA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_MADDR2_OFFSET          0x0028
#define CH32V_DMA1_MADDR2                 (CH32V_DMA1_BASE + CH32V_DMA1_MADDR2_OFFSET) /* read-write */
#define CH32V_DMA1_MADDR2_MA              (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA1_MADDR2_MA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_CFGR3_OFFSET           0x0030
#define CH32V_DMA1_CFGR3                  (CH32V_DMA1_BASE + CH32V_DMA1_CFGR3_OFFSET) /* read-write */
#define CH32V_DMA1_CFGR3_EN               (1 <<  0) /* 00000001: Channel enable */
#define CH32V_DMA1_CFGR3_TCIE             (1 <<  1) /* 00000002: Transfer complete interrupt enable */
#define CH32V_DMA1_CFGR3_HTIE             (1 <<  2) /* 00000004: Half Transfer interrupt enable */
#define CH32V_DMA1_CFGR3_TEIE             (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V_DMA1_CFGR3_DIR              (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V_DMA1_CFGR3_CIRC             (1 <<  5) /* 00000020: Circular mode */
#define CH32V_DMA1_CFGR3_PINC             (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V_DMA1_CFGR3_MINC             (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V_DMA1_CFGR3_PSIZE            (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V_DMA1_CFGR3_PSIZE_MASK       (0x3 << 8)
#define CH32V_DMA1_CFGR3_MSIZE            (0x3 << 10) /* 00000c00: Memory size */
#define CH32V_DMA1_CFGR3_MSIZE_MASK       (0x3 << 10)
#define CH32V_DMA1_CFGR3_PL               (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V_DMA1_CFGR3_PL_MASK          (0x3 << 12)
#define CH32V_DMA1_CFGR3_MEM2MEM          (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V_DMA1_CNTR3_OFFSET           0x0034
#define CH32V_DMA1_CNTR3                  (CH32V_DMA1_BASE + CH32V_DMA1_CNTR3_OFFSET) /* read-write */
#define CH32V_DMA1_CNTR3_NDT              (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V_DMA1_CNTR3_NDT_MASK         (0xffff << 0)
#define CH32V_DMA1_PADDR3_OFFSET          0x0038
#define CH32V_DMA1_PADDR3                 (CH32V_DMA1_BASE + CH32V_DMA1_PADDR3_OFFSET) /* read-write */
#define CH32V_DMA1_PADDR3_PA              (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA1_PADDR3_PA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_MADDR3_OFFSET          0x003c
#define CH32V_DMA1_MADDR3                 (CH32V_DMA1_BASE + CH32V_DMA1_MADDR3_OFFSET) /* read-write */
#define CH32V_DMA1_MADDR3_MA              (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA1_MADDR3_MA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_CFGR4_OFFSET           0x0044
#define CH32V_DMA1_CFGR4                  (CH32V_DMA1_BASE + CH32V_DMA1_CFGR4_OFFSET) /* read-write */
#define CH32V_DMA1_CFGR4_EN               (1 <<  0) /* 00000001: Channel enable */
#define CH32V_DMA1_CFGR4_TCIE             (1 <<  1) /* 00000002: Transfer complete interrupt enable */
#define CH32V_DMA1_CFGR4_HTIE             (1 <<  2) /* 00000004: Half Transfer interrupt enable */
#define CH32V_DMA1_CFGR4_TEIE             (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V_DMA1_CFGR4_DIR              (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V_DMA1_CFGR4_CIRC             (1 <<  5) /* 00000020: Circular mode */
#define CH32V_DMA1_CFGR4_PINC             (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V_DMA1_CFGR4_MINC             (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V_DMA1_CFGR4_PSIZE            (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V_DMA1_CFGR4_PSIZE_MASK       (0x3 << 8)
#define CH32V_DMA1_CFGR4_MSIZE            (0x3 << 10) /* 00000c00: Memory size */
#define CH32V_DMA1_CFGR4_MSIZE_MASK       (0x3 << 10)
#define CH32V_DMA1_CFGR4_PL               (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V_DMA1_CFGR4_PL_MASK          (0x3 << 12)
#define CH32V_DMA1_CFGR4_MEM2MEM          (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V_DMA1_CNTR4_OFFSET           0x0048
#define CH32V_DMA1_CNTR4                  (CH32V_DMA1_BASE + CH32V_DMA1_CNTR4_OFFSET) /* read-write */
#define CH32V_DMA1_CNTR4_NDT              (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V_DMA1_CNTR4_NDT_MASK         (0xffff << 0)
#define CH32V_DMA1_PADDR4_OFFSET          0x004c
#define CH32V_DMA1_PADDR4                 (CH32V_DMA1_BASE + CH32V_DMA1_PADDR4_OFFSET) /* read-write */
#define CH32V_DMA1_PADDR4_PA              (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA1_PADDR4_PA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_MADDR4_OFFSET          0x0050
#define CH32V_DMA1_MADDR4                 (CH32V_DMA1_BASE + CH32V_DMA1_MADDR4_OFFSET) /* read-write */
#define CH32V_DMA1_MADDR4_MA              (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA1_MADDR4_MA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_CFGR5_OFFSET           0x0058
#define CH32V_DMA1_CFGR5                  (CH32V_DMA1_BASE + CH32V_DMA1_CFGR5_OFFSET) /* read-write */
#define CH32V_DMA1_CFGR5_EN               (1 <<  0) /* 00000001: Channel enable */
#define CH32V_DMA1_CFGR5_TCIE             (1 <<  1) /* 00000002: Transfer complete interrupt enable */
#define CH32V_DMA1_CFGR5_HTIE             (1 <<  2) /* 00000004: Half Transfer interrupt enable */
#define CH32V_DMA1_CFGR5_TEIE             (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V_DMA1_CFGR5_DIR              (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V_DMA1_CFGR5_CIRC             (1 <<  5) /* 00000020: Circular mode */
#define CH32V_DMA1_CFGR5_PINC             (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V_DMA1_CFGR5_MINC             (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V_DMA1_CFGR5_PSIZE            (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V_DMA1_CFGR5_PSIZE_MASK       (0x3 << 8)
#define CH32V_DMA1_CFGR5_MSIZE            (0x3 << 10) /* 00000c00: Memory size */
#define CH32V_DMA1_CFGR5_MSIZE_MASK       (0x3 << 10)
#define CH32V_DMA1_CFGR5_PL               (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V_DMA1_CFGR5_PL_MASK          (0x3 << 12)
#define CH32V_DMA1_CFGR5_MEM2MEM          (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V_DMA1_CNTR5_OFFSET           0x005c
#define CH32V_DMA1_CNTR5                  (CH32V_DMA1_BASE + CH32V_DMA1_CNTR5_OFFSET) /* read-write */
#define CH32V_DMA1_CNTR5_NDT              (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V_DMA1_CNTR5_NDT_MASK         (0xffff << 0)
#define CH32V_DMA1_PADDR5_OFFSET          0x0060
#define CH32V_DMA1_PADDR5                 (CH32V_DMA1_BASE + CH32V_DMA1_PADDR5_OFFSET) /* read-write */
#define CH32V_DMA1_PADDR5_PA              (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA1_PADDR5_PA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_MADDR5_OFFSET          0x0064
#define CH32V_DMA1_MADDR5                 (CH32V_DMA1_BASE + CH32V_DMA1_MADDR5_OFFSET) /* read-write */
#define CH32V_DMA1_MADDR5_MA              (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA1_MADDR5_MA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_CFGR6_OFFSET           0x006c
#define CH32V_DMA1_CFGR6                  (CH32V_DMA1_BASE + CH32V_DMA1_CFGR6_OFFSET) /* read-write */
#define CH32V_DMA1_CFGR6_EN               (1 <<  0) /* 00000001: Channel enable */
#define CH32V_DMA1_CFGR6_TCIE             (1 <<  1) /* 00000002: Transfer complete interrupt enable */
#define CH32V_DMA1_CFGR6_HTIE             (1 <<  2) /* 00000004: Half Transfer interrupt enable */
#define CH32V_DMA1_CFGR6_TEIE             (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V_DMA1_CFGR6_DIR              (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V_DMA1_CFGR6_CIRC             (1 <<  5) /* 00000020: Circular mode */
#define CH32V_DMA1_CFGR6_PINC             (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V_DMA1_CFGR6_MINC             (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V_DMA1_CFGR6_PSIZE            (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V_DMA1_CFGR6_PSIZE_MASK       (0x3 << 8)
#define CH32V_DMA1_CFGR6_MSIZE            (0x3 << 10) /* 00000c00: Memory size */
#define CH32V_DMA1_CFGR6_MSIZE_MASK       (0x3 << 10)
#define CH32V_DMA1_CFGR6_PL               (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V_DMA1_CFGR6_PL_MASK          (0x3 << 12)
#define CH32V_DMA1_CFGR6_MEM2MEM          (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V_DMA1_CNTR6_OFFSET           0x0070
#define CH32V_DMA1_CNTR6                  (CH32V_DMA1_BASE + CH32V_DMA1_CNTR6_OFFSET) /* read-write */
#define CH32V_DMA1_CNTR6_NDT              (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V_DMA1_CNTR6_NDT_MASK         (0xffff << 0)
#define CH32V_DMA1_PADDR6_OFFSET          0x0074
#define CH32V_DMA1_PADDR6                 (CH32V_DMA1_BASE + CH32V_DMA1_PADDR6_OFFSET) /* read-write */
#define CH32V_DMA1_PADDR6_PA              (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA1_PADDR6_PA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_MADDR6_OFFSET          0x0078
#define CH32V_DMA1_MADDR6                 (CH32V_DMA1_BASE + CH32V_DMA1_MADDR6_OFFSET) /* read-write */
#define CH32V_DMA1_MADDR6_MA              (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA1_MADDR6_MA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_CFGR7_OFFSET           0x0080
#define CH32V_DMA1_CFGR7                  (CH32V_DMA1_BASE + CH32V_DMA1_CFGR7_OFFSET) /* read-write */
#define CH32V_DMA1_CFGR7_EN               (1 <<  0) /* 00000001: Channel enable */
#define CH32V_DMA1_CFGR7_TCIE             (1 <<  1) /* 00000002: Transfer complete interrupt enable */
#define CH32V_DMA1_CFGR7_HTIE             (1 <<  2) /* 00000004: Half Transfer interrupt enable */
#define CH32V_DMA1_CFGR7_TEIE             (1 <<  3) /* 00000008: Transfer error interrupt enable */
#define CH32V_DMA1_CFGR7_DIR              (1 <<  4) /* 00000010: Data transfer direction */
#define CH32V_DMA1_CFGR7_CIRC             (1 <<  5) /* 00000020: Circular mode */
#define CH32V_DMA1_CFGR7_PINC             (1 <<  6) /* 00000040: Peripheral increment mode */
#define CH32V_DMA1_CFGR7_MINC             (1 <<  7) /* 00000080: Memory increment mode */
#define CH32V_DMA1_CFGR7_PSIZE            (0x3 << 8) /* 00000300: Peripheral size */
#define CH32V_DMA1_CFGR7_PSIZE_MASK       (0x3 << 8)
#define CH32V_DMA1_CFGR7_MSIZE            (0x3 << 10) /* 00000c00: Memory size */
#define CH32V_DMA1_CFGR7_MSIZE_MASK       (0x3 << 10)
#define CH32V_DMA1_CFGR7_PL               (0x3 << 12) /* 00003000: Channel Priority level */
#define CH32V_DMA1_CFGR7_PL_MASK          (0x3 << 12)
#define CH32V_DMA1_CFGR7_MEM2MEM          (1 << 14) /* 00004000: Memory to memory mode */
#define CH32V_DMA1_CNTR7_OFFSET           0x0084
#define CH32V_DMA1_CNTR7                  (CH32V_DMA1_BASE + CH32V_DMA1_CNTR7_OFFSET) /* read-write */
#define CH32V_DMA1_CNTR7_NDT              (0xffff << 0) /* 0000ffff: Number of data to transfer */
#define CH32V_DMA1_CNTR7_NDT_MASK         (0xffff << 0)
#define CH32V_DMA1_PADDR7_OFFSET          0x0088
#define CH32V_DMA1_PADDR7                 (CH32V_DMA1_BASE + CH32V_DMA1_PADDR7_OFFSET) /* read-write */
#define CH32V_DMA1_PADDR7_PA              (0xffffffff << 0) /* ffffffff: Peripheral address */
#define CH32V_DMA1_PADDR7_PA_MASK         (0xffffffff << 0)
#define CH32V_DMA1_MADDR7_OFFSET          0x008c
#define CH32V_DMA1_MADDR7                 (CH32V_DMA1_BASE + CH32V_DMA1_MADDR7_OFFSET) /* read-write */
#define CH32V_DMA1_MADDR7_MA              (0xffffffff << 0) /* ffffffff: Memory address */
#define CH32V_DMA1_MADDR7_MA_MASK         (0xffffffff << 0)

