robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
/* TIM2 - General purpose timer */
#define CH32V_TIM2_BASE                   0x40000000
#define CH32V_TIM2_CTLR1_OFFSET           0x0000
#define CH32V_TIM2_CTLR1                  (CH32V_TIM2_BASE + CH32V_TIM2_CTLR1_OFFSET) /* read-write */
#define CH32V_TIM2_CTLR1_CKD              (0x3 << 8) /* 00000300: Clock division */
#define CH32V_TIM2_CTLR1_CKD_MASK         (0x3 << 8)
#define CH32V_TIM2_CTLR1_ARPE             (1 <<  7) /* 00000080: Auto-reload preload enable */
#define CH32V_TIM2_CTLR1_CMS              (0x3 << 5) /* 00000060: Center-aligned mode selection */
#define CH32V_TIM2_CTLR1_CMS_MASK         (0x3 << 5)
#define CH32V_TIM2_CTLR1_DIR              (1 <<  4) /* 00000010: Direction */
#define CH32V_TIM2_CTLR1_OPM              (1 <<  3) /* 00000008: One-pulse mode */
#define CH32V_TIM2_CTLR1_URS              (1 <<  2) /* 00000004: Update request source */
#define CH32V_TIM2_CTLR1_UDIS             (1 <<  1) /* 00000002: Update disable */
#define CH32V_TIM2_CTLR1_CEN              (1 <<  0) /* 00000001: Counter enable */
#define CH32V_TIM2_CTLR2_OFFSET           0x0004
#define CH32V_TIM2_CTLR2                  (CH32V_TIM2_BASE + CH32V_TIM2_CTLR2_OFFSET) /* read-write */
#define CH32V_TIM2_CTLR2_TI1S             (1 <<  7) /* 00000080: TI1 selection */
#define CH32V_TIM2_CTLR2_MMS              (0x7 << 4) /* 00000070: Master mode selection */
#define CH32V_TIM2_CTLR2_MMS_MASK         (0x7 << 4)
#define CH32V_TIM2_CTLR2_CCDS             (1 <<  3) /* 00000008: Capture/compare DMA selection */
#define CH32V_TIM2_CTLR2_CCUS             (1 <<  2) /* 00000004: Update selection */
#define CH32V_TIM2_CTLR2_CCPC             (1 <<  0) /* 00000001: Compare selection */
#define CH32V_TIM2_SMCFGR_OFFSET          0x0008
#define CH32V_TIM2_SMCFGR                 (CH32V_TIM2_BASE + CH32V_TIM2_SMCFGR_OFFSET) /* read-write */
#define CH32V_TIM2_SMCFGR_ETP             (1 << 15) /* 00008000: External trigger polarity */
#define CH32V_TIM2_SMCFGR_ECE             (1 << 14) /* 00004000: External clock enable */
#define CH32V_TIM2_SMCFGR_ETPS            (0x3 << 12) /* 00003000: External trigger prescaler */
#define CH32V_TIM2_SMCFGR_ETPS_MASK       (0x3 << 12)
#define CH32V_TIM2_SMCFGR_ETF             (0xf << 8) /* 00000f00: External trigger filter */
#define CH32V_TIM2_SMCFGR_ETF_MASK        (0xf << 8)
#define CH32V_TIM2_SMCFGR_MSM             (1 <<  7) /* 00000080: Master/Slave mode */
#define CH32V_TIM2_SMCFGR_TS              (0x7 << 4) /* 00000070: Trigger selection */
#define CH32V_TIM2_SMCFGR_TS_MASK         (0x7 << 4)
#define CH32V_TIM2_SMCFGR_SMS             (0x7 << 0) /* 00000007: Slave mode selection */
#define CH32V_TIM2_SMCFGR_SMS_MASK        (0x7 << 0)
#define CH32V_TIM2_DMAINTENR_OFFSET       0x000c
#define CH32V_TIM2_DMAINTENR              (CH32V_TIM2_BASE + CH32V_TIM2_DMAINTENR_OFFSET) /* read-write */
#define CH32V_TIM2_DMAINTENR_TDE          (1 << 14) /* 00004000: Trigger DMA request enable */
#define CH32V_TIM2_DMAINTENR_COMDE        (1 << 13) /* 00002000: COM DMA request enable */
#define CH32V_TIM2_DMAINTENR_CC4DE        (1 << 12) /* 00001000: Capture/Compare 4 DMA request enable */
#define CH32V_TIM2_DMAINTENR_CC3DE        (1 << 11) /* 00000800: Capture/Compare 3 DMA request enable */
#define CH32V_TIM2_DMAINTENR_CC2DE        (1 << 10) /* 00000400: Capture/Compare 2 DMA request enable */
#define CH32V_TIM2_DMAINTENR_CC1DE        (1 <<  9) /* 00000200: Capture/Compare 1 DMA request enable */
#define CH32V_TIM2_DMAINTENR_UDE          (1 <<  8) /* 00000100: Update DMA request enable */
#define CH32V_TIM2_DMAINTENR_TIE          (1 <<  6) /* 00000040: Trigger interrupt enable */
#define CH32V_TIM2_DMAINTENR_CC4IE        (1 <<  4) /* 00000010: Capture/Compare 4 interrupt enable */
#define CH32V_TIM2_DMAINTENR_CC3IE        (1 <<  3) /* 00000008: Capture/Compare 3 interrupt enable */
#define CH32V_TIM2_DMAINTENR_CC2IE        (1 <<  2) /* 00000004: Capture/Compare 2 interrupt enable */
#define CH32V_TIM2_DMAINTENR_CC1IE        (1 <<  1) /* 00000002: Capture/Compare 1 interrupt enable */
#define CH32V_TIM2_DMAINTENR_UIE          (1 <<  0) /* 00000001: Update interrupt enable */
#define CH32V_TIM2_INTFR_OFFSET           0x0010
#define CH32V_TIM2_INTFR                  (CH32V_TIM2_BASE + CH32V_TIM2_INTFR_OFFSET) /* read-write */
#define CH32V_TIM2_INTFR_CC4OF            (1 << 12) /* 00001000: Capture/Compare 4 overcapture flag */
#define CH32V_TIM2_INTFR_CC3OF            (1 << 11) /* 00000800: Capture/Compare 3 overcapture flag */
#define CH32V_TIM2_INTFR_CC2OF            (1 << 10) /* 00000400: Capture/compare 2 overcapture flag */
#define CH32V_TIM2_INTFR_CC1OF            (1 <<  9) /* 00000200: Capture/Compare 1 overcapture flag */
#define CH32V_TIM2_INTFR_TIF              (1 <<  6) /* 00000040: Trigger interrupt flag */
#define CH32V_TIM2_INTFR_CC4IF            (1 <<  4) /* 00000010: Capture/Compare 4 interrupt flag */
#define CH32V_TIM2_INTFR_CC3IF            (1 <<  3) /* 00000008: Capture/Compare 3 interrupt flag */
#define CH32V_TIM2_INTFR_CC2IF            (1 <<  2) /* 00000004: Capture/Compare 2 interrupt flag */
#define CH32V_TIM2_INTFR_CC1IF            (1 <<  1) /* 00000002: Capture/compare 1 interrupt flag */
#define CH32V_TIM2_INTFR_UIF              (1 <<  0) /* 00000001: Update interrupt flag */
#define CH32V_TIM2_SWEVGR_OFFSET          0x0014
#define CH32V_TIM2_SWEVGR                 (CH32V_TIM2_BASE + CH32V_TIM2_SWEVGR_OFFSET) /* write-only */
#define CH32V_TIM2_SWEVGR_BG              (1 <<  7) /* 00000080: Brake generation */
#define CH32V_TIM2_SWEVGR_TG              (1 <<  6) /* 00000040: Trigger generation */
#define CH32V_TIM2_SWEVGR_COMG            (1 <<  5) /* 00000020: Capture/compare generation */
#define CH32V_TIM2_SWEVGR_CC4G            (1 <<  4) /* 00000010: Capture/compare 4 generation */
#define CH32V_TIM2_SWEVGR_CC3G            (1 <<  3) /* 00000008: Capture/compare 3 generation */
#define CH32V_TIM2_SWEVGR_CC2G            (1 <<  2) /* 00000004: Capture/compare 2 generation */
#define CH32V_TIM2_SWEVGR_CC1G            (1 <<  1) /* 00000002: Capture/compare 1 generation */
#define CH32V_TIM2_SWEVGR_UG              (1 <<  0) /* 00000001: Update generation */
#define CH32V_TIM2_CHCTLR1_Output_OFFSET  0x0018
#define CH32V_TIM2_CHCTLR1_Output         (CH32V_TIM2_BASE + CH32V_TIM2_CHCTLR1_Output_OFFSET) /* read-write */
#define CH32V_TIM2_CHCTLR1_Output_OC2CE   (1 << 15) /* 00008000: Output compare 2 clear enable */
#define CH32V_TIM2_CHCTLR1_Output_OC2M    (0x7 << 12) /* 00007000: Output compare 2 mode */
#define CH32V_TIM2_CHCTLR1_Output_OC2M_MASK (0x7 << 12)
#define CH32V_TIM2_CHCTLR1_Output_OC2PE   (1 << 11) /* 00000800: Output compare 2 preload enable */
#define CH32V_TIM2_CHCTLR1_Output_OC2FE   (1 << 10) /* 00000400: Output compare 2 fast enable */
#define CH32V_TIM2_CHCTLR1_Output_CC2S    (0x3 << 8) /* 00000300: Capture/Compare 2 selection */
#define CH32V_TIM2_CHCTLR1_Output_CC2S_MASK (0x3 << 8)
#define CH32V_TIM2_CHCTLR1_Output_OC1CE   (1 <<  7) /* 00000080: Output compare 1 clear enable */
#define CH32V_TIM2_CHCTLR1_Output_OC1M    (0x7 << 4) /* 00000070: Output compare 1 mode */
#define CH32V_TIM2_CHCTLR1_Output_OC1M_MASK (0x7 << 4)
#define CH32V_TIM2_CHCTLR1_Output_OC1PE   (1 <<  3) /* 00000008: Output compare 1 preload enable */
#define CH32V_TIM2_CHCTLR1_Output_OC1FE   (1 <<  2) /* 00000004: Output compare 1 fast enable */
#define CH32V_TIM2_CHCTLR1_Output_CC1S    (0x3 << 0) /* 00000003: Capture/Compare 1 selection */
#define CH32V_TIM2_CHCTLR1_Output_CC1S_MASK (0x3 << 0)
#define CH32V_TIM2_CHCTLR1_Input_OFFSET   0x0018
#define CH32V_TIM2_CHCTLR1_Input          (CH32V_TIM2_BASE + CH32V_TIM2_CHCTLR1_Input_OFFSET) /* read-write */
#define CH32V_TIM2_CHCTLR1_Input_IC2F     (0xf << 12) /* 0000f000: Input capture 2 filter */
#define CH32V_TIM2_CHCTLR1_Input_IC2F_MASK (0xf << 12)
#define CH32V_TIM2_CHCTLR1_Input_IC2PSC   (0x3 << 10) /* 00000c00: Input capture 2 prescaler */
#define CH32V_TIM2_CHCTLR1_Input_IC2PSC_MASK (0x3 << 10)
#define CH32V_TIM2_CHCTLR1_Input_CC2S     (0x3 << 8) /* 00000300: Capture/compare 2 selection */
#define CH32V_TIM2_CHCTLR1_Input_CC2S_MASK (0x3 << 8)
#define CH32V_TIM2_CHCTLR1_Input_IC1F     (0xf << 4) /* 000000f0: Input capture 1 filter */
#define CH32V_TIM2_CHCTLR1_Input_IC1F_MASK (0xf << 4)
#define CH32V_TIM2_CHCTLR1_Input_IC1PSC   (0x3 << 2) /* 0000000c: Input capture 1 prescaler */
#define CH32V_TIM2_CHCTLR1_Input_IC1PSC_MASK (0x3 << 2)
#define CH32V_TIM2_CHCTLR1_Input_CC1S     (0x3 << 0) /* 00000003: Capture/Compare 1 selection */
#define CH32V_TIM2_CHCTLR1_Input_CC1S_MASK (0x3 << 0)
#define CH32V_TIM2_CHCTLR2_Output_OFFSET  0x001c
#define CH32V_TIM2_CHCTLR2_Output         (CH32V_TIM2_BASE + CH32V_TIM2_CHCTLR2_Output_OFFSET) /* read-write */
#define CH32V_TIM2_CHCTLR2_Output_OC4CE   (1 << 15) /* 00008000: Output compare 4 clear enable */
#define CH32V_TIM2_CHCTLR2_Output_OC4M    (0x7 << 12) /* 00007000: Output compare 4 mode */
#define CH32V_TIM2_CHCTLR2_Output_OC4M_MASK (0x7 << 12)
#define CH32V_TIM2_CHCTLR2_Output_OC4PE   (1 << 11) /* 00000800: Output compare 4 preload enable */
#define CH32V_TIM2_CHCTLR2_Output_OC4FE   (1 << 10) /* 00000400: Output compare 4 fast enable */
#define CH32V_TIM2_CHCTLR2_Output_CC4S    (0x3 << 8) /* 00000300: Capture/Compare 4 selection */
#define CH32V_TIM2_CHCTLR2_Output_CC4S_MASK (0x3 << 8)
#define CH32V_TIM2_CHCTLR2_Output_OC3CE   (1 <<  7) /* 00000080: Output compare 3 clear enable */
#define CH32V_TIM2_CHCTLR2_Output_OC3M    (0x7 << 4) /* 00000070: Output compare 3 mode */
#define CH32V_TIM2_CHCTLR2_Output_OC3M_MASK (0x7 << 4)
#define CH32V_TIM2_CHCTLR2_Output_OC3PE   (1 <<  3) /* 00000008: Output compare 3 preload enable */
#define CH32V_TIM2_CHCTLR2_Output_OC3FE   (1 <<  2) /* 00000004: Output compare 3 fast enable */
#define CH32V_TIM2_CHCTLR2_Output_CC3S    (0x3 << 0) /* 00000003: Capture/Compare 3 selection */
#define CH32V_TIM2_CHCTLR2_Output_CC3S_MASK (0x3 << 0)
#define CH32V_TIM2_CHCTLR2_Input_OFFSET   0x001c
#define CH32V_TIM2_CHCTLR2_Input          (CH32V_TIM2_BASE + CH32V_TIM2_CHCTLR2_Input_OFFSET) /* read-write */
#define CH32V_TIM2_CHCTLR2_Input_IC4F     (0xf << 12) /* 0000f000: Input capture 4 filter */
#define CH32V_TIM2_CHCTLR2_Input_IC4F_MASK (0xf << 12)
#define CH32V_TIM2_CHCTLR2_Input_IC4PSC   (0x3 << 10) /* 00000c00: Input capture 4 prescaler */
#define CH32V_TIM2_CHCTLR2_Input_IC4PSC_MASK (0x3 << 10)
#define CH32V_TIM2_CHCTLR2_Input_CC4S     (0x3 << 8) /* 00000300: Capture/Compare 4 selection */
#define CH32V_TIM2_CHCTLR2_Input_CC4S_MASK (0x3 << 8)
#define CH32V_TIM2_CHCTLR2_Input_IC3F     (0xf << 4) /* 000000f0: Input capture 3 filter */
#define CH32V_TIM2_CHCTLR2_Input_IC3F_MASK (0xf << 4)
#define CH32V_TIM2_CHCTLR2_Input_IC3PSC   (0x3 << 2) /* 0000000c: Input capture 3 prescaler */
#define CH32V_TIM2_CHCTLR2_Input_IC3PSC_MASK (0x3 << 2)
#define CH32V_TIM2_CHCTLR2_Input_CC3S     (0x3 << 0) /* 00000003: Capture/Compare 3 selection */
#define CH32V_TIM2_CHCTLR2_Input_CC3S_MASK (0x3 << 0)
#define CH32V_TIM2_CCER_OFFSET            0x0020
#define CH32V_TIM2_CCER                   (CH32V_TIM2_BASE + CH32V_TIM2_CCER_OFFSET) /* read-write */
#define CH32V_TIM2_CCER_CC4P              (1 << 13) /* 00002000: Capture/Compare 3 output Polarity */
#define CH32V_TIM2_CCER_CC4E              (1 << 12) /* 00001000: Capture/Compare 4 output enable */
#define CH32V_TIM2_CCER_CC3P              (1 <<  9) /* 00000200: Capture/Compare 3 output Polarity */
#define CH32V_TIM2_CCER_CC3E              (1 <<  8) /* 00000100: Capture/Compare 3 output enable */
#define CH32V_TIM2_CCER_CC2P              (1 <<  5) /* 00000020: Capture/Compare 2 output Polarity */
#define CH32V_TIM2_CCER_CC2E              (1 <<  4) /* 00000010: Capture/Compare 2 output enable */
#define CH32V_TIM2_CCER_CC1P              (1 <<  1) /* 00000002: Capture/Compare 1 output Polarity */
#define CH32V_TIM2_CCER_CC1E              (1 <<  0) /* 00000001: Capture/Compare 1 output enable */
#define CH32V_TIM2_CNT_OFFSET             0x0024
#define CH32V_TIM2_CNT                    (CH32V_TIM2_BASE + CH32V_TIM2_CNT_OFFSET) /* read-write */
#define CH32V_TIM2_CNT_CNT                (0xffff << 0) /* 0000ffff: counter value */
#define CH32V_TIM2_CNT_CNT_MASK           (0xffff << 0)
#define CH32V_TIM2_PSC_OFFSET             0x0028
#define CH32V_TIM2_PSC                    (CH32V_TIM2_BASE + CH32V_TIM2_PSC_OFFSET) /* read-write */
#define CH32V_TIM2_PSC_PSC                (0xffff << 0) /* 0000ffff: Prescaler value */
#define CH32V_TIM2_PSC_PSC_MASK           (0xffff << 0)
#define CH32V_TIM2_ATRLR_OFFSET           0x002c
#define CH32V_TIM2_ATRLR                  (CH32V_TIM2_BASE + CH32V_TIM2_ATRLR_OFFSET) /* read-write */
#define CH32V_TIM2_ATRLR_ATRLR            (0xffff << 0) /* 0000ffff: Auto-reload value */
#define CH32V_TIM2_ATRLR_ATRLR_MASK       (0xffff << 0)
#define CH32V_TIM2_CH1CVR_OFFSET          0x0034
#define CH32V_TIM2_CH1CVR                 (CH32V_TIM2_BASE + CH32V_TIM2_CH1CVR_OFFSET) /* read-write */
#define CH32V_TIM2_CH1CVR_CH1CVR          (0xffff << 0) /* 0000ffff: Capture/Compare 1 value */
#define CH32V_TIM2_CH1CVR_CH1CVR_MASK     (0xffff << 0)
#define CH32V_TIM2_CH2CVR_OFFSET          0x0038
#define CH32V_TIM2_CH2CVR                 (CH32V_TIM2_BASE + CH32V_TIM2_CH2CVR_OFFSET) /* read-write */
#define CH32V_TIM2_CH2CVR_CH2CVR          (0xffff << 0) /* 0000ffff: Capture/Compare 2 value */
#define CH32V_TIM2_CH2CVR_CH2CVR_MASK     (0xffff << 0)
#define CH32V_TIM2_CH3CVR_OFFSET          0x003c
#define CH32V_TIM2_CH3CVR                 (CH32V_TIM2_BASE + CH32V_TIM2_CH3CVR_OFFSET) /* read-write */
#define CH32V_TIM2_CH3CVR_CH3CVR          (0xffff << 0) /* 0000ffff: Capture/Compare value */
#define CH32V_TIM2_CH3CVR_CH3CVR_MASK     (0xffff << 0)
#define CH32V_TIM2_CH4CVR_OFFSET          0x0040
#define CH32V_TIM2_CH4CVR                 (CH32V_TIM2_BASE + CH32V_TIM2_CH4CVR_OFFSET) /* read-write */
#define CH32V_TIM2_CH4CVR_CH4CVR          (0xffff << 0) /* 0000ffff: Capture/Compare value */
#define CH32V_TIM2_CH4CVR_CH4CVR_MASK     (0xffff << 0)
#define CH32V_TIM2_DMACFGR_OFFSET         0x0048
#define CH32V_TIM2_DMACFGR                (CH32V_TIM2_BASE + CH32V_TIM2_DMACFGR_OFFSET) /* read-write */
#define CH32V_TIM2_DMACFGR_DBL            (0x1f << 8) /* 00001f00: DMA burst length */
#define CH32V_TIM2_DMACFGR_DBL_MASK       (0x1f << 8)
#define CH32V_TIM2_DMACFGR_DBA            (0x1f << 0) /* 0000001f: DMA base address */
#define CH32V_TIM2_DMACFGR_DBA_MASK       (0x1f << 0)
#define CH32V_TIM2_DMAADR_OFFSET          0x004c
#define CH32V_TIM2_DMAADR                 (CH32V_TIM2_BASE + CH32V_TIM2_DMAADR_OFFSET) /* read-write */
#define CH32V_TIM2_DMAADR_DMAADR          (0xffff << 0) /* 0000ffff: DMA register for burst accesses */
#define CH32V_TIM2_DMAADR_DMAADR_MASK     (0xffff << 0)

