robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
/* USBHD - USB register */
#define CH32V_USBHD_BASE                  0x40023400
#define CH32V_USBHD_USB_CTRL_OFFSET       0x0000
#define CH32V_USBHD_USB_CTRL              (CH32V_USBHD_BASE + CH32V_USBHD_USB_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_USB_CTRL_RB_UC_DMA_EN (1 <<  0) /* 00000001: DMA enable and DMA interrupt enable for USB */
#define CH32V_USBHD_USB_CTRL_RB_UC_CLR_ALL (1 <<  1) /* 00000002: force clear FIFO and count of USB */
#define CH32V_USBHD_USB_CTRL_RB_UC_RESET_SIE (1 <<  2) /* 00000004: force reset USB SIE, need software clear */
#define CH32V_USBHD_USB_CTRL_RB_UC_INT_BUSY (1 <<  3) /* 00000008: enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid */
#define CH32V_USBHD_USB_CTRL_RB_UC_DEV_PU_EN (1 <<  4) /* 00000010: USB device enable and internal pullup resistance enable */
#define CH32V_USBHD_USB_CTRL_RB_UC_SPEED_TYPE (0x3 << 5) /* 00000060: enable USB low speed: 00=full speed, 01=high speed, 10 =low speed */
#define CH32V_USBHD_USB_CTRL_RB_UC_SPEED_TYPE_MASK (0x3 << 5)
#define CH32V_USBHD_USB_CTRL_RB_UC_HOST_MODE (1 <<  7) /* 00000080: enable USB host mode: 0=device mode, 1=host mode */
#define CH32V_USBHD_UHOST_CTRL_OFFSET     0x0001
#define CH32V_USBHD_UHOST_CTRL            (CH32V_USBHD_BASE + CH32V_USBHD_UHOST_CTRL_OFFSET)
#define CH32V_USBHD_UHOST_CTRL_bUH_TX_BUS_RESET (1 <<  0) /* 00000001: USB host bus reset status */
#define CH32V_USBHD_UHOST_CTRL_bUH_TX_BUS_SUSPEND (1 <<  1) /* 00000002: the host sends hang sigal */
#define CH32V_USBHD_UHOST_CTRL_bUH_TX_BUS_RESUME (1 <<  2) /* 00000004: host wake up device */
#define CH32V_USBHD_UHOST_CTRL_bUH_REMOTE_WKUP (1 <<  3) /* 00000008: the remoke wake-up */
#define CH32V_USBHD_UHOST_CTRL_bUH_PHY_SUSPENDM (1 <<  4) /* 00000010: USB-PHY thesuspended state the internal USB-PLL is turned off */
#define CH32V_USBHD_UHOST_CTRL_bUH_SOF_FREE (1 <<  6) /* 00000040: the bus is idle */
#define CH32V_USBHD_UHOST_CTRL_bUH_SOF_EN (1 <<  7) /* 00000080: automatically generate the SOF packet enabling control bit */
#define CH32V_USBHD_USB_INT_EN_OFFSET     0x0002
#define CH32V_USBHD_USB_INT_EN            (CH32V_USBHD_BASE + CH32V_USBHD_USB_INT_EN_OFFSET) /* read-write */
#define CH32V_USBHD_USB_INT_EN_RB_UIE_BUS_RST__RB_UIE_DETECT (1 <<  0) /* 00000001: enable interrupt for USB bus reset event for USB device mode;enable interrupt for USB device detected event for USB host mode */
#define CH32V_USBHD_USB_INT_EN_RB_UIE_TRANSFER (1 <<  1) /* 00000002: enable interrupt for USB transfer completion */
#define CH32V_USBHD_USB_INT_EN_RB_UIE_SUSPEND (1 <<  2) /* 00000004: enable interrupt for USB suspend or resume event */
#define CH32V_USBHD_USB_INT_EN_RB_UIE_SOF_ACT (1 <<  3) /* 00000008: indicate host SOF timer action status for USB host */
#define CH32V_USBHD_USB_INT_EN_RB_UIE_FIFO_OV (1 <<  4) /* 00000010: enable interrupt for FIFO overflow */
#define CH32V_USBHD_USB_INT_EN_RB_UIE_SETUP_ACT (1 <<  5) /* 00000020: indicate host SETUP timer action status for USB host */
#define CH32V_USBHD_USB_INT_EN_RB_UIE_ISO_ACT (1 <<  6) /* 00000040: enable interrupt for NAK responded for USB device mode */
#define CH32V_USBHD_USB_INT_EN_RB_UIE_DEV_NAK (1 <<  7) /* 00000080: enable interrupt for NAK responded for USB device mode */
#define CH32V_USBHD_USB_DEV_AD_OFFSET     0x0003
#define CH32V_USBHD_USB_DEV_AD            (CH32V_USBHD_BASE + CH32V_USBHD_USB_DEV_AD_OFFSET) /* read-write */
#define CH32V_USBHD_USB_DEV_AD_MASK_USB_ADDR (0x7f << 0) /* 0000007f: bit mask for USB device address */
#define CH32V_USBHD_USB_DEV_AD_MASK_USB_ADDR_MASK (0x7f << 0)
#define CH32V_USBHD_USB_DEV_AD_RB_UDA_GP_BIT (1 <<  7) /* 00000080: general purpose bit */
#define CH32V_USBHD_USB_FRAME_NO_OFFSET   0x0004
#define CH32V_USBHD_USB_FRAME_NO          (CH32V_USBHD_BASE + CH32V_USBHD_USB_FRAME_NO_OFFSET) /* read-only */
#define CH32V_USBHD_USB_FRAME_NO_USB_FRAME_NO (0xffff << 0) /* 0000ffff: USB_FRAME_NO */
#define CH32V_USBHD_USB_FRAME_NO_USB_FRAME_NO_MASK (0xffff << 0)
#define CH32V_USBHD_USB_USB_SUSPEND_OFFSET 0x0006
#define CH32V_USBHD_USB_USB_SUSPEND       (CH32V_USBHD_BASE + CH32V_USBHD_USB_USB_SUSPEND_OFFSET) /* read-write */
#define CH32V_USBHD_USB_USB_SUSPEND_USB_SYS_MOD (0x3 << 0) /* 00000003: USB_SYS_MOD */
#define CH32V_USBHD_USB_USB_SUSPEND_USB_SYS_MOD_MASK (0x3 << 0)
#define CH32V_USBHD_USB_USB_SUSPEND_USB_WAKEUP (1 <<  2) /* 00000004: remote resume */
#define CH32V_USBHD_USB_USB_SUSPEND_USB_LINESTATE (0x3 << 4) /* 00000030: USB_LINESTATE */
#define CH32V_USBHD_USB_USB_SUSPEND_USB_LINESTATE_MASK (0x3 << 4)
#define CH32V_USBHD_USB_SPEED_TYPE_OFFSET 0x0008
#define CH32V_USBHD_USB_SPEED_TYPE        (CH32V_USBHD_BASE + CH32V_USBHD_USB_SPEED_TYPE_OFFSET) /* read-only */
#define CH32V_USBHD_USB_SPEED_TYPE_USB_SPEED_TYPE (0x3 << 0) /* 00000003: USB_SPEED_TYPE */
#define CH32V_USBHD_USB_SPEED_TYPE_USB_SPEED_TYPE_MASK (0x3 << 0)
#define CH32V_USBHD_USB_MIS_ST_OFFSET     0x0009
#define CH32V_USBHD_USB_MIS_ST            (CH32V_USBHD_BASE + CH32V_USBHD_USB_MIS_ST_OFFSET) /* read-only */
#define CH32V_USBHD_USB_MIS_ST_RB_UMS_SPLIT_CAN (1 <<  0) /* 00000001: RO, indicate device attached status on USB host */
#define CH32V_USBHD_USB_MIS_ST_RB_UMS_ATTACH (1 <<  1) /* 00000002: RO, indicate UDM level saved at device attached to USB host */
#define CH32V_USBHD_USB_MIS_ST_RB_UMS_SUSPEND (1 <<  2) /* 00000004: RO, indicate USB suspend status */
#define CH32V_USBHD_USB_MIS_ST_RB_UMS_BUS_RESET (1 <<  3) /* 00000008: RO, indicate USB bus reset status */
#define CH32V_USBHD_USB_MIS_ST_RB_UMS_R_FIFO_RDY (1 <<  4) /* 00000010: RO, indicate USB receiving FIFO ready status (not empty) */
#define CH32V_USBHD_USB_MIS_ST_RB_UMS_SIE_FREE (1 <<  5) /* 00000020: RO, indicate USB SIE free status */
#define CH32V_USBHD_USB_MIS_ST_RB_UMS_SOF_ACT (1 <<  6) /* 00000040: RO, indicate host SOF timer action status for USB host */
#define CH32V_USBHD_USB_MIS_ST_RB_UMS_SOF_PRES (1 <<  7) /* 00000080: RO, indicate host SOF timer presage status */
#define CH32V_USBHD_USB_INT_FG_OFFSET     0x000a
#define CH32V_USBHD_USB_INT_FG            (CH32V_USBHD_BASE + CH32V_USBHD_USB_INT_FG_OFFSET)
#define CH32V_USBHD_USB_INT_FG_RB_UIF_BUS_RST (1 <<  0) /* 00000001: RB_UIF_BUS_RST */
#define CH32V_USBHD_USB_INT_FG_RB_UIF_TRANSFER (1 <<  1) /* 00000002: USB transfer completion interrupt flag, direct bit address clear or write 1 to clear */
#define CH32V_USBHD_USB_INT_FG_RB_UIF_SUSPEND (1 <<  2) /* 00000004: USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear */
#define CH32V_USBHD_USB_INT_FG_RB_UIF_HST_SOF (1 <<  3) /* 00000008: host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear */
#define CH32V_USBHD_USB_INT_FG_RB_UIF_FIFO_OV (1 <<  4) /* 00000010: FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear */
#define CH32V_USBHD_USB_INT_FG_RB_U_SETUP_ACT (1 <<  5) /* 00000020: USB_SETUP_ACT */
#define CH32V_USBHD_USB_INT_FG_UIF_ISO_ACT (1 <<  6) /* 00000040: UIF_ISO_ACT */
#define CH32V_USBHD_USB_INT_FG_RB_U_IS_NAK (1 <<  7) /* 00000080: RO, indicate current USB transfer is NAK received */
#define CH32V_USBHD_USB_INT_ST_OFFSET     0x000b
#define CH32V_USBHD_USB_INT_ST            (CH32V_USBHD_BASE + CH32V_USBHD_USB_INT_ST_OFFSET) /* read-only */
#define CH32V_USBHD_USB_INT_ST_MASK_UIS_H_RES__MASK_UIS_ENDP (0xf << 0) /* 0000000f: RO, bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received;RO, bit mask of current transfer endpoint number for USB device mode */
#define CH32V_USBHD_USB_INT_ST_MASK_UIS_H_RES__MASK_UIS_ENDP_MASK (0xf << 0)
#define CH32V_USBHD_USB_INT_ST_MASK_UIS_TOKEN (0x3 << 4) /* 00000030: RO, bit mask of current token PID code received for USB device mode */
#define CH32V_USBHD_USB_INT_ST_MASK_UIS_TOKEN_MASK (0x3 << 4)
#define CH32V_USBHD_USB_INT_ST_RB_UIS_TOG_OK (1 <<  6) /* 00000040: RO, indicate current USB transfer toggle is OK */
#define CH32V_USBHD_USB_INT_ST_RB_UIS_IS_NAK (1 <<  7) /* 00000080: RO, indicate current USB transfer is NAK received for USB device mode */
#define CH32V_USBHD_USB_RX_LEN_OFFSET     0x000c
#define CH32V_USBHD_USB_RX_LEN            (CH32V_USBHD_BASE + CH32V_USBHD_USB_RX_LEN_OFFSET) /* read-only */
#define CH32V_USBHD_USB_RX_LEN_R16_USB_RX_LEN (0xffff << 0) /* 0000ffff: length of received bytes */
#define CH32V_USBHD_USB_RX_LEN_R16_USB_RX_LEN_MASK (0xffff << 0)
#define CH32V_USBHD_UEP_CONFIG_OFFSET     0x0010
#define CH32V_USBHD_UEP_CONFIG            (CH32V_USBHD_BASE + CH32V_USBHD_UEP_CONFIG_OFFSET) /* read-write */
#define CH32V_USBHD_UEP_CONFIG_bUEP_R_EN__UH_EP_MOD (0x7fff << 17) /* fffe0000: endpoint RX enable/bUH_TX_EN */
#define CH32V_USBHD_UEP_CONFIG_bUEP_R_EN__UH_EP_MOD_MASK (0x7fff << 17)
#define CH32V_USBHD_UEP_CONFIG_bUEP_T_EN_bUH_TX_EN (0x7fff << 1) /* 0000fffe: endpoint TX enable/bUH_TX_EN */
#define CH32V_USBHD_UEP_CONFIG_bUEP_T_EN_bUH_TX_EN_MASK (0x7fff << 1)
#define CH32V_USBHD_UEP_TYPE_OFFSET       0x0014
#define CH32V_USBHD_UEP_TYPE              (CH32V_USBHD_BASE + CH32V_USBHD_UEP_TYPE_OFFSET) /* read-write */
#define CH32V_USBHD_UEP_TYPE_bUEP_R_TYPE  (0x7fff << 17) /* fffe0000: endpoint RX type */
#define CH32V_USBHD_UEP_TYPE_bUEP_R_TYPE_MASK (0x7fff << 17)
#define CH32V_USBHD_UEP_TYPE_bUEP_T_TYPE  (0x7fff << 1) /* 0000fffe: endpoint TX type */
#define CH32V_USBHD_UEP_TYPE_bUEP_T_TYPE_MASK (0x7fff << 1)
#define CH32V_USBHD_UEP_BUF_MOD_OFFSET    0x0018
#define CH32V_USBHD_UEP_BUF_MOD           (CH32V_USBHD_BASE + CH32V_USBHD_UEP_BUF_MOD_OFFSET) /* read-write */
#define CH32V_USBHD_UEP_BUF_MOD_bUEP_ISO_BUF_MOD (0xffff << 16) /* ffff0000: buffer mode of USB endpoint */
#define CH32V_USBHD_UEP_BUF_MOD_bUEP_ISO_BUF_MOD_MASK (0xffff << 16)
#define CH32V_USBHD_UEP_BUF_MOD_bUEP_BUF_MOD (0xffff << 0) /* 0000ffff: buffer mode of USB endpoint */
#define CH32V_USBHD_UEP_BUF_MOD_bUEP_BUF_MOD_MASK (0xffff << 0)
#define CH32V_USBHD_UEP0_DMA_OFFSET       0x001c
#define CH32V_USBHD_UEP0_DMA              (CH32V_USBHD_BASE + CH32V_USBHD_UEP0_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP0_DMA_UEP0_DMA     (0xffff << 0) /* 0000ffff: endpoint 0 DMA buffer address */
#define CH32V_USBHD_UEP0_DMA_UEP0_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP1_RX_DMA_OFFSET    0x0020
#define CH32V_USBHD_UEP1_RX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP1_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP1_RX_DMA_UEP1_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 1 DMA buffer address */
#define CH32V_USBHD_UEP1_RX_DMA_UEP1_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP2_RX_DMA__UH_RX_DMA_OFFSET 0x0024
#define CH32V_USBHD_UEP2_RX_DMA__UH_RX_DMA (CH32V_USBHD_BASE + CH32V_USBHD_UEP2_RX_DMA__UH_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP2_RX_DMA__UH_RX_DMA_UEP2_RX_DMA__UH_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 2 DMA buffer address */
#define CH32V_USBHD_UEP2_RX_DMA__UH_RX_DMA_UEP2_RX_DMA__UH_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP3_RX_DMA_OFFSET    0x0028
#define CH32V_USBHD_UEP3_RX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP3_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP3_RX_DMA_UEP3_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 3 DMA buffer address */
#define CH32V_USBHD_UEP3_RX_DMA_UEP3_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP4_RX_DMA_OFFSET    0x002c
#define CH32V_USBHD_UEP4_RX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP4_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP4_RX_DMA_UEP4_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 4 DMA buffer address */
#define CH32V_USBHD_UEP4_RX_DMA_UEP4_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP5_RX_DMA_OFFSET    0x0030
#define CH32V_USBHD_UEP5_RX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP5_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP5_RX_DMA_UEP5_DMA  (0xffff << 0) /* 0000ffff: endpoint 5 DMA buffer address */
#define CH32V_USBHD_UEP5_RX_DMA_UEP5_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP6_RX_DMA_OFFSET    0x0034
#define CH32V_USBHD_UEP6_RX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP6_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP6_RX_DMA_UEP6_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 6 DMA buffer address */
#define CH32V_USBHD_UEP6_RX_DMA_UEP6_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP7_RX_DMA_OFFSET    0x0038
#define CH32V_USBHD_UEP7_RX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP7_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP7_RX_DMA_UEP7_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 7 DMA buffer address */
#define CH32V_USBHD_UEP7_RX_DMA_UEP7_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP8_RX_DMA_OFFSET    0x003c
#define CH32V_USBHD_UEP8_RX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP8_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP8_RX_DMA_UEP8_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 8 DMA buffer address */
#define CH32V_USBHD_UEP8_RX_DMA_UEP8_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP9_RX_DMA_OFFSET    0x0040
#define CH32V_USBHD_UEP9_RX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP9_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP9_RX_DMA_UEP9_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 9 DMA buffer address */
#define CH32V_USBHD_UEP9_RX_DMA_UEP9_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP10_RX_DMA_OFFSET   0x0044
#define CH32V_USBHD_UEP10_RX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP10_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP10_RX_DMA_UEP10_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 10 DMA buffer address */
#define CH32V_USBHD_UEP10_RX_DMA_UEP10_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP11_RX_DMA_OFFSET   0x0048
#define CH32V_USBHD_UEP11_RX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP11_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP11_RX_DMA_UEP11_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 11 DMA buffer address */
#define CH32V_USBHD_UEP11_RX_DMA_UEP11_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP12_RX_DMA_OFFSET   0x004c
#define CH32V_USBHD_UEP12_RX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP12_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP12_RX_DMA_UEP12_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 12 DMA buffer address */
#define CH32V_USBHD_UEP12_RX_DMA_UEP12_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP13_RX_DMA_OFFSET   0x0050
#define CH32V_USBHD_UEP13_RX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP13_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP13_RX_DMA_UEP13_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 13 DMA buffer address */
#define CH32V_USBHD_UEP13_RX_DMA_UEP13_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP14_RX_DMA_OFFSET   0x0054
#define CH32V_USBHD_UEP14_RX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP14_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP14_RX_DMA_UEP14_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 14 DMA buffer address */
#define CH32V_USBHD_UEP14_RX_DMA_UEP14_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP15_RX_DMA_OFFSET   0x0058
#define CH32V_USBHD_UEP15_RX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP15_RX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP15_RX_DMA_UEP15_RX_DMA (0xffff << 0) /* 0000ffff: endpoint 15 DMA buffer address */
#define CH32V_USBHD_UEP15_RX_DMA_UEP15_RX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP1_TX_DMA_OFFSET    0x005c
#define CH32V_USBHD_UEP1_TX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP1_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP1_TX_DMA_UEP1_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 1 DMA buffer address */
#define CH32V_USBHD_UEP1_TX_DMA_UEP1_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP2_TX_DMA_OFFSET    0x0060
#define CH32V_USBHD_UEP2_TX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP2_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP2_TX_DMA_UEP2_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 2 DMA buffer address */
#define CH32V_USBHD_UEP2_TX_DMA_UEP2_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP3_TX_DMA__UH_TX_DMA_OFFSET 0x0064
#define CH32V_USBHD_UEP3_TX_DMA__UH_TX_DMA (CH32V_USBHD_BASE + CH32V_USBHD_UEP3_TX_DMA__UH_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP3_TX_DMA__UH_TX_DMA_UEP3_TX_DMA__UH_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 3 DMA buffer address */
#define CH32V_USBHD_UEP3_TX_DMA__UH_TX_DMA_UEP3_TX_DMA__UH_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP4_TX_DMA_OFFSET    0x0068
#define CH32V_USBHD_UEP4_TX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP4_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP4_TX_DMA_UEP4_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 4 DMA buffer address */
#define CH32V_USBHD_UEP4_TX_DMA_UEP4_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP5_TX_DMA_OFFSET    0x006c
#define CH32V_USBHD_UEP5_TX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP5_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP5_TX_DMA_UEP5_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 5 DMA buffer address */
#define CH32V_USBHD_UEP5_TX_DMA_UEP5_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP6_TX_DMA_OFFSET    0x0070
#define CH32V_USBHD_UEP6_TX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP6_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP6_TX_DMA_UEP6_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 6 DMA buffer address */
#define CH32V_USBHD_UEP6_TX_DMA_UEP6_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP7_TX_DMA_OFFSET    0x0074
#define CH32V_USBHD_UEP7_TX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP7_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP7_TX_DMA_UEP7_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 7 DMA buffer address */
#define CH32V_USBHD_UEP7_TX_DMA_UEP7_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP8_TX_DMA_OFFSET    0x0078
#define CH32V_USBHD_UEP8_TX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP8_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP8_TX_DMA_UEP8_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 8 DMA buffer address */
#define CH32V_USBHD_UEP8_TX_DMA_UEP8_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP9_TX_DMA_OFFSET    0x007c
#define CH32V_USBHD_UEP9_TX_DMA           (CH32V_USBHD_BASE + CH32V_USBHD_UEP9_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP9_TX_DMA_UEP9_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 9 DMA buffer address */
#define CH32V_USBHD_UEP9_TX_DMA_UEP9_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP10_TX_DMA_OFFSET   0x0080
#define CH32V_USBHD_UEP10_TX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP10_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP10_TX_DMA_UEP10_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 10 DMA buffer address */
#define CH32V_USBHD_UEP10_TX_DMA_UEP10_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP11_TX_DMA_OFFSET   0x0084
#define CH32V_USBHD_UEP11_TX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP11_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP11_TX_DMA_UEP11_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 11 DMA buffer address */
#define CH32V_USBHD_UEP11_TX_DMA_UEP11_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP12_TX_DMA____UH_SPLIT_DATA_OFFSET 0x0088
#define CH32V_USBHD_UEP12_TX_DMA____UH_SPLIT_DATA (CH32V_USBHD_BASE + CH32V_USBHD_UEP12_TX_DMA____UH_SPLIT_DATA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP12_TX_DMA____UH_SPLIT_DATA_UEP12_TX_DMA___UH_SPLIT_DATA (0xffff << 0) /* 0000ffff: endpoint 12 DMA buffer address */
#define CH32V_USBHD_UEP12_TX_DMA____UH_SPLIT_DATA_UEP12_TX_DMA___UH_SPLIT_DATA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP13_TX_DMA_OFFSET   0x008c
#define CH32V_USBHD_UEP13_TX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP13_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP13_TX_DMA_UEP13_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 13 DMA buffer address */
#define CH32V_USBHD_UEP13_TX_DMA_UEP13_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP14_TX_DMA_OFFSET   0x0090
#define CH32V_USBHD_UEP14_TX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP14_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP14_TX_DMA_UEP14_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 14 DMA buffer address */
#define CH32V_USBHD_UEP14_TX_DMA_UEP14_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP15_TX_DMA_OFFSET   0x0094
#define CH32V_USBHD_UEP15_TX_DMA          (CH32V_USBHD_BASE + CH32V_USBHD_UEP15_TX_DMA_OFFSET) /* read-write */
#define CH32V_USBHD_UEP15_TX_DMA_UEP15_TX_DMA (0xffff << 0) /* 0000ffff: endpoint 15 DMA buffer address */
#define CH32V_USBHD_UEP15_TX_DMA_UEP15_TX_DMA_MASK (0xffff << 0)
#define CH32V_USBHD_UEP0_MAX_LEN_OFFSET   0x0098
#define CH32V_USBHD_UEP0_MAX_LEN          (CH32V_USBHD_BASE + CH32V_USBHD_UEP0_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP0_MAX_LEN_UEP0_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 0 max acceptable length */
#define CH32V_USBHD_UEP0_MAX_LEN_UEP0_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP1_MAX_LEN_OFFSET   0x009c
#define CH32V_USBHD_UEP1_MAX_LEN          (CH32V_USBHD_BASE + CH32V_USBHD_UEP1_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP1_MAX_LEN_UEP1_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 1 max acceptable length */
#define CH32V_USBHD_UEP1_MAX_LEN_UEP1_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP2_MAX_LEN__UH_RX_MAX_LEN_OFFSET 0x00a0
#define CH32V_USBHD_UEP2_MAX_LEN__UH_RX_MAX_LEN (CH32V_USBHD_BASE + CH32V_USBHD_UEP2_MAX_LEN__UH_RX_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP2_MAX_LEN__UH_RX_MAX_LEN_UEP2_MAX_LEN__UH_RX_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 2 max acceptable length */
#define CH32V_USBHD_UEP2_MAX_LEN__UH_RX_MAX_LEN_UEP2_MAX_LEN__UH_RX_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP3_MAX_LEN_OFFSET   0x00a4
#define CH32V_USBHD_UEP3_MAX_LEN          (CH32V_USBHD_BASE + CH32V_USBHD_UEP3_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP3_MAX_LEN_UEP3_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 3 max acceptable length */
#define CH32V_USBHD_UEP3_MAX_LEN_UEP3_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP4_MAX_LEN_OFFSET   0x00a8
#define CH32V_USBHD_UEP4_MAX_LEN          (CH32V_USBHD_BASE + CH32V_USBHD_UEP4_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP4_MAX_LEN_UEP4_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 4 max acceptable length */
#define CH32V_USBHD_UEP4_MAX_LEN_UEP4_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP5_MAX_LEN_OFFSET   0x00ac
#define CH32V_USBHD_UEP5_MAX_LEN          (CH32V_USBHD_BASE + CH32V_USBHD_UEP5_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP5_MAX_LEN_UEP5_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 5 max acceptable length */
#define CH32V_USBHD_UEP5_MAX_LEN_UEP5_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP6_MAX_LEN_OFFSET   0x00b0
#define CH32V_USBHD_UEP6_MAX_LEN          (CH32V_USBHD_BASE + CH32V_USBHD_UEP6_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP6_MAX_LEN_UEP6_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 6 max acceptable length */
#define CH32V_USBHD_UEP6_MAX_LEN_UEP6_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP7_MAX_LEN_OFFSET   0x00b4
#define CH32V_USBHD_UEP7_MAX_LEN          (CH32V_USBHD_BASE + CH32V_USBHD_UEP7_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP7_MAX_LEN_UEP7_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 7 max acceptable length */
#define CH32V_USBHD_UEP7_MAX_LEN_UEP7_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP8_MAX_LEN_OFFSET   0x00b8
#define CH32V_USBHD_UEP8_MAX_LEN          (CH32V_USBHD_BASE + CH32V_USBHD_UEP8_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP8_MAX_LEN_UEP8_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 8 max acceptable length */
#define CH32V_USBHD_UEP8_MAX_LEN_UEP8_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP9_MAX_LEN_OFFSET   0x00bc
#define CH32V_USBHD_UEP9_MAX_LEN          (CH32V_USBHD_BASE + CH32V_USBHD_UEP9_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP9_MAX_LEN_UEP9_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 9 max acceptable length */
#define CH32V_USBHD_UEP9_MAX_LEN_UEP9_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP10_MAX_LEN_OFFSET  0x00c0
#define CH32V_USBHD_UEP10_MAX_LEN         (CH32V_USBHD_BASE + CH32V_USBHD_UEP10_MAX_LEN_OFFSET) /* read-write */
