robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
#define CH32V_USBHD_UEP10_MAX_LEN_UEP10_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 10 max acceptable length */
#define CH32V_USBHD_UEP10_MAX_LEN_UEP10_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP11_MAX_LEN_OFFSET  0x00c4
#define CH32V_USBHD_UEP11_MAX_LEN         (CH32V_USBHD_BASE + CH32V_USBHD_UEP11_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP11_MAX_LEN_UEP11_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 11 max acceptable length */
#define CH32V_USBHD_UEP11_MAX_LEN_UEP11_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP12_MAX_LEN_OFFSET  0x00c8
#define CH32V_USBHD_UEP12_MAX_LEN         (CH32V_USBHD_BASE + CH32V_USBHD_UEP12_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP12_MAX_LEN_UEP12_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 12 max acceptable length */
#define CH32V_USBHD_UEP12_MAX_LEN_UEP12_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP13_MAX_LEN_OFFSET  0x00cc
#define CH32V_USBHD_UEP13_MAX_LEN         (CH32V_USBHD_BASE + CH32V_USBHD_UEP13_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP13_MAX_LEN_UEP13_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 13 max acceptable length */
#define CH32V_USBHD_UEP13_MAX_LEN_UEP13_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP14_MAX_LEN_OFFSET  0x00d0
#define CH32V_USBHD_UEP14_MAX_LEN         (CH32V_USBHD_BASE + CH32V_USBHD_UEP14_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP14_MAX_LEN_UEP14_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 14 max acceptable length */
#define CH32V_USBHD_UEP14_MAX_LEN_UEP14_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP15_MAX_LEN_OFFSET  0x00d4
#define CH32V_USBHD_UEP15_MAX_LEN         (CH32V_USBHD_BASE + CH32V_USBHD_UEP15_MAX_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP15_MAX_LEN_UEP15_MAX_LEN (0x7ff << 0) /* 000007ff: endpoint 15 max acceptable length */
#define CH32V_USBHD_UEP15_MAX_LEN_UEP15_MAX_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP0_T_LEN_OFFSET     0x00d8
#define CH32V_USBHD_UEP0_T_LEN            (CH32V_USBHD_BASE + CH32V_USBHD_UEP0_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP0_T_LEN_UEP0_T_LEN (0x7ff << 0) /* 000007ff: endpoint 0 send the length */
#define CH32V_USBHD_UEP0_T_LEN_UEP0_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP0_T_CTRL_OFFSET    0x00da
#define CH32V_USBHD_UEP0_T_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP0_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP0_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 0 control of the send response to IN transactions */
#define CH32V_USBHD_UEP0_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP0_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 0 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP0_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP0_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 0 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP0_R_CTRL_OFFSET    0x00db
#define CH32V_USBHD_UEP0_R_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP0_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP0_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 0 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP0_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP0_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 0 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP0_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP0_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 0 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP1_T_LEN_OFFSET     0x00dc
#define CH32V_USBHD_UEP1_T_LEN            (CH32V_USBHD_BASE + CH32V_USBHD_UEP1_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP1_T_LEN_UEP1_T_LEN (0x7ff << 0) /* 000007ff: endpoint 1 send the length */
#define CH32V_USBHD_UEP1_T_LEN_UEP1_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP1_T_CTRL_OFFSET    0x00de
#define CH32V_USBHD_UEP1_T_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP1_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP1_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 1 control of the send response to IN transactions */
#define CH32V_USBHD_UEP1_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP1_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 1 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP1_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP1_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 1 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP1_R_CTRL_OFFSET    0x00df
#define CH32V_USBHD_UEP1_R_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP1_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP1_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 1 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP1_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP1_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 1 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP1_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP1_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 1 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP2_T_LEN__UH_EP_PID_OFFSET 0x00e0
#define CH32V_USBHD_UEP2_T_LEN__UH_EP_PID (CH32V_USBHD_BASE + CH32V_USBHD_UEP2_T_LEN__UH_EP_PID_OFFSET) /* read-write */
#define CH32V_USBHD_UEP2_T_LEN__UH_EP_PID_UEP2_T_LEN__MASK_UH_ENDP__MASK_UH_TOKEN (0x7ff << 0) /* 000007ff: endpoint 2 send the length */
#define CH32V_USBHD_UEP2_T_LEN__UH_EP_PID_UEP2_T_LEN__MASK_UH_ENDP__MASK_UH_TOKEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP2_T_CTRL_OFFSET    0x00e2
#define CH32V_USBHD_UEP2_T_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP2_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP2_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 2 control of the send response to IN transactions */
#define CH32V_USBHD_UEP2_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP2_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 2 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP2_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP2_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 2 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP2_R_CTRL__UH_RX_CTRL_OFFSET 0x00e3
#define CH32V_USBHD_UEP2_R_CTRL__UH_RX_CTRL (CH32V_USBHD_BASE + CH32V_USBHD_UEP2_R_CTRL__UH_RX_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP2_R_CTRL__UH_RX_CTRL_MASK_UEP_R_RES__MASK_UH_R_RES (0x3 << 0) /* 00000003: endpoint 2 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP2_R_CTRL__UH_RX_CTRL_MASK_UEP_R_RES__MASK_UH_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP2_R_CTRL__UH_RX_CTRL_bUH_R_RES_NO (1 <<  2) /* 00000004: bUH_R_RES_NO */
#define CH32V_USBHD_UEP2_R_CTRL__UH_RX_CTRL_MASK_UEP_R_TOG__MASK_UH_R_TOG (0x3 << 3) /* 00000018: endpoint 2 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP2_R_CTRL__UH_RX_CTRL_MASK_UEP_R_TOG__MASK_UH_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP2_R_CTRL__UH_RX_CTRL_bUEP_R_TOG_AUTO__bUH_R_AUTO_TOG (1 <<  5) /* 00000020: endpoint 2 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP2_R_CTRL__UH_RX_CTRL_bUH_R_DATA_NO (1 <<  6) /* 00000040: bUH_R_DATA_NO */
#define CH32V_USBHD_UEP3_T_LEN___UH_TX_LEN_H_OFFSET 0x00e4
#define CH32V_USBHD_UEP3_T_LEN___UH_TX_LEN_H (CH32V_USBHD_BASE + CH32V_USBHD_UEP3_T_LEN___UH_TX_LEN_H_OFFSET) /* read-write */
#define CH32V_USBHD_UEP3_T_LEN___UH_TX_LEN_H_UEP3_T_LEN___UH_TX_LEN_H (0x7ff << 0) /* 000007ff: endpoint 3 send the length */
#define CH32V_USBHD_UEP3_T_LEN___UH_TX_LEN_H_UEP3_T_LEN___UH_TX_LEN_H_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP3_T_CTRL___UH_TX_CTRL_OFFSET 0x00e6
#define CH32V_USBHD_UEP3_T_CTRL___UH_TX_CTRL (CH32V_USBHD_BASE + CH32V_USBHD_UEP3_T_CTRL___UH_TX_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP3_T_CTRL___UH_TX_CTRL_MASK_UEP_T_RES_____MASK_UH_T_RES (0x3 << 0) /* 00000003: endpoint 3 control of the send response to IN transactions */
#define CH32V_USBHD_UEP3_T_CTRL___UH_TX_CTRL_MASK_UEP_T_RES_____MASK_UH_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP3_T_CTRL___UH_TX_CTRL_bUH_T_RES_NO (1 <<  2) /* 00000004: bUH_T_RES_NO */
#define CH32V_USBHD_UEP3_T_CTRL___UH_TX_CTRL_MASK_UEP_T_TOG____MASK_UH_T_TOG (0x3 << 3) /* 00000018: endpoint 3 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP3_T_CTRL___UH_TX_CTRL_MASK_UEP_T_TOG____MASK_UH_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP3_T_CTRL___UH_TX_CTRL_bUEP_T_TOG_AUTO____bUH_T_AUTO_TOG (1 <<  5) /* 00000020: endpoint 3 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP3_T_CTRL___UH_TX_CTRL_bUH_T_DATA_NO (1 <<  6) /* 00000040: bUH_T_DATA_NO */
#define CH32V_USBHD_UEP3_R_CTRL_OFFSET    0x00e7
#define CH32V_USBHD_UEP3_R_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP3_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP3_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 3 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP3_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP3_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 3 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP3_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP3_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 3 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP4_T_LEN_OFFSET     0x00e8
#define CH32V_USBHD_UEP4_T_LEN            (CH32V_USBHD_BASE + CH32V_USBHD_UEP4_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP4_T_LEN_UEP4_T_LEN (0x7ff << 0) /* 000007ff: endpoint 0 send the length */
#define CH32V_USBHD_UEP4_T_LEN_UEP4_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP4_T_CTRL_OFFSET    0x00ea
#define CH32V_USBHD_UEP4_T_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP4_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP4_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 4 control of the send response to IN transactions */
#define CH32V_USBHD_UEP4_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP4_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 4 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP4_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP4_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 4 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP4_R_CTRL_OFFSET    0x00eb
#define CH32V_USBHD_UEP4_R_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP4_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP4_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 4 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP4_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP4_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 4 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP4_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP4_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 4 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP5_T_LEN_OFFSET     0x00ec
#define CH32V_USBHD_UEP5_T_LEN            (CH32V_USBHD_BASE + CH32V_USBHD_UEP5_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP5_T_LEN_UEP5_T_LEN (0x7ff << 0) /* 000007ff: endpoint 5 send the length */
#define CH32V_USBHD_UEP5_T_LEN_UEP5_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP5_T_CTRL_OFFSET    0x00ee
#define CH32V_USBHD_UEP5_T_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP5_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP5_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 5 control of the send response to IN transactions */
#define CH32V_USBHD_UEP5_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP5_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 5 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP5_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP5_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 5 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP5_R_CTRL_OFFSET    0x00ef
#define CH32V_USBHD_UEP5_R_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP5_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP5_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 5 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP5_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP5_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 5 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP5_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP5_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 5 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP6_T_LEN_OFFSET     0x00f0
#define CH32V_USBHD_UEP6_T_LEN            (CH32V_USBHD_BASE + CH32V_USBHD_UEP6_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP6_T_LEN_UEP6_T_LEN (0x7ff << 0) /* 000007ff: endpoint 6 send the length */
#define CH32V_USBHD_UEP6_T_LEN_UEP6_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP6_T_CTRL_OFFSET    0x00f2
#define CH32V_USBHD_UEP6_T_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP6_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP6_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 6 control of the send response to IN transactions */
#define CH32V_USBHD_UEP6_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP6_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 6 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP6_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP6_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 6 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP6_R_CTRL_OFFSET    0x00f3
#define CH32V_USBHD_UEP6_R_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP6_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP6_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 6 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP6_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP6_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 6 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP6_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP6_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 6 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP7_T_LEN_OFFSET     0x00f4
#define CH32V_USBHD_UEP7_T_LEN            (CH32V_USBHD_BASE + CH32V_USBHD_UEP7_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP7_T_LEN_UEP7_T_LEN (0x7ff << 0) /* 000007ff: endpoint 7 send the length */
#define CH32V_USBHD_UEP7_T_LEN_UEP7_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP7_T_CTRL_OFFSET    0x00f6
#define CH32V_USBHD_UEP7_T_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP7_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP7_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 7 control of the send response to IN transactions */
#define CH32V_USBHD_UEP7_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP7_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 7 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP7_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP7_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 7 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP7_R_CTRL_OFFSET    0x00f7
#define CH32V_USBHD_UEP7_R_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP7_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP7_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 7 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP7_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP7_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 7 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP7_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP7_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 7 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP8_T_LEN_OFFSET     0x00f8
#define CH32V_USBHD_UEP8_T_LEN            (CH32V_USBHD_BASE + CH32V_USBHD_UEP8_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP8_T_LEN_UEP8_T_LEN (0x7ff << 0) /* 000007ff: endpoint 8 send the length */
#define CH32V_USBHD_UEP8_T_LEN_UEP8_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP8_T_CTRL_OFFSET    0x00fa
#define CH32V_USBHD_UEP8_T_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP8_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP8_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 8 control of the send response to IN transactions */
#define CH32V_USBHD_UEP8_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP8_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 8 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP8_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP8_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 8 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP8_R_CTRL_OFFSET    0x00fb
#define CH32V_USBHD_UEP8_R_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP8_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP8_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 8 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP8_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP8_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 8 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP8_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP8_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 8 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP9_T_LEN_OFFSET     0x00fc
#define CH32V_USBHD_UEP9_T_LEN            (CH32V_USBHD_BASE + CH32V_USBHD_UEP9_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP9_T_LEN_UEP9_T_LEN (0x7ff << 0) /* 000007ff: endpoint 9 send the length */
#define CH32V_USBHD_UEP9_T_LEN_UEP9_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP9_T_CTRL_OFFSET    0x00fe
#define CH32V_USBHD_UEP9_T_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP9_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP9_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 9 control of the send response to IN transactions */
#define CH32V_USBHD_UEP9_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP9_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 9 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP9_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP9_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 9 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP9_R_CTRL_OFFSET    0x00ff
#define CH32V_USBHD_UEP9_R_CTRL           (CH32V_USBHD_BASE + CH32V_USBHD_UEP9_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP9_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 9 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP9_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP9_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 9 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP9_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP9_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 9 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP10_T_LEN_OFFSET    0x0100
#define CH32V_USBHD_UEP10_T_LEN           (CH32V_USBHD_BASE + CH32V_USBHD_UEP10_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP10_T_LEN_UEP10_T_LEN (0x7ff << 0) /* 000007ff: endpoint 10 send the length */
#define CH32V_USBHD_UEP10_T_LEN_UEP10_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP10_T_CTRL_OFFSET   0x0102
#define CH32V_USBHD_UEP10_T_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP10_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP10_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 10 control of the send response to IN transactions */
#define CH32V_USBHD_UEP10_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP10_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 10 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP10_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP10_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 10 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP10_R_CTRL_OFFSET   0x0103
#define CH32V_USBHD_UEP10_R_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP10_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP10_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 10 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP10_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP10_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 10 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP10_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP10_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 10 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP11_T_LEN_OFFSET    0x0104
#define CH32V_USBHD_UEP11_T_LEN           (CH32V_USBHD_BASE + CH32V_USBHD_UEP11_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP11_T_LEN_UEP0_T_LEN (0x7ff << 0) /* 000007ff: endpoint 11 send the length */
#define CH32V_USBHD_UEP11_T_LEN_UEP0_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP11_T_CTRL_OFFSET   0x0106
#define CH32V_USBHD_UEP11_T_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP11_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP11_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 11 control of the send response to IN transactions */
#define CH32V_USBHD_UEP11_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP11_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 11 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP11_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP11_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 11 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP11_R_CTRL_OFFSET   0x0107
#define CH32V_USBHD_UEP11_R_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP11_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP11_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 11 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP11_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP11_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 11 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP11_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP11_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 11 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP12_T_LEN_OFFSET    0x0108
#define CH32V_USBHD_UEP12_T_LEN           (CH32V_USBHD_BASE + CH32V_USBHD_UEP12_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP12_T_LEN_UEP0_T_LEN (0x7ff << 0) /* 000007ff: endpoint 12 send the length */
#define CH32V_USBHD_UEP12_T_LEN_UEP0_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP12_T_CTRL_OFFSET   0x010a
#define CH32V_USBHD_UEP12_T_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP12_T_CTRL_OFFSET) /* read-write */
