robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
#define CH32V_USBHD_UEP12_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 12 control of the send response to IN transactions */
#define CH32V_USBHD_UEP12_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP12_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 12 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP12_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP12_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 12 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP12_R_CTRL_OFFSET   0x010b
#define CH32V_USBHD_UEP12_R_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP12_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP12_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 12 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP12_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP12_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 12 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP12_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP12_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 12 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP13_T_LEN_OFFSET    0x010c
#define CH32V_USBHD_UEP13_T_LEN           (CH32V_USBHD_BASE + CH32V_USBHD_UEP13_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP13_T_LEN_UEP13_T_LEN (0x7ff << 0) /* 000007ff: endpoint 13 send the length */
#define CH32V_USBHD_UEP13_T_LEN_UEP13_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP13_T_CTRL_OFFSET   0x010e
#define CH32V_USBHD_UEP13_T_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP13_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP13_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 13 control of the send response to IN transactions */
#define CH32V_USBHD_UEP13_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP13_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 13 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP13_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP13_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 13 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP13_R_CTRL_OFFSET   0x010f
#define CH32V_USBHD_UEP13_R_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP13_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP13_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 13 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP13_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP13_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 13 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP13_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP13_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 13 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP14_T_LEN_OFFSET    0x0110
#define CH32V_USBHD_UEP14_T_LEN           (CH32V_USBHD_BASE + CH32V_USBHD_UEP14_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP14_T_LEN_UEP14_T_LEN (0x7ff << 0) /* 000007ff: endpoint 14 send the length */
#define CH32V_USBHD_UEP14_T_LEN_UEP14_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP14_T_CTRL_OFFSET   0x0112
#define CH32V_USBHD_UEP14_T_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP14_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP14_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 14 control of the send response to IN transactions */
#define CH32V_USBHD_UEP14_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP14_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 14 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP14_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP14_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 14 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP14_R_CTRL_OFFSET   0x0113
#define CH32V_USBHD_UEP14_R_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP14_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP14_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 14 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP14_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP14_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 14 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP14_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP14_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 14 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP15_T_LEN_OFFSET    0x0114
#define CH32V_USBHD_UEP15_T_LEN           (CH32V_USBHD_BASE + CH32V_USBHD_UEP15_T_LEN_OFFSET) /* read-write */
#define CH32V_USBHD_UEP15_T_LEN_UEP0_T_LEN (0x7ff << 0) /* 000007ff: endpoint 15 send the length */
#define CH32V_USBHD_UEP15_T_LEN_UEP0_T_LEN_MASK (0x7ff << 0)
#define CH32V_USBHD_UEP15_T_CTRL_OFFSET   0x0116
#define CH32V_USBHD_UEP15_T_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP15_T_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP15_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: endpoint 15 control of the send response to IN transactions */
#define CH32V_USBHD_UEP15_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP15_T_CTRL_MASK_UEP_T_TOG (0x3 << 3) /* 00000018: endpoint 15 synchronous trigger bit for the sender to prepare */
#define CH32V_USBHD_UEP15_T_CTRL_MASK_UEP_T_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP15_T_CTRL_bUEP_T_TOG_AUTO (1 <<  5) /* 00000020: endpoint 15 synchronous trigger bit automatic filp enables the control bit */
#define CH32V_USBHD_UEP15_R_CTRL_OFFSET   0x0117
#define CH32V_USBHD_UEP15_R_CTRL          (CH32V_USBHD_BASE + CH32V_USBHD_UEP15_R_CTRL_OFFSET) /* read-write */
#define CH32V_USBHD_UEP15_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: endpoint 15 control of the accept response to OUT transactions */
#define CH32V_USBHD_UEP15_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USBHD_UEP15_R_CTRL_MASK_UEP_R_TOG (0x3 << 3) /* 00000018: endpoint 15 synchronous trigger bit for the accept to prepare */
#define CH32V_USBHD_UEP15_R_CTRL_MASK_UEP_R_TOG_MASK (0x3 << 3)
#define CH32V_USBHD_UEP15_R_CTRL_bUEP_R_TOG_AUTO (1 <<  5) /* 00000020: endpoint 15 synchronous trigger bit automatic filp enables the control bit */

