robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
/* CRC - CRC calculation unit */
#define CH32V_CRC_BASE                    0x40023000
#define CH32V_CRC_DATAR_OFFSET            0x0000
#define CH32V_CRC_DATAR                   (CH32V_CRC_BASE + CH32V_CRC_DATAR_OFFSET) /* read-write */
#define CH32V_CRC_DATAR_DR                (0xffffffff << 0) /* ffffffff: Data Register */
#define CH32V_CRC_DATAR_DR_MASK           (0xffffffff << 0)
#define CH32V_CRC_IDATAR_OFFSET           0x0004
#define CH32V_CRC_IDATAR                  (CH32V_CRC_BASE + CH32V_CRC_IDATAR_OFFSET) /* read-write */
#define CH32V_CRC_IDATAR_IDR              (0xff << 0) /* 000000ff: Independent Data register */
#define CH32V_CRC_IDATAR_IDR_MASK         (0xff << 0)
#define CH32V_CRC_CTLR_OFFSET             0x0008
#define CH32V_CRC_CTLR                    (CH32V_CRC_BASE + CH32V_CRC_CTLR_OFFSET) /* write-only */
#define CH32V_CRC_CTLR_RESET              (1 <<  0) /* 00000001: Reset bit */

/* FLASH - FLASH */
#define CH32V_FLASH_BASE                  0x40022000
#define CH32V_FLASH_KEYR_OFFSET           0x0004
#define CH32V_FLASH_KEYR                  (CH32V_FLASH_BASE + CH32V_FLASH_KEYR_OFFSET) /* write-only */
#define CH32V_FLASH_KEYR_KEYR             (0xffffffff << 0) /* ffffffff: FPEC key */
#define CH32V_FLASH_KEYR_KEYR_MASK        (0xffffffff << 0)
#define CH32V_FLASH_OBKEYR_OFFSET         0x0008
#define CH32V_FLASH_OBKEYR                (CH32V_FLASH_BASE + CH32V_FLASH_OBKEYR_OFFSET) /* write-only */
#define CH32V_FLASH_OBKEYR_OPTKEY         (0xffffffff << 0) /* ffffffff: Option byte key */
#define CH32V_FLASH_OBKEYR_OPTKEY_MASK    (0xffffffff << 0)
#define CH32V_FLASH_STATR_OFFSET          0x000c
#define CH32V_FLASH_STATR                 (CH32V_FLASH_BASE + CH32V_FLASH_STATR_OFFSET)
#define CH32V_FLASH_STATR_ENHANCE_MOD_STA (1 <<  7) /* 00000080: Enhance mode start */
#define CH32V_FLASH_STATR_EOP             (1 <<  5) /* 00000020: End of operation */
#define CH32V_FLASH_STATR_WRPRTERR        (1 <<  4) /* 00000010: Write protection error */
#define CH32V_FLASH_STATR_WR_BSY          (1 <<  1) /* 00000002: Quick page programming */
#define CH32V_FLASH_STATR_BSY             (1 <<  0) /* 00000001: Busy */
#define CH32V_FLASH_CTLR_OFFSET           0x0010
#define CH32V_FLASH_CTLR                  (CH32V_FLASH_BASE + CH32V_FLASH_CTLR_OFFSET) /* read-write */
#define CH32V_FLASH_CTLR_PG               (1 <<  0) /* 00000001: Programming */
#define CH32V_FLASH_CTLR_PER              (1 <<  1) /* 00000002: Page Erase */
#define CH32V_FLASH_CTLR_MER              (1 <<  2) /* 00000004: Mass Erase */
#define CH32V_FLASH_CTLR_OBPG             (1 <<  4) /* 00000010: Option byte programming */
#define CH32V_FLASH_CTLR_OBER             (1 <<  5) /* 00000020: Option byte erase */
#define CH32V_FLASH_CTLR_STRT             (1 <<  6) /* 00000040: Start */
#define CH32V_FLASH_CTLR_LOCK             (1 <<  7) /* 00000080: Lock */
#define CH32V_FLASH_CTLR_OBWRE            (1 <<  9) /* 00000200: Option bytes write enable */
#define CH32V_FLASH_CTLR_ERRIE            (1 << 10) /* 00000400: Error interrupt enable */
#define CH32V_FLASH_CTLR_EOPIE            (1 << 12) /* 00001000: End of operation interrupt enable */
#define CH32V_FLASH_CTLR_FLOCK            (1 << 15) /* 00008000: Fast programmable lock */
#define CH32V_FLASH_CTLR_PAGE_PG          (1 << 16) /* 00010000: Fast programming */
#define CH32V_FLASH_CTLR_PAGE_ER          (1 << 17) /* 00020000: Fast erase */
#define CH32V_FLASH_CTLR_BER32            (1 << 18) /* 00040000: Block Erase 32K */
#define CH32V_FLASH_CTLR_BER64            (1 << 19) /* 00080000: Block Erase 64K */
#define CH32V_FLASH_CTLR_PGSTART          (1 << 21) /* 00200000: Page Programming Start */
#define CH32V_FLASH_CTLR_RSENACT          (1 << 22) /* 00400000: Reset Flash Enhance read mode */
#define CH32V_FLASH_CTLR_ENHANCEMODE      (1 << 24) /* 01000000: Flash Enhance read mode */
#define CH32V_FLASH_CTLR_SCKMODE          (1 << 25) /* 02000000: Flash SCK mode */
#define CH32V_FLASH_ADDR_OFFSET           0x0014
#define CH32V_FLASH_ADDR                  (CH32V_FLASH_BASE + CH32V_FLASH_ADDR_OFFSET) /* write-only */
#define CH32V_FLASH_ADDR_FAR              (0xffffffff << 0) /* ffffffff: Flash Address */
#define CH32V_FLASH_ADDR_FAR_MASK         (0xffffffff << 0)
#define CH32V_FLASH_OBR_OFFSET            0x001c
#define CH32V_FLASH_OBR                   (CH32V_FLASH_BASE + CH32V_FLASH_OBR_OFFSET) /* read-only */
#define CH32V_FLASH_OBR_OBERR             (1 <<  0) /* 00000001: Option byte error */
#define CH32V_FLASH_OBR_RDPRT             (1 <<  1) /* 00000002: Read protection */
#define CH32V_FLASH_OBR_IWDG_SW           (1 <<  2) /* 00000004: IWDG_SW */
#define CH32V_FLASH_OBR_STOP_RST          (1 <<  3) /* 00000008: STOP_RST */
#define CH32V_FLASH_OBR_STANDY_RST        (1 <<  4) /* 00000010: STANDY_RST */
#define CH32V_FLASH_OBR_SRAM_CODE_MODE    (0x3 << 8) /* 00000300: SRAM_CODE_MODE */
#define CH32V_FLASH_OBR_SRAM_CODE_MODE_MASK (0x3 << 8)
#define CH32V_FLASH_WPR_OFFSET            0x0020
#define CH32V_FLASH_WPR                   (CH32V_FLASH_BASE + CH32V_FLASH_WPR_OFFSET) /* read-only */
#define CH32V_FLASH_WPR_WRP               (0xffffffff << 0) /* ffffffff: Write protect */
#define CH32V_FLASH_WPR_WRP_MASK          (0xffffffff << 0)
#define CH32V_FLASH_MODEKEYR_OFFSET       0x0024
#define CH32V_FLASH_MODEKEYR              (CH32V_FLASH_BASE + CH32V_FLASH_MODEKEYR_OFFSET) /* write-only */
#define CH32V_FLASH_MODEKEYR_MODEKEYR     (0xffffffff << 0) /* ffffffff: Mode select */
#define CH32V_FLASH_MODEKEYR_MODEKEYR_MASK (0xffffffff << 0)

/* USB_OTG_FS - USB FS OTG register */
#define CH32V_USB_OTG_FS_BASE             0x50000000
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL_OFFSET 0x0000
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_USBHD_BASE_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL_USBHD_UC_DMA_EN (1 <<  0) /* 00000001: DMA enable and DMA interrupt enable for USB */
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL_USBHD_UC_CLR_ALL (1 <<  1) /* 00000002: force clear FIFO and count of USB */
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL_USBHD_UC_RESET_SIE (1 <<  2) /* 00000004: force reset USB SIE, need software clear */
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL_USBHD_UC_INT_BUSY (1 <<  3) /* 00000008: enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid */
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL_USBHD_UC_SYS_CTRL_MASK (0x3 << 4) /* 00000030: USB device enable and internal pullup resistance enable */
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL_USBHD_UC_SYS_CTRL_MASK_MASK (0x3 << 4)
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL_USBHD_UC_LOW_SPEED (1 <<  6) /* 00000040: enable USB low speed: 0=12Mbps, 1=1.5Mbps */
#define CH32V_USB_OTG_FS_USBHD_BASE_CTRL_RB_UC_HOST_MODE (1 <<  7) /* 00000080: enable USB host mode: 0=device mode, 1=host mode */
#define CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL_OFFSET 0x0001
#define CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL_USBHD_UH_PORT_EN__USBHD_UD_PORT_EN (1 <<  0) /* 00000001: enable USB port: 0=disable, 1=enable port, automatic disabled if USB device detached */
#define CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL_USBHD_UH_BUS_RESET__USBHD_UD_GP_BIT (1 <<  1) /* 00000002: force clear FIFO and count of USB */
#define CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL_USBHD_UH_LOW_SPEED__USBHD_UD_LOW_SPEED (1 <<  2) /* 00000004: enable USB port low speed: 0=full speed, 1=low speed */
#define CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL_USBHD_UH_DM_PIN__USBHD_UD_DM_PIN (1 <<  4) /* 00000010: ReadOnly: indicate current UDM pin level */
#define CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL_USBHD_UH_DP_PIN__USBHD_UD_DP_PIN (1 <<  5) /* 00000020: USB device enable and internal pullup resistance enable */
#define CH32V_USB_OTG_FS_USBHD_UDEV_CTRL__USBHD_UHOST_CTRL_USBHD_UH_PD_DIS__USBHD_UD_PD_DIS (1 <<  7) /* 00000080: disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable */
#define CH32V_USB_OTG_FS_R8_USB_INT_EN_OFFSET 0x0002
#define CH32V_USB_OTG_FS_R8_USB_INT_EN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_USB_INT_EN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_USB_INT_EN_USBHD_UIE_BUS_RST__USBHD_UIE_DETECT (1 <<  0) /* 00000001: enable interrupt for USB bus reset event for USB device mode */
#define CH32V_USB_OTG_FS_R8_USB_INT_EN_USBHD_UIE_TRANSFER (1 <<  1) /* 00000002: enable interrupt for USB transfer completion */
#define CH32V_USB_OTG_FS_R8_USB_INT_EN_USBHD_UIE_SUSPEND (1 <<  2) /* 00000004: enable interrupt for USB suspend or resume event */
#define CH32V_USB_OTG_FS_R8_USB_INT_EN_USBHD_UIE_HST_SOF (1 <<  3) /* 00000008: enable interrupt for host SOF timer action for USB host mode */
#define CH32V_USB_OTG_FS_R8_USB_INT_EN_USBHD_UIE_FIFO_OV (1 <<  4) /* 00000010: enable interrupt for FIFO overflow */
#define CH32V_USB_OTG_FS_R8_USB_INT_EN_USBHD_UIE_DEV_NAK (1 <<  6) /* 00000040: enable interrupt for NAK responded for USB device mode */
#define CH32V_USB_OTG_FS_R8_USB_INT_EN_USBHD_UIE_DEV_SOF (1 <<  7) /* 00000080: enable interrupt for SOF received for USB device mode */
#define CH32V_USB_OTG_FS_R8_USB_DEV_AD_OFFSET 0x0003
#define CH32V_USB_OTG_FS_R8_USB_DEV_AD    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_USB_DEV_AD_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_USB_DEV_AD_MASK_USB_ADDR (0x7f << 0) /* 0000007f: bit mask for USB device address */
#define CH32V_USB_OTG_FS_R8_USB_DEV_AD_MASK_USB_ADDR_MASK (0x7f << 0)
#define CH32V_USB_OTG_FS_R8_USB_DEV_AD_RB_UDA_GP_BIT (1 <<  7) /* 00000080: general purpose bit */
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST_OFFSET 0x0005
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_USB_MIS_ST_OFFSET) /* read-only */
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST_RB_UMS_DEV_ATTACH (1 <<  0) /* 00000001: RO, indicate device attached status on USB host */
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST_RB_UMS_DM_LEVEL (1 <<  1) /* 00000002: RO, indicate UDM level saved at device attached to USB host */
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST_RB_UMS_SUSPEND (1 <<  2) /* 00000004: RO, indicate USB suspend status */
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST_RB_UMS_BUS_RESET (1 <<  3) /* 00000008: RO, indicate USB bus reset status */
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST_RB_UMS_R_FIFO_RDY (1 <<  4) /* 00000010: RO, indicate USB receiving FIFO ready status (not empty) */
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST_RB_UMS_SIE_FREE (1 <<  5) /* 00000020: RO, indicate USB SIE free status */
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST_RB_UMS_SOF_ACT (1 <<  6) /* 00000040: RO, indicate host SOF timer action status for USB host */
#define CH32V_USB_OTG_FS_R8_USB_MIS_ST_RB_UMS_SOF_PRES (1 <<  7) /* 00000080: RO, indicate host SOF timer presage status */
#define CH32V_USB_OTG_FS_R8_USB_INT_FG_OFFSET 0x0006
#define CH32V_USB_OTG_FS_R8_USB_INT_FG    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_USB_INT_FG_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_USB_INT_FG_RB_UIF_BUS_RST__RB_UIF_DETECT (1 <<  0) /* 00000001: bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear;device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear */
#define CH32V_USB_OTG_FS_R8_USB_INT_FG_RB_UIF_TRANSFER (1 <<  1) /* 00000002: USB transfer completion interrupt flag, direct bit address clear or write 1 to clear */
#define CH32V_USB_OTG_FS_R8_USB_INT_FG_RB_UIF_SUSPEND (1 <<  2) /* 00000004: USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear */
#define CH32V_USB_OTG_FS_R8_USB_INT_FG_RB_UIF_HST_SOF (1 <<  3) /* 00000008: host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear */
#define CH32V_USB_OTG_FS_R8_USB_INT_FG_RB_UIF_FIFO_OV (1 <<  4) /* 00000010: FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear */
#define CH32V_USB_OTG_FS_R8_USB_INT_FG_RB_U_SIE_FREE (1 <<  5) /* 00000020: RO, indicate USB SIE free status */
#define CH32V_USB_OTG_FS_R8_USB_INT_FG_RB_U_TOG_OK (1 <<  6) /* 00000040: RO, indicate current USB transfer toggle is OK */
#define CH32V_USB_OTG_FS_R8_USB_INT_FG_RB_U_IS_NAK (1 <<  7) /* 00000080: RO, indicate current USB transfer is NAK received */
#define CH32V_USB_OTG_FS_R8_USB_INT_ST_OFFSET 0x0007
#define CH32V_USB_OTG_FS_R8_USB_INT_ST    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_USB_INT_ST_OFFSET) /* read-only */
#define CH32V_USB_OTG_FS_R8_USB_INT_ST_MASK_UIS_H_RES__MASK_UIS_ENDP (0xf << 0) /* 0000000f: RO, bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received;RO, bit mask of current transfer endpoint number for USB device mode */
#define CH32V_USB_OTG_FS_R8_USB_INT_ST_MASK_UIS_H_RES__MASK_UIS_ENDP_MASK (0xf << 0)
#define CH32V_USB_OTG_FS_R8_USB_INT_ST_MASK_UIS_TOKEN (0x3 << 4) /* 00000030: RO, bit mask of current token PID code received for USB device mode */
#define CH32V_USB_OTG_FS_R8_USB_INT_ST_MASK_UIS_TOKEN_MASK (0x3 << 4)
#define CH32V_USB_OTG_FS_R8_USB_INT_ST_RB_UIS_TOG_OK (1 <<  6) /* 00000040: RO, indicate current USB transfer toggle is OK */
#define CH32V_USB_OTG_FS_R8_USB_INT_ST_RB_UIS_IS_NAK (1 <<  7) /* 00000080: RO, indicate current USB transfer is NAK received for USB device mode */
#define CH32V_USB_OTG_FS_R16_USB_RX_LEN_OFFSET 0x0008
#define CH32V_USB_OTG_FS_R16_USB_RX_LEN   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R16_USB_RX_LEN_OFFSET) /* read-only */
#define CH32V_USB_OTG_FS_R8_UEP4_1_MOD_OFFSET 0x000c
#define CH32V_USB_OTG_FS_R8_UEP4_1_MOD    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP4_1_MOD_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP4_1_MOD_RB_UEP4_TX_EN (1 <<  2) /* 00000004: enable USB endpoint 4 transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP4_1_MOD_RB_UEP4_RX_EN (1 <<  3) /* 00000008: enable USB endpoint 4 receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP4_1_MOD_RB_UEP1_BUF_MOD (1 <<  4) /* 00000010: buffer mode of USB endpoint 1 */
#define CH32V_USB_OTG_FS_R8_UEP4_1_MOD_RB_UEP1_TX_EN (1 <<  6) /* 00000040: enable USB endpoint 1 transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP4_1_MOD_RB_UEP1_RX_EN (1 <<  7) /* 00000080: enable USB endpoint 1 receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD_OFFSET 0x000d
#define CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD_RB_UEP2_BUF_MOD__RB_UH_EP_RBUF_MOD (1 <<  0) /* 00000001: buffer mode of USB endpoint 2;buffer mode of USB host IN endpoint */
#define CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD_RB_UEP2_TX_EN (1 <<  2) /* 00000004: enable USB endpoint 2 transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD_RB_UEP2_RX_EN__RB_UH_EP_RX_EN (1 <<  3) /* 00000008: enable USB endpoint 2 receiving (OUT);enable USB host IN endpoint receiving */
#define CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD_RB_UEP3_BUF_MOD__RB_UH_EP_TBUF_MOD (1 <<  4) /* 00000010: buffer mode of USB endpoint 3;buffer mode of USB host OUT endpoint */
#define CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD_RB_UEP3_TX_EN__RB_UH_EP_TX_EN (1 <<  6) /* 00000040: enable USB endpoint 3 transmittal (IN);enable USB host OUT endpoint transmittal */
#define CH32V_USB_OTG_FS_R8_UEP2_3_MOD__R8_UH_EP_MOD_RB_UEP3_RX_EN (1 <<  7) /* 00000080: enable USB endpoint 3 receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP5_6_MOD_OFFSET 0x000e
#define CH32V_USB_OTG_FS_R8_UEP5_6_MOD    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP5_6_MOD_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP5_6_MOD_RB_UEP5_BUF_MOD (1 <<  0) /* 00000001: buffer mode of USB endpoint 5 */
#define CH32V_USB_OTG_FS_R8_UEP5_6_MOD_RB_UEP5_TX_EN (1 <<  2) /* 00000004: enable USB endpoint 5 transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP5_6_MOD_RB_UEP5_RX_EN (1 <<  3) /* 00000008: enable USB endpoint 5 receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP5_6_MOD_RB_UEP6_BUF_MOD (1 <<  4) /* 00000010: buffer mode of USB endpoint 6 */
#define CH32V_USB_OTG_FS_R8_UEP5_6_MOD_RB_UEP6_TX_EN (1 <<  6) /* 00000040: enable USB endpoint 6 transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP5_6_MOD_RB_UEP3_RX_EN (1 <<  7) /* 00000080: enable USB endpoint 6 receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP7_MOD_OFFSET 0x000f
#define CH32V_USB_OTG_FS_R8_UEP7_MOD      (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP7_MOD_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP7_MOD_RB_UEP7_BUF_MOD (1 <<  0) /* 00000001: buffer mode of USB endpoint 7 */
#define CH32V_USB_OTG_FS_R8_UEP7_MOD_RB_UEP7_TX_EN (1 <<  2) /* 00000004: enable USB endpoint 7 transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP7_MOD_RB_UEP7_RX_EN (1 <<  3) /* 00000008: enable USB endpoint 7 receiving (OUT) */
#define CH32V_USB_OTG_FS_R32_UEP0_DMA_OFFSET 0x0010
#define CH32V_USB_OTG_FS_R32_UEP0_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP0_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP1_DMA_OFFSET 0x0014
#define CH32V_USB_OTG_FS_R32_UEP1_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP1_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP2_DMA__R32_UH_RX_DMA_OFFSET 0x0018
#define CH32V_USB_OTG_FS_R32_UEP2_DMA__R32_UH_RX_DMA (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP2_DMA__R32_UH_RX_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP3_DMA__R32_UH_TX_DMA_OFFSET 0x001c
#define CH32V_USB_OTG_FS_R32_UEP3_DMA__R32_UH_TX_DMA (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP3_DMA__R32_UH_TX_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP4_DMA_OFFSET 0x0020
#define CH32V_USB_OTG_FS_R32_UEP4_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP4_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP5_DMA_OFFSET 0x0024
#define CH32V_USB_OTG_FS_R32_UEP5_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP5_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP6_DMA_OFFSET 0x0028
#define CH32V_USB_OTG_FS_R32_UEP6_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP6_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R32_UEP7_DMA_OFFSET 0x002c
#define CH32V_USB_OTG_FS_R32_UEP7_DMA     (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R32_UEP7_DMA_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP0_T_LEN_OFFSET 0x0030
#define CH32V_USB_OTG_FS_R8_UEP0_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP0_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP0_T_CTRL_OFFSET 0x0032
#define CH32V_USB_OTG_FS_R8_UEP0_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP0_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP0_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP0_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP0_T_CTRL_USBHD_UEP_T_TOG (1 <<  2) /* 00000004: prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP0_T_CTRL_USBHD_UEP_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP0_R_CTRL_OFFSET 0x0033
#define CH32V_USB_OTG_FS_R8_UEP0_R_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP0_R_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP0_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP0_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP0_R_CTRL_USBHD_UEP_R_TOG (1 <<  2) /* 00000004: expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP0_R_CTRL_USBHD_UEP_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP1_T_LEN_OFFSET 0x0034
#define CH32V_USB_OTG_FS_R8_UEP1_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP1_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP_OFFSET 0x0036
#define CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP_MASK_UEP_T_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP_USBHD_UEP_T_TOG_ (1 <<  2) /* 00000004: prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP_USBHD_UEP_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP_USBHD_UH_SOF_EN (1 <<  6) /* 00000040: USB host automatic SOF enable */
#define CH32V_USB_OTG_FS_R8_UEP1_T_CTRL___USBHD_UH_SETUP_USBHD_UH_PRE_PID_EN (1 <<  7) /* 00000080: USB host PRE PID enable for low speed device via hub */
#define CH32V_USB_OTG_FS_R8_UEP1_R_CTRL_OFFSET 0x0037
#define CH32V_USB_OTG_FS_R8_UEP1_R_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP1_R_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP1_R_CTRL_MASK_UEP_R_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP1_R_CTRL_MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP1_R_CTRL_USBHD_UEP_R_TOG (1 <<  2) /* 00000004: expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP1_R_CTRL_USBHD_UEP_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP2_T_LEN__USBHD_UH_EP_PID_OFFSET 0x0038
#define CH32V_USB_OTG_FS_R8_UEP2_T_LEN__USBHD_UH_EP_PID (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP2_T_LEN__USBHD_UH_EP_PID_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP2_T_LEN__USBHD_UH_EP_PID_USBHD_UH_ENDP_MASK (0xf << 0) /* 0000000f: bit mask of endpoint number for USB host transfer */
#define CH32V_USB_OTG_FS_R8_UEP2_T_LEN__USBHD_UH_EP_PID_USBHD_UH_ENDP_MASK_MASK (0xf << 0)
#define CH32V_USB_OTG_FS_R8_UEP2_T_LEN__USBHD_UH_EP_PID_USBHD_UH_TOKEN_MASK (0xf << 4) /* 000000f0: bit mask of token PID for USB host transfer */
#define CH32V_USB_OTG_FS_R8_UEP2_T_LEN__USBHD_UH_EP_PID_USBHD_UH_TOKEN_MASK_MASK (0xf << 4)
#define CH32V_USB_OTG_FS_R8_UEP2_T_CTRL_OFFSET 0x003a
#define CH32V_USB_OTG_FS_R8_UEP2_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP2_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP2_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP2_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP2_T_CTRL_USBHD_UEP_T_TOG_ (1 <<  2) /* 00000004: prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP2_T_CTRL_USBHD_UEP_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL_OFFSET 0x003b
