robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
#define CH32V_USB_OTG_FS_R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL_MASK_UEP_R_RES___USBHD_UH_R_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL_MASK_UEP_R_RES___USBHD_UH_R_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL_USBHD_UEP_R_TOG___USBHD_UH_R_TOG (1 <<  2) /* 00000004: expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL_USBHD_UEP_AUTO_TOG___USBHD_UH_R_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP3_T_LEN__USBHD_UH_TX_LEN_OFFSET 0x003c
#define CH32V_USB_OTG_FS_R8_UEP3_T_LEN__USBHD_UH_TX_LEN (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP3_T_LEN__USBHD_UH_TX_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL_OFFSET 0x003e
#define CH32V_USB_OTG_FS_R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL_MASK_UEP_T_RES___USBHD_UH_T_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL_MASK_UEP_T_RES___USBHD_UH_T_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL_USBHD_UEP_T_TOG___USBHD_UH_T_TOG (1 <<  2) /* 00000004: prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL_USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP3_R_CTRL__OFFSET 0x003f
#define CH32V_USB_OTG_FS_R8_UEP3_R_CTRL_  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP3_R_CTRL__OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP3_R_CTRL__MASK_UEP_R_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP3_R_CTRL__MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP3_R_CTRL__USBHD_UEP_R_TOG (1 <<  2) /* 00000004: expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP3_R_CTRL__USBHD_UEP_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP4_T_LEN_OFFSET 0x0040
#define CH32V_USB_OTG_FS_R8_UEP4_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP4_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP4_T_CTRL_OFFSET 0x0042
#define CH32V_USB_OTG_FS_R8_UEP4_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP4_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP4_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP4_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP4_T_CTRL_USBHD_UEP_T_TOG___USBHD_UH_T_TOG (1 <<  2) /* 00000004: prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP4_T_CTRL_USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP4_R_CTRL__OFFSET 0x0043
#define CH32V_USB_OTG_FS_R8_UEP4_R_CTRL_  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP4_R_CTRL__OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP4_R_CTRL__MASK_UEP_R_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP4_R_CTRL__MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP4_R_CTRL__USBHD_UEP_R_TOG (1 <<  2) /* 00000004: expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP4_R_CTRL__USBHD_UEP_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP5_T_LEN_OFFSET 0x0044
#define CH32V_USB_OTG_FS_R8_UEP5_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP5_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP5_T_CTRL_OFFSET 0x0046
#define CH32V_USB_OTG_FS_R8_UEP5_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP5_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP5_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP5_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP5_T_CTRL_USBHD_UEP_T_TOG___USBHD_UH_T_TOG (1 <<  2) /* 00000004: prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP5_T_CTRL_USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP5_R_CTRL__OFFSET 0x0047
#define CH32V_USB_OTG_FS_R8_UEP5_R_CTRL_  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP5_R_CTRL__OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP5_R_CTRL__MASK_UEP_R_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP5_R_CTRL__MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP5_R_CTRL__USBHD_UEP_R_TOG (1 <<  2) /* 00000004: expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP5_R_CTRL__USBHD_UEP_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP6_T_LEN_OFFSET 0x0048
#define CH32V_USB_OTG_FS_R8_UEP6_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP6_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP6_T_CTRL_OFFSET 0x004a
#define CH32V_USB_OTG_FS_R8_UEP6_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP6_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP6_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP6_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP6_T_CTRL_USBHD_UEP_T_TOG___USBHD_UH_T_TOG (1 <<  2) /* 00000004: prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP6_T_CTRL_USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP6_R_CTRL__OFFSET 0x004b
#define CH32V_USB_OTG_FS_R8_UEP6_R_CTRL_  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP6_R_CTRL__OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP6_R_CTRL__MASK_UEP_R_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP6_R_CTRL__MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP6_R_CTRL__USBHD_UEP_R_TOG (1 <<  2) /* 00000004: expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP6_R_CTRL__USBHD_UEP_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP7_T_LEN_OFFSET 0x004c
#define CH32V_USB_OTG_FS_R8_UEP7_T_LEN    (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP7_T_LEN_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP7_T_CTRL_OFFSET 0x004e
#define CH32V_USB_OTG_FS_R8_UEP7_T_CTRL   (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP7_T_CTRL_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP7_T_CTRL_MASK_UEP_T_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X transmittal (IN) */
#define CH32V_USB_OTG_FS_R8_UEP7_T_CTRL_MASK_UEP_T_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP7_T_CTRL_USBHD_UEP_T_TOG___USBHD_UH_T_TOG (1 <<  2) /* 00000004: prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP7_T_CTRL_USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_R8_UEP7_R_CTRL__OFFSET 0x004f
#define CH32V_USB_OTG_FS_R8_UEP7_R_CTRL_  (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_R8_UEP7_R_CTRL__OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_R8_UEP7_R_CTRL__MASK_UEP_R_RES (0x3 << 0) /* 00000003: bit mask of handshake response type for USB endpoint X receiving (OUT) */
#define CH32V_USB_OTG_FS_R8_UEP7_R_CTRL__MASK_UEP_R_RES_MASK (0x3 << 0)
#define CH32V_USB_OTG_FS_R8_UEP7_R_CTRL__USBHD_UEP_R_TOG (1 <<  2) /* 00000004: expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1 */
#define CH32V_USB_OTG_FS_R8_UEP7_R_CTRL__USBHD_UEP_AUTO_TOG (1 <<  3) /* 00000008: enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle */
#define CH32V_USB_OTG_FS_USB_OTG_CR_OFFSET 0x0054
#define CH32V_USB_OTG_FS_USB_OTG_CR       (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_USB_OTG_CR_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_USB_OTG_CR_USB_OTG_CR_DISCHARGEVBUS (1 <<  0) /* 00000001: usb otg control */
#define CH32V_USB_OTG_FS_USB_OTG_CR_USB_OTG_CR_CHARGEVBUS (1 <<  1) /* 00000002: usb otg control */
#define CH32V_USB_OTG_FS_USB_OTG_CR_USB_OTG_CR_IDPU (1 <<  2) /* 00000004: usb otg control */
#define CH32V_USB_OTG_FS_USB_OTG_CR_USB_OTG_CR_OTG_EN (1 <<  3) /* 00000008: usb otg control */
#define CH32V_USB_OTG_FS_USB_OTG_CR_USB_OTG_CR_VBUS (1 <<  4) /* 00000010: usb otg control */
#define CH32V_USB_OTG_FS_USB_OTG_CR_USB_OTG_CR_SESS (1 <<  5) /* 00000020: usb otg control */
#define CH32V_USB_OTG_FS_USB_OTG_SR_OFFSET 0x0058
#define CH32V_USB_OTG_FS_USB_OTG_SR       (CH32V_USB_OTG_FS_BASE + CH32V_USB_OTG_FS_USB_OTG_SR_OFFSET) /* read-write */
#define CH32V_USB_OTG_FS_USB_OTG_SR_USB_OTG_SR_VBUS_VLD (1 <<  0) /* 00000001: usb otg status */
#define CH32V_USB_OTG_FS_USB_OTG_SR_USB_OTG_SR_SESS_VLD (1 <<  1) /* 00000002: usb otg status */
#define CH32V_USB_OTG_FS_USB_OTG_SR_USB_OTG_SR_SESS_END (1 <<  2) /* 00000004: usb otg status */
#define CH32V_USB_OTG_FS_USB_OTG_SR_USB_OTG_SR_ID_DIG (1 <<  3) /* 00000008: usb otg status */

