robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
#define CH32V_PFIC_IPRIOR76_OFFSET        0x044c
#define CH32V_PFIC_IPRIOR76               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR76_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR77_OFFSET        0x044d
#define CH32V_PFIC_IPRIOR77               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR77_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR78_OFFSET        0x044e
#define CH32V_PFIC_IPRIOR78               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR78_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR79_OFFSET        0x044f
#define CH32V_PFIC_IPRIOR79               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR79_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR80_OFFSET        0x0450
#define CH32V_PFIC_IPRIOR80               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR80_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR81_OFFSET        0x0451
#define CH32V_PFIC_IPRIOR81               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR81_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR82_OFFSET        0x0452
#define CH32V_PFIC_IPRIOR82               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR82_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR83_OFFSET        0x0453
#define CH32V_PFIC_IPRIOR83               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR83_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR84_OFFSET        0x0454
#define CH32V_PFIC_IPRIOR84               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR84_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR85_OFFSET        0x0455
#define CH32V_PFIC_IPRIOR85               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR85_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR86_OFFSET        0x0456
#define CH32V_PFIC_IPRIOR86               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR86_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR87_OFFSET        0x0457
#define CH32V_PFIC_IPRIOR87               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR87_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR88_OFFSET        0x0458
#define CH32V_PFIC_IPRIOR88               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR88_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR89_OFFSET        0x0459
#define CH32V_PFIC_IPRIOR89               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR89_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR90_OFFSET        0x045a
#define CH32V_PFIC_IPRIOR90               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR90_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR91_OFFSET        0x045b
#define CH32V_PFIC_IPRIOR91               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR91_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR92_OFFSET        0x045c
#define CH32V_PFIC_IPRIOR92               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR92_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR93_OFFSET        0x045d
#define CH32V_PFIC_IPRIOR93               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR93_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR94_OFFSET        0x045e
#define CH32V_PFIC_IPRIOR94               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR94_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR95_OFFSET        0x045f
#define CH32V_PFIC_IPRIOR95               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR95_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR96_OFFSET        0x0460
#define CH32V_PFIC_IPRIOR96               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR96_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR97_OFFSET        0x0461
#define CH32V_PFIC_IPRIOR97               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR97_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR98_OFFSET        0x0462
#define CH32V_PFIC_IPRIOR98               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR98_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR99_OFFSET        0x0463
#define CH32V_PFIC_IPRIOR99               (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR99_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR100_OFFSET       0x0464
#define CH32V_PFIC_IPRIOR100              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR100_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR101_OFFSET       0x0465
#define CH32V_PFIC_IPRIOR101              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR101_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR102_OFFSET       0x0466
#define CH32V_PFIC_IPRIOR102              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR102_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR103_OFFSET       0x0467
#define CH32V_PFIC_IPRIOR103              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR103_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR104_OFFSET       0x0468
#define CH32V_PFIC_IPRIOR104              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR104_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR105_OFFSET       0x0469
#define CH32V_PFIC_IPRIOR105              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR105_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR106_OFFSET       0x046a
#define CH32V_PFIC_IPRIOR106              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR106_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR107_OFFSET       0x046b
#define CH32V_PFIC_IPRIOR107              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR107_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR108_OFFSET       0x046c
#define CH32V_PFIC_IPRIOR108              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR108_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR109_OFFSET       0x046d
#define CH32V_PFIC_IPRIOR109              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR109_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR110_OFFSET       0x046e
#define CH32V_PFIC_IPRIOR110              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR110_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR111_OFFSET       0x046f
#define CH32V_PFIC_IPRIOR111              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR111_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR112_OFFSET       0x0470
#define CH32V_PFIC_IPRIOR112              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR112_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR113_OFFSET       0x0471
#define CH32V_PFIC_IPRIOR113              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR113_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR114_OFFSET       0x0472
#define CH32V_PFIC_IPRIOR114              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR114_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR115_OFFSET       0x0473
#define CH32V_PFIC_IPRIOR115              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR115_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR116_OFFSET       0x0474
#define CH32V_PFIC_IPRIOR116              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR116_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR117_OFFSET       0x0475
#define CH32V_PFIC_IPRIOR117              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR117_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR118_OFFSET       0x0476
#define CH32V_PFIC_IPRIOR118              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR118_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR119_OFFSET       0x0477
#define CH32V_PFIC_IPRIOR119              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR119_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR120_OFFSET       0x0478
#define CH32V_PFIC_IPRIOR120              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR120_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR121_OFFSET       0x0479
#define CH32V_PFIC_IPRIOR121              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR121_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR122_OFFSET       0x047a
#define CH32V_PFIC_IPRIOR122              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR122_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR123_OFFSET       0x047b
#define CH32V_PFIC_IPRIOR123              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR123_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR124_OFFSET       0x047c
#define CH32V_PFIC_IPRIOR124              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR124_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR125_OFFSET       0x047d
#define CH32V_PFIC_IPRIOR125              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR125_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR126_OFFSET       0x047e
#define CH32V_PFIC_IPRIOR126              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR126_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR127_OFFSET       0x047f
#define CH32V_PFIC_IPRIOR127              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR127_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR128_OFFSET       0x0480
#define CH32V_PFIC_IPRIOR128              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR128_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR129_OFFSET       0x0481
#define CH32V_PFIC_IPRIOR129              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR129_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR130_OFFSET       0x0482
#define CH32V_PFIC_IPRIOR130              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR130_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR131_OFFSET       0x0483
#define CH32V_PFIC_IPRIOR131              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR131_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR132_OFFSET       0x0484
#define CH32V_PFIC_IPRIOR132              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR132_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR133_OFFSET       0x0485
#define CH32V_PFIC_IPRIOR133              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR133_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR134_OFFSET       0x0486
#define CH32V_PFIC_IPRIOR134              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR134_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR135_OFFSET       0x0487
#define CH32V_PFIC_IPRIOR135              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR135_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR136_OFFSET       0x0488
#define CH32V_PFIC_IPRIOR136              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR136_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR137_OFFSET       0x0489
#define CH32V_PFIC_IPRIOR137              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR137_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR138_OFFSET       0x048a
#define CH32V_PFIC_IPRIOR138              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR138_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR139_OFFSET       0x048b
#define CH32V_PFIC_IPRIOR139              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR139_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR140_OFFSET       0x048c
#define CH32V_PFIC_IPRIOR140              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR140_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR141_OFFSET       0x048d
#define CH32V_PFIC_IPRIOR141              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR141_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR142_OFFSET       0x048e
#define CH32V_PFIC_IPRIOR142              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR142_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR143_OFFSET       0x048f
#define CH32V_PFIC_IPRIOR143              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR143_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR144_OFFSET       0x0490
#define CH32V_PFIC_IPRIOR144              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR144_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR145_OFFSET       0x0491
#define CH32V_PFIC_IPRIOR145              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR145_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR146_OFFSET       0x0492
#define CH32V_PFIC_IPRIOR146              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR146_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR147_OFFSET       0x0493
#define CH32V_PFIC_IPRIOR147              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR147_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR148_OFFSET       0x0494
#define CH32V_PFIC_IPRIOR148              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR148_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR149_OFFSET       0x0495
#define CH32V_PFIC_IPRIOR149              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR149_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR150_OFFSET       0x0496
#define CH32V_PFIC_IPRIOR150              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR150_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR151_OFFSET       0x0497
#define CH32V_PFIC_IPRIOR151              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR151_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR152_OFFSET       0x0498
#define CH32V_PFIC_IPRIOR152              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR152_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR153_OFFSET       0x0499
#define CH32V_PFIC_IPRIOR153              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR153_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR154_OFFSET       0x049a
#define CH32V_PFIC_IPRIOR154              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR154_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR155_OFFSET       0x049b
#define CH32V_PFIC_IPRIOR155              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR155_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR156_OFFSET       0x049c
#define CH32V_PFIC_IPRIOR156              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR156_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR157_OFFSET       0x049d
#define CH32V_PFIC_IPRIOR157              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR157_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR158_OFFSET       0x049e
#define CH32V_PFIC_IPRIOR158              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR158_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR159_OFFSET       0x049f
#define CH32V_PFIC_IPRIOR159              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR159_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR160_OFFSET       0x04a0
#define CH32V_PFIC_IPRIOR160              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR160_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR161_OFFSET       0x04a1
#define CH32V_PFIC_IPRIOR161              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR161_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR162_OFFSET       0x04a2
#define CH32V_PFIC_IPRIOR162              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR162_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR163_OFFSET       0x04a3
#define CH32V_PFIC_IPRIOR163              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR163_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR164_OFFSET       0x04a4
#define CH32V_PFIC_IPRIOR164              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR164_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR165_OFFSET       0x04a5
#define CH32V_PFIC_IPRIOR165              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR165_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR166_OFFSET       0x04a6
#define CH32V_PFIC_IPRIOR166              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR166_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR167_OFFSET       0x04a7
#define CH32V_PFIC_IPRIOR167              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR167_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR168_OFFSET       0x04a8
#define CH32V_PFIC_IPRIOR168              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR168_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR169_OFFSET       0x04a9
#define CH32V_PFIC_IPRIOR169              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR169_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR170_OFFSET       0x04aa
#define CH32V_PFIC_IPRIOR170              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR170_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR171_OFFSET       0x04ab
#define CH32V_PFIC_IPRIOR171              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR171_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR172_OFFSET       0x04ac
#define CH32V_PFIC_IPRIOR172              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR172_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR173_OFFSET       0x04ad
#define CH32V_PFIC_IPRIOR173              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR173_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR174_OFFSET       0x04ae
#define CH32V_PFIC_IPRIOR174              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR174_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR175_OFFSET       0x04af
#define CH32V_PFIC_IPRIOR175              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR175_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR176_OFFSET       0x04b0
#define CH32V_PFIC_IPRIOR176              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR176_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR177_OFFSET       0x04b1
#define CH32V_PFIC_IPRIOR177              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR177_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR178_OFFSET       0x04b2
#define CH32V_PFIC_IPRIOR178              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR178_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR179_OFFSET       0x04b3
#define CH32V_PFIC_IPRIOR179              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR179_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR180_OFFSET       0x04b4
#define CH32V_PFIC_IPRIOR180              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR180_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR181_OFFSET       0x04b5
#define CH32V_PFIC_IPRIOR181              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR181_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR182_OFFSET       0x04b6
#define CH32V_PFIC_IPRIOR182              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR182_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR183_OFFSET       0x04b7
#define CH32V_PFIC_IPRIOR183              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR183_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR184_OFFSET       0x04b8
#define CH32V_PFIC_IPRIOR184              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR184_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR185_OFFSET       0x04b9
#define CH32V_PFIC_IPRIOR185              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR185_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR186_OFFSET       0x04ba
#define CH32V_PFIC_IPRIOR186              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR186_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR187_OFFSET       0x04bb
#define CH32V_PFIC_IPRIOR187              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR187_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR188_OFFSET       0x04bc
#define CH32V_PFIC_IPRIOR188              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR188_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR189_OFFSET       0x04bd
#define CH32V_PFIC_IPRIOR189              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR189_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR190_OFFSET       0x04be
#define CH32V_PFIC_IPRIOR190              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR190_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR191_OFFSET       0x04bf
#define CH32V_PFIC_IPRIOR191              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR191_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR192_OFFSET       0x04c0
#define CH32V_PFIC_IPRIOR192              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR192_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR193_OFFSET       0x04c1
#define CH32V_PFIC_IPRIOR193              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR193_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR194_OFFSET       0x04c2
#define CH32V_PFIC_IPRIOR194              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR194_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR195_OFFSET       0x04c3
#define CH32V_PFIC_IPRIOR195              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR195_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR196_OFFSET       0x04c4
#define CH32V_PFIC_IPRIOR196              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR196_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR197_OFFSET       0x04c5
#define CH32V_PFIC_IPRIOR197              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR197_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR198_OFFSET       0x04c6
#define CH32V_PFIC_IPRIOR198              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR198_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR199_OFFSET       0x04c7
#define CH32V_PFIC_IPRIOR199              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR199_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR200_OFFSET       0x04c8
#define CH32V_PFIC_IPRIOR200              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR200_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR201_OFFSET       0x04c9
#define CH32V_PFIC_IPRIOR201              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR201_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR202_OFFSET       0x04ca
#define CH32V_PFIC_IPRIOR202              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR202_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR203_OFFSET       0x04cb
#define CH32V_PFIC_IPRIOR203              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR203_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR204_OFFSET       0x04cc
#define CH32V_PFIC_IPRIOR204              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR204_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR205_OFFSET       0x04cd
#define CH32V_PFIC_IPRIOR205              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR205_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR206_OFFSET       0x04ce
#define CH32V_PFIC_IPRIOR206              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR206_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR207_OFFSET       0x04cf
#define CH32V_PFIC_IPRIOR207              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR207_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR208_OFFSET       0x04d0
#define CH32V_PFIC_IPRIOR208              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR208_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR209_OFFSET       0x04d1
#define CH32V_PFIC_IPRIOR209              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR209_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR210_OFFSET       0x04d2
#define CH32V_PFIC_IPRIOR210              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR210_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR211_OFFSET       0x04d3
#define CH32V_PFIC_IPRIOR211              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR211_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR212_OFFSET       0x04d4
#define CH32V_PFIC_IPRIOR212              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR212_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR213_OFFSET       0x04d5
#define CH32V_PFIC_IPRIOR213              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR213_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR214_OFFSET       0x04d6
#define CH32V_PFIC_IPRIOR214              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR214_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR215_OFFSET       0x04d7
#define CH32V_PFIC_IPRIOR215              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR215_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR216_OFFSET       0x04d8
#define CH32V_PFIC_IPRIOR216              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR216_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR217_OFFSET       0x04d9
#define CH32V_PFIC_IPRIOR217              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR217_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR218_OFFSET       0x04da
#define CH32V_PFIC_IPRIOR218              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR218_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR219_OFFSET       0x04db
#define CH32V_PFIC_IPRIOR219              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR219_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR220_OFFSET       0x04dc
#define CH32V_PFIC_IPRIOR220              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR220_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR221_OFFSET       0x04dd
#define CH32V_PFIC_IPRIOR221              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR221_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR222_OFFSET       0x04de
#define CH32V_PFIC_IPRIOR222              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR222_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR223_OFFSET       0x04df
#define CH32V_PFIC_IPRIOR223              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR223_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR224_OFFSET       0x04e0
#define CH32V_PFIC_IPRIOR224              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR224_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR225_OFFSET       0x04e1
#define CH32V_PFIC_IPRIOR225              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR225_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR226_OFFSET       0x04e2
#define CH32V_PFIC_IPRIOR226              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR226_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR227_OFFSET       0x04e3
#define CH32V_PFIC_IPRIOR227              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR227_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR228_OFFSET       0x04e4
#define CH32V_PFIC_IPRIOR228              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR228_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR229_OFFSET       0x04e5
#define CH32V_PFIC_IPRIOR229              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR229_OFFSET) /* read-write */
