robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
#define CH32V_PFIC_IPRIOR230_OFFSET       0x04e6
#define CH32V_PFIC_IPRIOR230              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR230_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR231_OFFSET       0x04e7
#define CH32V_PFIC_IPRIOR231              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR231_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR232_OFFSET       0x04e8
#define CH32V_PFIC_IPRIOR232              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR232_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR233_OFFSET       0x04e9
#define CH32V_PFIC_IPRIOR233              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR233_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR234_OFFSET       0x04ea
#define CH32V_PFIC_IPRIOR234              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR234_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR235_OFFSET       0x04eb
#define CH32V_PFIC_IPRIOR235              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR235_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR236_OFFSET       0x04ec
#define CH32V_PFIC_IPRIOR236              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR236_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR237_OFFSET       0x04ed
#define CH32V_PFIC_IPRIOR237              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR237_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR238_OFFSET       0x04ee
#define CH32V_PFIC_IPRIOR238              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR238_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR239_OFFSET       0x04ef
#define CH32V_PFIC_IPRIOR239              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR239_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR240_OFFSET       0x04f0
#define CH32V_PFIC_IPRIOR240              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR240_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR241_OFFSET       0x04f1
#define CH32V_PFIC_IPRIOR241              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR241_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR242_OFFSET       0x04f2
#define CH32V_PFIC_IPRIOR242              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR242_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR243_OFFSET       0x04f3
#define CH32V_PFIC_IPRIOR243              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR243_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR244_OFFSET       0x04f4
#define CH32V_PFIC_IPRIOR244              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR244_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR245_OFFSET       0x04f5
#define CH32V_PFIC_IPRIOR245              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR245_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR246_OFFSET       0x04f6
#define CH32V_PFIC_IPRIOR246              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR246_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR247_OFFSET       0x04f7
#define CH32V_PFIC_IPRIOR247              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR247_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR248_OFFSET       0x04f8
#define CH32V_PFIC_IPRIOR248              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR248_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR249_OFFSET       0x04f9
#define CH32V_PFIC_IPRIOR249              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR249_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR250_OFFSET       0x04fa
#define CH32V_PFIC_IPRIOR250              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR250_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR251_OFFSET       0x04fb
#define CH32V_PFIC_IPRIOR251              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR251_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR252_OFFSET       0x04fc
#define CH32V_PFIC_IPRIOR252              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR252_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR253_OFFSET       0x04fd
#define CH32V_PFIC_IPRIOR253              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR253_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR254_OFFSET       0x04fe
#define CH32V_PFIC_IPRIOR254              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR254_OFFSET) /* read-write */
#define CH32V_PFIC_IPRIOR255_OFFSET       0x04ff
#define CH32V_PFIC_IPRIOR255              (CH32V_PFIC_BASE + CH32V_PFIC_IPRIOR255_OFFSET) /* read-write */
#define CH32V_PFIC_SCTLR_OFFSET           0x0d10
#define CH32V_PFIC_SCTLR                  (CH32V_PFIC_BASE + CH32V_PFIC_SCTLR_OFFSET) /* read-write */
#define CH32V_PFIC_SCTLR_SLEEPONEXIT      (1 <<  1) /* 00000002: SLEEPONEXIT */
#define CH32V_PFIC_SCTLR_SLEEPDEEP        (1 <<  2) /* 00000004: SLEEPDEEP */
#define CH32V_PFIC_SCTLR_WFITOWFE         (1 <<  3) /* 00000008: WFITOWFE */
#define CH32V_PFIC_SCTLR_SEVONPEND        (1 <<  4) /* 00000010: SEVONPEND */
#define CH32V_PFIC_SCTLR_SETEVENT         (1 <<  5) /* 00000020: SETEVENT */
#define CH32V_PFIC_SCTLR_SYSRESET         (1 << 31) /* 80000000: SYSRESET */
#define CH32V_PFIC_STK_CTLR_OFFSET        0x1000
#define CH32V_PFIC_STK_CTLR               (CH32V_PFIC_BASE + CH32V_PFIC_STK_CTLR_OFFSET)
#define CH32V_PFIC_STK_CTLR_STE           (1 <<  0) /* 00000001: System counter enable */
#define CH32V_PFIC_STK_CTLR_STIE          (1 <<  1) /* 00000002: System counter interrupt enable */
#define CH32V_PFIC_STK_CTLR_STCLK         (1 <<  2) /* 00000004: System selects the clock source */
#define CH32V_PFIC_STK_CTLR_STRE          (1 <<  3) /* 00000008: System reload register */
#define CH32V_PFIC_STK_CTLR_MODE          (1 <<  4) /* 00000010: System Mode */
#define CH32V_PFIC_STK_CTLR_INIT          (1 <<  5) /* 00000020: System Initialization update */
#define CH32V_PFIC_STK_CTLR_SWIE          (1 << 31) /* 80000000: System software triggered interrupts enable */
#define CH32V_PFIC_STK_SR_OFFSET          0x1004
#define CH32V_PFIC_STK_SR                 (CH32V_PFIC_BASE + CH32V_PFIC_STK_SR_OFFSET) /* read-write */
#define CH32V_PFIC_STK_SR_CNTIF           (1 <<  0) /* 00000001: CNTIF */
#define CH32V_PFIC_STK_CNTL_OFFSET        0x1008
#define CH32V_PFIC_STK_CNTL               (CH32V_PFIC_BASE + CH32V_PFIC_STK_CNTL_OFFSET) /* read-write */
#define CH32V_PFIC_STK_CNTL_CNTL          (0xffffffff << 0) /* ffffffff: CNTL */
#define CH32V_PFIC_STK_CNTL_CNTL_MASK     (0xffffffff << 0)
#define CH32V_PFIC_STK_CNTH_OFFSET        0x100c
#define CH32V_PFIC_STK_CNTH               (CH32V_PFIC_BASE + CH32V_PFIC_STK_CNTH_OFFSET) /* read-write */
#define CH32V_PFIC_STK_CNTH_CNTH          (0xffffffff << 0) /* ffffffff: CNTH */
#define CH32V_PFIC_STK_CNTH_CNTH_MASK     (0xffffffff << 0)
#define CH32V_PFIC_STK_CMPLR_OFFSET       0x1010
#define CH32V_PFIC_STK_CMPLR              (CH32V_PFIC_BASE + CH32V_PFIC_STK_CMPLR_OFFSET) /* read-write */
#define CH32V_PFIC_STK_CMPLR_CMPL         (0xffffffff << 0) /* ffffffff: CMPL */
#define CH32V_PFIC_STK_CMPLR_CMPL_MASK    (0xffffffff << 0)
#define CH32V_PFIC_STK_CMPHR_OFFSET       0x1014
#define CH32V_PFIC_STK_CMPHR              (CH32V_PFIC_BASE + CH32V_PFIC_STK_CMPHR_OFFSET) /* read-write */
#define CH32V_PFIC_STK_CMPHR_CMPH         (0xffffffff << 0) /* ffffffff: CMPH */
#define CH32V_PFIC_STK_CMPHR_CMPH_MASK    (0xffffffff << 0)

