robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
#define CH32V_CAN2_FSCFGR_FSC2            (1 <<  2) /* 00000004: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC3            (1 <<  3) /* 00000008: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC4            (1 <<  4) /* 00000010: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC5            (1 <<  5) /* 00000020: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC6            (1 <<  6) /* 00000040: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC7            (1 <<  7) /* 00000080: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC8            (1 <<  8) /* 00000100: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC9            (1 <<  9) /* 00000200: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC10           (1 << 10) /* 00000400: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC11           (1 << 11) /* 00000800: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC12           (1 << 12) /* 00001000: Filter scale configuration */
#define CH32V_CAN2_FSCFGR_FSC13           (1 << 13) /* 00002000: Filter scale configuration */
#define CH32V_CAN2_FAFIFOR_OFFSET         0x0214
#define CH32V_CAN2_FAFIFOR                (CH32V_CAN2_BASE + CH32V_CAN2_FAFIFOR_OFFSET) /* read-write */
#define CH32V_CAN2_FAFIFOR_FFA0           (1 <<  0) /* 00000001: Filter FIFO assignment for filter 0 */
#define CH32V_CAN2_FAFIFOR_FFA1           (1 <<  1) /* 00000002: Filter FIFO assignment for filter 1 */
#define CH32V_CAN2_FAFIFOR_FFA2           (1 <<  2) /* 00000004: Filter FIFO assignment for filter 2 */
#define CH32V_CAN2_FAFIFOR_FFA3           (1 <<  3) /* 00000008: Filter FIFO assignment for filter 3 */
#define CH32V_CAN2_FAFIFOR_FFA4           (1 <<  4) /* 00000010: Filter FIFO assignment for filter 4 */
#define CH32V_CAN2_FAFIFOR_FFA5           (1 <<  5) /* 00000020: Filter FIFO assignment for filter 5 */
#define CH32V_CAN2_FAFIFOR_FFA6           (1 <<  6) /* 00000040: Filter FIFO assignment for filter 6 */
#define CH32V_CAN2_FAFIFOR_FFA7           (1 <<  7) /* 00000080: Filter FIFO assignment for filter 7 */
#define CH32V_CAN2_FAFIFOR_FFA8           (1 <<  8) /* 00000100: Filter FIFO assignment for filter 8 */
#define CH32V_CAN2_FAFIFOR_FFA9           (1 <<  9) /* 00000200: Filter FIFO assignment for filter 9 */
#define CH32V_CAN2_FAFIFOR_FFA10          (1 << 10) /* 00000400: Filter FIFO assignment for filter 10 */
#define CH32V_CAN2_FAFIFOR_FFA11          (1 << 11) /* 00000800: Filter FIFO assignment for filter 11 */
#define CH32V_CAN2_FAFIFOR_FFA12          (1 << 12) /* 00001000: Filter FIFO assignment for filter 12 */
#define CH32V_CAN2_FAFIFOR_FFA13          (1 << 13) /* 00002000: Filter FIFO assignment for filter 13 */
#define CH32V_CAN2_FWR_OFFSET             0x021c
#define CH32V_CAN2_FWR                    (CH32V_CAN2_BASE + CH32V_CAN2_FWR_OFFSET) /* read-write */
#define CH32V_CAN2_FWR_FACT0              (1 <<  0) /* 00000001: Filter active */
#define CH32V_CAN2_FWR_FACT1              (1 <<  1) /* 00000002: Filter active */
#define CH32V_CAN2_FWR_FACT2              (1 <<  2) /* 00000004: Filter active */
#define CH32V_CAN2_FWR_FACT3              (1 <<  3) /* 00000008: Filter active */
#define CH32V_CAN2_FWR_FACT4              (1 <<  4) /* 00000010: Filter active */
#define CH32V_CAN2_FWR_FACT5              (1 <<  5) /* 00000020: Filter active */
#define CH32V_CAN2_FWR_FACT6              (1 <<  6) /* 00000040: Filter active */
#define CH32V_CAN2_FWR_FACT7              (1 <<  7) /* 00000080: Filter active */
#define CH32V_CAN2_FWR_FACT8              (1 <<  8) /* 00000100: Filter active */
#define CH32V_CAN2_FWR_FACT9              (1 <<  9) /* 00000200: Filter active */
#define CH32V_CAN2_FWR_FACT10             (1 << 10) /* 00000400: Filter active */
#define CH32V_CAN2_FWR_FACT11             (1 << 11) /* 00000800: Filter active */
#define CH32V_CAN2_FWR_FACT12             (1 << 12) /* 00001000: Filter active */
#define CH32V_CAN2_FWR_FACT13             (1 << 13) /* 00002000: Filter active */
#define CH32V_CAN2_F0R1_OFFSET            0x0240
#define CH32V_CAN2_F0R1                   (CH32V_CAN2_BASE + CH32V_CAN2_F0R1_OFFSET) /* read-write */
#define CH32V_CAN2_F0R1_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F0R1_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F0R1_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F0R1_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F0R1_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F0R1_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F0R1_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F0R1_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F0R1_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F0R1_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F0R1_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F0R1_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F0R1_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F0R1_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F0R1_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F0R1_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F0R1_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F0R1_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F0R1_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F0R1_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F0R1_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F0R1_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F0R1_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F0R1_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F0R1_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F0R1_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F0R1_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F0R1_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F0R1_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F0R1_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F0R1_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F0R1_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F0R2_OFFSET            0x0244
#define CH32V_CAN2_F0R2                   (CH32V_CAN2_BASE + CH32V_CAN2_F0R2_OFFSET) /* read-write */
#define CH32V_CAN2_F0R2_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F0R2_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F0R2_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F0R2_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F0R2_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F0R2_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F0R2_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F0R2_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F0R2_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F0R2_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F0R2_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F0R2_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F0R2_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F0R2_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F0R2_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F0R2_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F0R2_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F0R2_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F0R2_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F0R2_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F0R2_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F0R2_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F0R2_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F0R2_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F0R2_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F0R2_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F0R2_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F0R2_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F0R2_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F0R2_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F0R2_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F0R2_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F1R1_OFFSET            0x0248
#define CH32V_CAN2_F1R1                   (CH32V_CAN2_BASE + CH32V_CAN2_F1R1_OFFSET) /* read-write */
#define CH32V_CAN2_F1R1_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F1R1_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F1R1_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F1R1_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F1R1_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F1R1_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F1R1_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F1R1_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F1R1_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F1R1_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F1R1_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F1R1_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F1R1_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F1R1_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F1R1_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F1R1_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F1R1_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F1R1_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F1R1_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F1R1_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F1R1_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F1R1_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F1R1_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F1R1_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F1R1_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F1R1_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F1R1_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F1R1_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F1R1_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F1R1_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F1R1_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F1R1_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F1R2_OFFSET            0x024c
#define CH32V_CAN2_F1R2                   (CH32V_CAN2_BASE + CH32V_CAN2_F1R2_OFFSET) /* read-write */
#define CH32V_CAN2_F1R2_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F1R2_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F1R2_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F1R2_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F1R2_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F1R2_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F1R2_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F1R2_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F1R2_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F1R2_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F1R2_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F1R2_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F1R2_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F1R2_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F1R2_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F1R2_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F1R2_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F1R2_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F1R2_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F1R2_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F1R2_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F1R2_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F1R2_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F1R2_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F1R2_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F1R2_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F1R2_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F1R2_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F1R2_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F1R2_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F1R2_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F1R2_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F2R1_OFFSET            0x0250
#define CH32V_CAN2_F2R1                   (CH32V_CAN2_BASE + CH32V_CAN2_F2R1_OFFSET) /* read-write */
#define CH32V_CAN2_F2R1_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F2R1_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F2R1_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F2R1_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F2R1_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F2R1_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F2R1_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F2R1_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F2R1_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F2R1_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F2R1_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F2R1_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F2R1_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F2R1_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F2R1_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F2R1_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F2R1_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F2R1_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F2R1_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F2R1_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F2R1_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F2R1_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F2R1_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F2R1_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F2R1_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F2R1_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F2R1_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F2R1_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F2R1_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F2R1_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F2R1_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F2R1_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F2R2_OFFSET            0x0254
#define CH32V_CAN2_F2R2                   (CH32V_CAN2_BASE + CH32V_CAN2_F2R2_OFFSET) /* read-write */
#define CH32V_CAN2_F2R2_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F2R2_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F2R2_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F2R2_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F2R2_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F2R2_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F2R2_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F2R2_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F2R2_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F2R2_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F2R2_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F2R2_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F2R2_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F2R2_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F2R2_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F2R2_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F2R2_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F2R2_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F2R2_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F2R2_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F2R2_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F2R2_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F2R2_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F2R2_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F2R2_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F2R2_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F2R2_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F2R2_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F2R2_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F2R2_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F2R2_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F2R2_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F3R1_OFFSET            0x0258
#define CH32V_CAN2_F3R1                   (CH32V_CAN2_BASE + CH32V_CAN2_F3R1_OFFSET) /* read-write */
#define CH32V_CAN2_F3R1_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F3R1_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F3R1_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F3R1_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F3R1_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F3R1_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F3R1_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F3R1_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F3R1_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F3R1_FB9               (1 <<  9) /* 00000200: Filter bits */
#define CH32V_CAN2_F3R1_FB10              (1 << 10) /* 00000400: Filter bits */
#define CH32V_CAN2_F3R1_FB11              (1 << 11) /* 00000800: Filter bits */
#define CH32V_CAN2_F3R1_FB12              (1 << 12) /* 00001000: Filter bits */
#define CH32V_CAN2_F3R1_FB13              (1 << 13) /* 00002000: Filter bits */
#define CH32V_CAN2_F3R1_FB14              (1 << 14) /* 00004000: Filter bits */
#define CH32V_CAN2_F3R1_FB15              (1 << 15) /* 00008000: Filter bits */
#define CH32V_CAN2_F3R1_FB16              (1 << 16) /* 00010000: Filter bits */
#define CH32V_CAN2_F3R1_FB17              (1 << 17) /* 00020000: Filter bits */
#define CH32V_CAN2_F3R1_FB18              (1 << 18) /* 00040000: Filter bits */
#define CH32V_CAN2_F3R1_FB19              (1 << 19) /* 00080000: Filter bits */
#define CH32V_CAN2_F3R1_FB20              (1 << 20) /* 00100000: Filter bits */
#define CH32V_CAN2_F3R1_FB21              (1 << 21) /* 00200000: Filter bits */
#define CH32V_CAN2_F3R1_FB22              (1 << 22) /* 00400000: Filter bits */
#define CH32V_CAN2_F3R1_FB23              (1 << 23) /* 00800000: Filter bits */
#define CH32V_CAN2_F3R1_FB24              (1 << 24) /* 01000000: Filter bits */
#define CH32V_CAN2_F3R1_FB25              (1 << 25) /* 02000000: Filter bits */
#define CH32V_CAN2_F3R1_FB26              (1 << 26) /* 04000000: Filter bits */
#define CH32V_CAN2_F3R1_FB27              (1 << 27) /* 08000000: Filter bits */
#define CH32V_CAN2_F3R1_FB28              (1 << 28) /* 10000000: Filter bits */
#define CH32V_CAN2_F3R1_FB29              (1 << 29) /* 20000000: Filter bits */
#define CH32V_CAN2_F3R1_FB30              (1 << 30) /* 40000000: Filter bits */
#define CH32V_CAN2_F3R1_FB31              (1 << 31) /* 80000000: Filter bits */
#define CH32V_CAN2_F3R2_OFFSET            0x025c
#define CH32V_CAN2_F3R2                   (CH32V_CAN2_BASE + CH32V_CAN2_F3R2_OFFSET) /* read-write */
#define CH32V_CAN2_F3R2_FB0               (1 <<  0) /* 00000001: Filter bits */
#define CH32V_CAN2_F3R2_FB1               (1 <<  1) /* 00000002: Filter bits */
#define CH32V_CAN2_F3R2_FB2               (1 <<  2) /* 00000004: Filter bits */
#define CH32V_CAN2_F3R2_FB3               (1 <<  3) /* 00000008: Filter bits */
#define CH32V_CAN2_F3R2_FB4               (1 <<  4) /* 00000010: Filter bits */
#define CH32V_CAN2_F3R2_FB5               (1 <<  5) /* 00000020: Filter bits */
#define CH32V_CAN2_F3R2_FB6               (1 <<  6) /* 00000040: Filter bits */
#define CH32V_CAN2_F3R2_FB7               (1 <<  7) /* 00000080: Filter bits */
#define CH32V_CAN2_F3R2_FB8               (1 <<  8) /* 00000100: Filter bits */
#define CH32V_CAN2_F3R2_FB9               (1 <<  9) /* 00000200: Filter bits */
