robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
/* TIM7 is derived from TIM6. */
#define CH32V_TIM7_BASE                   0x40001400
#define CH32V_TIM7_CTLR1_OFFSET           0x0000
#define CH32V_TIM7_CTLR1                  (CH32V_TIM7_BASE + CH32V_TIM7_CTLR1_OFFSET) /* read-write */
#define CH32V_TIM7_CTLR1_ARPE             (1 <<  7) /* 00000080: Auto-reload preload enable */
#define CH32V_TIM7_CTLR1_OPM              (1 <<  3) /* 00000008: One-pulse mode */
#define CH32V_TIM7_CTLR1_URS              (1 <<  2) /* 00000004: Update request source */
#define CH32V_TIM7_CTLR1_UDIS             (1 <<  1) /* 00000002: Update disable */
#define CH32V_TIM7_CTLR1_CEN              (1 <<  0) /* 00000001: Counter enable */
#define CH32V_TIM7_CTLR2_OFFSET           0x0004
#define CH32V_TIM7_CTLR2                  (CH32V_TIM7_BASE + CH32V_TIM7_CTLR2_OFFSET) /* read-write */
#define CH32V_TIM7_CTLR2_MMS              (0x7 << 4) /* 00000070: Master mode selection */
#define CH32V_TIM7_CTLR2_MMS_MASK         (0x7 << 4)
#define CH32V_TIM7_DMAINTENR_OFFSET       0x000c
#define CH32V_TIM7_DMAINTENR              (CH32V_TIM7_BASE + CH32V_TIM7_DMAINTENR_OFFSET) /* read-write */
#define CH32V_TIM7_DMAINTENR_UDE          (1 <<  8) /* 00000100: Update DMA request enable */
#define CH32V_TIM7_DMAINTENR_UIE          (1 <<  0) /* 00000001: Update interrupt enable */
#define CH32V_TIM7_INTFR_OFFSET           0x0010
#define CH32V_TIM7_INTFR                  (CH32V_TIM7_BASE + CH32V_TIM7_INTFR_OFFSET) /* read-write */
#define CH32V_TIM7_INTFR_UIF              (1 <<  0) /* 00000001: Update interrupt flag */
#define CH32V_TIM7_SWEVGR_OFFSET          0x0014
#define CH32V_TIM7_SWEVGR                 (CH32V_TIM7_BASE + CH32V_TIM7_SWEVGR_OFFSET) /* write-only */
#define CH32V_TIM7_SWEVGR_UG              (1 <<  0) /* 00000001: Update generation */
#define CH32V_TIM7_CNT_OFFSET             0x0024
#define CH32V_TIM7_CNT                    (CH32V_TIM7_BASE + CH32V_TIM7_CNT_OFFSET) /* read-write */
#define CH32V_TIM7_CNT_CNT                (0xffff << 0) /* 0000ffff: counter value */
#define CH32V_TIM7_CNT_CNT_MASK           (0xffff << 0)
#define CH32V_TIM7_PSC_OFFSET             0x0028
#define CH32V_TIM7_PSC                    (CH32V_TIM7_BASE + CH32V_TIM7_PSC_OFFSET) /* read-write */
#define CH32V_TIM7_PSC_PSC                (0xffff << 0) /* 0000ffff: Prescaler value */
#define CH32V_TIM7_PSC_PSC_MASK           (0xffff << 0)
#define CH32V_TIM7_ATRLR_OFFSET           0x002c
#define CH32V_TIM7_ATRLR                  (CH32V_TIM7_BASE + CH32V_TIM7_ATRLR_OFFSET) /* read-write */
#define CH32V_TIM7_ATRLR_ATRLR            (0xffff << 0) /* 0000ffff: Auto-reload value */
#define CH32V_TIM7_ATRLR_ATRLR_MASK       (0xffff << 0)

/* I2C2 is derived from I2C1. */
#define CH32V_I2C2_BASE                   0x40005800
#define CH32V_I2C2_CTLR1_OFFSET           0x0000
#define CH32V_I2C2_CTLR1                  (CH32V_I2C2_BASE + CH32V_I2C2_CTLR1_OFFSET) /* read-write */
#define CH32V_I2C2_CTLR1_SWRST            (1 << 15) /* 00008000: Software reset */
#define CH32V_I2C2_CTLR1_ALERT            (1 << 13) /* 00002000: SMBus alert */
#define CH32V_I2C2_CTLR1_PEC              (1 << 12) /* 00001000: Packet error checking */
#define CH32V_I2C2_CTLR1_POS              (1 << 11) /* 00000800: Acknowledge/PEC Position (for data reception) */
#define CH32V_I2C2_CTLR1_ACK              (1 << 10) /* 00000400: Acknowledge enable */
#define CH32V_I2C2_CTLR1_STOP             (1 <<  9) /* 00000200: Stop generation */
#define CH32V_I2C2_CTLR1_START            (1 <<  8) /* 00000100: Start generation */
#define CH32V_I2C2_CTLR1_NOSTRETCH        (1 <<  7) /* 00000080: Clock stretching disable (Slave mode) */
#define CH32V_I2C2_CTLR1_ENGC             (1 <<  6) /* 00000040: General call enable */
#define CH32V_I2C2_CTLR1_ENPEC            (1 <<  5) /* 00000020: PEC enable */
#define CH32V_I2C2_CTLR1_ENARP            (1 <<  4) /* 00000010: ARP enable */
#define CH32V_I2C2_CTLR1_SMBTYPE          (1 <<  3) /* 00000008: SMBus type */
#define CH32V_I2C2_CTLR1_SMBUS            (1 <<  1) /* 00000002: SMBus mode */
#define CH32V_I2C2_CTLR1_PE               (1 <<  0) /* 00000001: Peripheral enable */
#define CH32V_I2C2_CTLR2_OFFSET           0x0004
#define CH32V_I2C2_CTLR2                  (CH32V_I2C2_BASE + CH32V_I2C2_CTLR2_OFFSET) /* read-write */
#define CH32V_I2C2_CTLR2_LAST             (1 << 12) /* 00001000: DMA last transfer */
#define CH32V_I2C2_CTLR2_DMAEN            (1 << 11) /* 00000800: DMA requests enable */
#define CH32V_I2C2_CTLR2_ITBUFEN          (1 << 10) /* 00000400: Buffer interrupt enable */
#define CH32V_I2C2_CTLR2_ITEVTEN          (1 <<  9) /* 00000200: Event interrupt enable */
#define CH32V_I2C2_CTLR2_ITERREN          (1 <<  8) /* 00000100: Error interrupt enable */
#define CH32V_I2C2_CTLR2_FREQ             (0x3f << 0) /* 0000003f: Peripheral clock frequency */
#define CH32V_I2C2_CTLR2_FREQ_MASK        (0x3f << 0)
#define CH32V_I2C2_OADDR1_OFFSET          0x0008
#define CH32V_I2C2_OADDR1                 (CH32V_I2C2_BASE + CH32V_I2C2_OADDR1_OFFSET) /* read-write */
#define CH32V_I2C2_OADDR1_ADDMODE         (1 << 15) /* 00008000: Addressing mode (slave mode) */
#define CH32V_I2C2_OADDR1_MUST1           (1 << 14) /* 00004000: Must be 1 */
#define CH32V_I2C2_OADDR1_ADD9_8          (0x3 << 8) /* 00000300: Interface address */
#define CH32V_I2C2_OADDR1_ADD9_8_MASK     (0x3 << 8)
#define CH32V_I2C2_OADDR1_ADD7_1          (0x7f << 1) /* 000000fe: Interface address */
#define CH32V_I2C2_OADDR1_ADD7_1_MASK     (0x7f << 1)
#define CH32V_I2C2_OADDR1_ADD0            (1 <<  0) /* 00000001: Interface address */
#define CH32V_I2C2_OADDR2_OFFSET          0x000c
#define CH32V_I2C2_OADDR2                 (CH32V_I2C2_BASE + CH32V_I2C2_OADDR2_OFFSET) /* read-write */
#define CH32V_I2C2_OADDR2_ADD2            (0x7f << 1) /* 000000fe: Interface address */
#define CH32V_I2C2_OADDR2_ADD2_MASK       (0x7f << 1)
#define CH32V_I2C2_OADDR2_ENDUAL          (1 <<  0) /* 00000001: Dual addressing mode enable */
#define CH32V_I2C2_DATAR_OFFSET           0x0010
#define CH32V_I2C2_DATAR                  (CH32V_I2C2_BASE + CH32V_I2C2_DATAR_OFFSET) /* read-write */
#define CH32V_I2C2_DATAR_DATAR            (0xff << 0) /* 000000ff: 8-bit data register */
#define CH32V_I2C2_DATAR_DATAR_MASK       (0xff << 0)
#define CH32V_I2C2_STAR1_OFFSET           0x0014
#define CH32V_I2C2_STAR1                  (CH32V_I2C2_BASE + CH32V_I2C2_STAR1_OFFSET)
#define CH32V_I2C2_STAR1_SMBALERT         (1 << 15) /* 00008000: SMBus alert */
#define CH32V_I2C2_STAR1_TIMEOUT          (1 << 14) /* 00004000: Timeout or Tlow error */
#define CH32V_I2C2_STAR1_PECERR           (1 << 12) /* 00001000: PEC Error in reception */
#define CH32V_I2C2_STAR1_OVR              (1 << 11) /* 00000800: Overrun/Underrun */
#define CH32V_I2C2_STAR1_AF               (1 << 10) /* 00000400: Acknowledge failure */
#define CH32V_I2C2_STAR1_ARLO             (1 <<  9) /* 00000200: Arbitration lost (master mode) */
#define CH32V_I2C2_STAR1_BERR             (1 <<  8) /* 00000100: Bus error */
#define CH32V_I2C2_STAR1_TxE              (1 <<  7) /* 00000080: Data register empty (transmitters) */
#define CH32V_I2C2_STAR1_RxNE             (1 <<  6) /* 00000040: Data register not empty (receivers) */
#define CH32V_I2C2_STAR1_STOPF            (1 <<  4) /* 00000010: Stop detection (slave mode) */
#define CH32V_I2C2_STAR1_ADD10            (1 <<  3) /* 00000008: 10-bit header sent (Master mode) */
#define CH32V_I2C2_STAR1_BTF              (1 <<  2) /* 00000004: Byte transfer finished */
#define CH32V_I2C2_STAR1_ADDR             (1 <<  1) /* 00000002: Address sent (master mode)/matched (slave mode) */
#define CH32V_I2C2_STAR1_SB               (1 <<  0) /* 00000001: Start bit (Master mode) */
#define CH32V_I2C2_STAR2_OFFSET           0x0018
#define CH32V_I2C2_STAR2                  (CH32V_I2C2_BASE + CH32V_I2C2_STAR2_OFFSET) /* read-only */
#define CH32V_I2C2_STAR2_PEC              (0xff << 8) /* 0000ff00: acket error checking register */
#define CH32V_I2C2_STAR2_PEC_MASK         (0xff << 8)
#define CH32V_I2C2_STAR2_DUALF            (1 <<  7) /* 00000080: Dual flag (Slave mode) */
#define CH32V_I2C2_STAR2_SMBHOST          (1 <<  6) /* 00000040: SMBus host header (Slave mode) */
#define CH32V_I2C2_STAR2_SMBDEFAULT       (1 <<  5) /* 00000020: SMBus device default address (Slave mode) */
#define CH32V_I2C2_STAR2_GENCALL          (1 <<  4) /* 00000010: General call address (Slave mode) */
#define CH32V_I2C2_STAR2_TRA              (1 <<  2) /* 00000004: Transmitter/receiver */
#define CH32V_I2C2_STAR2_BUSY             (1 <<  1) /* 00000002: Bus busy */
#define CH32V_I2C2_STAR2_MSL              (1 <<  0) /* 00000001: Master/slave */
#define CH32V_I2C2_CKCFGR_OFFSET          0x001c
#define CH32V_I2C2_CKCFGR                 (CH32V_I2C2_BASE + CH32V_I2C2_CKCFGR_OFFSET) /* read-write */
#define CH32V_I2C2_CKCFGR_F_S             (1 << 15) /* 00008000: I2C master mode selection */
#define CH32V_I2C2_CKCFGR_DUTY            (1 << 14) /* 00004000: Fast mode duty cycle */
#define CH32V_I2C2_CKCFGR_CCR             (0xfff << 0) /* 00000fff: Clock control register in Fast/Standard mode (Master mode) */
#define CH32V_I2C2_CKCFGR_CCR_MASK        (0xfff << 0)
#define CH32V_I2C2_RTR_OFFSET             0x0020
#define CH32V_I2C2_RTR                    (CH32V_I2C2_BASE + CH32V_I2C2_RTR_OFFSET) /* read-write */
#define CH32V_I2C2_RTR_TRISE              (0x3f << 0) /* 0000003f: Maximum rise time in Fast/Standard mode (Master mode) */
#define CH32V_I2C2_RTR_TRISE_MASK         (0x3f << 0)

/* SPI3 is derived from SPI2. */
#define CH32V_SPI3_BASE                   0x40003c00
#define CH32V_SPI3_CTLR1_OFFSET           0x0000
#define CH32V_SPI3_CTLR1                  (CH32V_SPI3_BASE + CH32V_SPI3_CTLR1_OFFSET) /* read-write */
#define CH32V_SPI3_CTLR1_BIDIMODE         (1 << 15) /* 00008000: Bidirectional data mode enable */
#define CH32V_SPI3_CTLR1_BIDIOE           (1 << 14) /* 00004000: Output enable in bidirectional mode */
#define CH32V_SPI3_CTLR1_CRCEN            (1 << 13) /* 00002000: Hardware CRC calculation enable */
#define CH32V_SPI3_CTLR1_CRCNEXT          (1 << 12) /* 00001000: CRC transfer next */
#define CH32V_SPI3_CTLR1_DFF              (1 << 11) /* 00000800: Data frame format */
#define CH32V_SPI3_CTLR1_RXONLY           (1 << 10) /* 00000400: Receive only */
#define CH32V_SPI3_CTLR1_SSM              (1 <<  9) /* 00000200: Software slave management */
#define CH32V_SPI3_CTLR1_SSI              (1 <<  8) /* 00000100: Internal slave select */
#define CH32V_SPI3_CTLR1_LSBFIRST         (1 <<  7) /* 00000080: Frame format */
#define CH32V_SPI3_CTLR1_SPE              (1 <<  6) /* 00000040: SPI enable */
#define CH32V_SPI3_CTLR1_BR               (0x7 << 3) /* 00000038: Baud rate control */
#define CH32V_SPI3_CTLR1_BR_MASK          (0x7 << 3)
#define CH32V_SPI3_CTLR1_MSTR             (1 <<  2) /* 00000004: Master selection */
#define CH32V_SPI3_CTLR1_CPOL             (1 <<  1) /* 00000002: Clock polarity */
#define CH32V_SPI3_CTLR1_CPHA             (1 <<  0) /* 00000001: Clock phase */
#define CH32V_SPI3_CTLR2_OFFSET           0x0004
#define CH32V_SPI3_CTLR2                  (CH32V_SPI3_BASE + CH32V_SPI3_CTLR2_OFFSET) /* read-write */
#define CH32V_SPI3_CTLR2_TXEIE            (1 <<  7) /* 00000080: Tx buffer empty interrupt enable */
#define CH32V_SPI3_CTLR2_RXNEIE           (1 <<  6) /* 00000040: RX buffer not empty interrupt enable */
#define CH32V_SPI3_CTLR2_ERRIE            (1 <<  5) /* 00000020: Error interrupt enable */
#define CH32V_SPI3_CTLR2_SSOE             (1 <<  2) /* 00000004: SS output enable */
#define CH32V_SPI3_CTLR2_TXDMAEN          (1 <<  1) /* 00000002: Tx buffer DMA enable */
#define CH32V_SPI3_CTLR2_RXDMAEN          (1 <<  0) /* 00000001: Rx buffer DMA enable */
#define CH32V_SPI3_STATR_OFFSET           0x0008
#define CH32V_SPI3_STATR                  (CH32V_SPI3_BASE + CH32V_SPI3_STATR_OFFSET)
#define CH32V_SPI3_STATR_BSY              (1 <<  7) /* 00000080: Busy flag */
#define CH32V_SPI3_STATR_OVR              (1 <<  6) /* 00000040: Overrun flag */
#define CH32V_SPI3_STATR_MODF             (1 <<  5) /* 00000020: Mode fault */
#define CH32V_SPI3_STATR_CRCERR           (1 <<  4) /* 00000010: CRC error flag */
#define CH32V_SPI3_STATR_TXE              (1 <<  1) /* 00000002: Transmit buffer empty */
#define CH32V_SPI3_STATR_RXNE             (1 <<  0) /* 00000001: Receive buffer not empty */
#define CH32V_SPI3_DATAR_OFFSET           0x000c
#define CH32V_SPI3_DATAR                  (CH32V_SPI3_BASE + CH32V_SPI3_DATAR_OFFSET) /* read-write */
#define CH32V_SPI3_DATAR_DATAR            (0xffff << 0) /* 0000ffff: Data register */
#define CH32V_SPI3_DATAR_DATAR_MASK       (0xffff << 0)
#define CH32V_SPI3_CRCR_OFFSET            0x0010
#define CH32V_SPI3_CRCR                   (CH32V_SPI3_BASE + CH32V_SPI3_CRCR_OFFSET) /* read-write */
#define CH32V_SPI3_CRCR_CRCPOLY           (0xffff << 0) /* 0000ffff: CRC polynomial register */
#define CH32V_SPI3_CRCR_CRCPOLY_MASK      (0xffff << 0)
#define CH32V_SPI3_RCRCR_OFFSET           0x0014
#define CH32V_SPI3_RCRCR                  (CH32V_SPI3_BASE + CH32V_SPI3_RCRCR_OFFSET) /* read-only */
#define CH32V_SPI3_RCRCR_RXCRC            (0xffff << 0) /* 0000ffff: Rx CRC register */
#define CH32V_SPI3_RCRCR_RXCRC_MASK       (0xffff << 0)
#define CH32V_SPI3_TCRCR_OFFSET           0x0018
#define CH32V_SPI3_TCRCR                  (CH32V_SPI3_BASE + CH32V_SPI3_TCRCR_OFFSET) /* read-only */
#define CH32V_SPI3_TCRCR_TXCRC            (0xffff << 0) /* 0000ffff: Tx CRC register */
#define CH32V_SPI3_TCRCR_TXCRC_MASK       (0xffff << 0)
#define CH32V_SPI3_I2SCFGR_OFFSET         0x001c
#define CH32V_SPI3_I2SCFGR                (CH32V_SPI3_BASE + CH32V_SPI3_I2SCFGR_OFFSET) /* read-write */
#define CH32V_SPI3_I2SCFGR_I2SMOD         (1 << 11) /* 00000800: I2S mode selection */
#define CH32V_SPI3_I2SCFGR_I2SE           (1 << 10) /* 00000400: I2S Enable */
#define CH32V_SPI3_I2SCFGR_I2SCFG         (0x3 << 8) /* 00000300: I2S configuration mode */
#define CH32V_SPI3_I2SCFGR_I2SCFG_MASK    (0x3 << 8)
#define CH32V_SPI3_I2SCFGR_PCMSYNC        (1 <<  7) /* 00000080: PCM frame synchronization */
#define CH32V_SPI3_I2SCFGR_I2SSTD         (0x3 << 4) /* 00000030: I2S standard selection */
#define CH32V_SPI3_I2SCFGR_I2SSTD_MASK    (0x3 << 4)
#define CH32V_SPI3_I2SCFGR_CKPOL          (1 <<  3) /* 00000008: Steady state clock polarity */
#define CH32V_SPI3_I2SCFGR_DATLEN         (0x3 << 1) /* 00000006: Data length to be transferred */
#define CH32V_SPI3_I2SCFGR_DATLEN_MASK    (0x3 << 1)
#define CH32V_SPI3_I2SCFGR_CHLEN          (1 <<  0) /* 00000001: Channel length (number of bits per audio channel) */
#define CH32V_SPI3_I2SPR_OFFSET           0x0020
#define CH32V_SPI3_I2SPR                  (CH32V_SPI3_BASE + CH32V_SPI3_I2SPR_OFFSET) /* read-write */
#define CH32V_SPI3_I2SPR_MCKOE            (1 <<  9) /* 00000200: Master clock output enable */
#define CH32V_SPI3_I2SPR_ODD              (1 <<  8) /* 00000100: Odd factor for the prescaler */
#define CH32V_SPI3_I2SPR_I2SDIV           (0xff << 0) /* 000000ff: I2S Linear prescaler */
#define CH32V_SPI3_I2SPR_I2SDIV_MASK      (0xff << 0)
#define CH32V_SPI3_HSCR_OFFSET            0x0024
#define CH32V_SPI3_HSCR                   (CH32V_SPI3_BASE + CH32V_SPI3_HSCR_OFFSET) /* read-write */
#define CH32V_SPI3_HSCR_HSRXEN            (1 <<  0) /* 00000001: High speed mode read enable */

