robertlipe/svdtoheaders/tests/baseline_output/ch32v30x_reg.h
/* USART2 is derived from USART1. */
#define CH32V_USART2_BASE                 0x40004400
#define CH32V_USART2_STATR_OFFSET         0x0000
#define CH32V_USART2_STATR                (CH32V_USART2_BASE + CH32V_USART2_STATR_OFFSET)
#define CH32V_USART2_STATR_CTS            (1 <<  9) /* 00000200: CTS flag */
#define CH32V_USART2_STATR_LBD            (1 <<  8) /* 00000100: LIN break detection flag */
#define CH32V_USART2_STATR_TXE            (1 <<  7) /* 00000080: Transmit data register empty */
#define CH32V_USART2_STATR_TC             (1 <<  6) /* 00000040: Transmission complete */
#define CH32V_USART2_STATR_RXNE           (1 <<  5) /* 00000020: Read data register not empty */
#define CH32V_USART2_STATR_IDLE           (1 <<  4) /* 00000010: IDLE line detected */
#define CH32V_USART2_STATR_ORE            (1 <<  3) /* 00000008: Overrun error */
#define CH32V_USART2_STATR_NE             (1 <<  2) /* 00000004: Noise error flag */
#define CH32V_USART2_STATR_FE             (1 <<  1) /* 00000002: Framing error */
#define CH32V_USART2_STATR_PE             (1 <<  0) /* 00000001: Parity error */
#define CH32V_USART2_DATAR_OFFSET         0x0004
#define CH32V_USART2_DATAR                (CH32V_USART2_BASE + CH32V_USART2_DATAR_OFFSET) /* read-write */
#define CH32V_USART2_DATAR_DR             (0x1ff << 0) /* 000001ff: Data value */
#define CH32V_USART2_DATAR_DR_MASK        (0x1ff << 0)
#define CH32V_USART2_BRR_OFFSET           0x0008
#define CH32V_USART2_BRR                  (CH32V_USART2_BASE + CH32V_USART2_BRR_OFFSET) /* read-write */
#define CH32V_USART2_BRR_DIV_Mantissa     (0xfff << 4) /* 0000fff0: mantissa of USARTDIV */
#define CH32V_USART2_BRR_DIV_Mantissa_MASK (0xfff << 4)
#define CH32V_USART2_BRR_DIV_Fraction     (0xf << 0) /* 0000000f: fraction of USARTDIV */
#define CH32V_USART2_BRR_DIV_Fraction_MASK (0xf << 0)
#define CH32V_USART2_CTLR1_OFFSET         0x000c
#define CH32V_USART2_CTLR1                (CH32V_USART2_BASE + CH32V_USART2_CTLR1_OFFSET) /* read-write */
#define CH32V_USART2_CTLR1_UE             (1 << 13) /* 00002000: USART enable */
#define CH32V_USART2_CTLR1_M              (1 << 12) /* 00001000: Word length */
#define CH32V_USART2_CTLR1_WAKE           (1 << 11) /* 00000800: Wakeup method */
#define CH32V_USART2_CTLR1_PCE            (1 << 10) /* 00000400: Parity control enable */
#define CH32V_USART2_CTLR1_PS             (1 <<  9) /* 00000200: Parity selection */
#define CH32V_USART2_CTLR1_PEIE           (1 <<  8) /* 00000100: PE interrupt enable */
#define CH32V_USART2_CTLR1_TXEIE          (1 <<  7) /* 00000080: TXE interrupt enable */
#define CH32V_USART2_CTLR1_TCIE           (1 <<  6) /* 00000040: Transmission complete interrupt enable */
#define CH32V_USART2_CTLR1_RXNEIE         (1 <<  5) /* 00000020: RXNE interrupt enable */
#define CH32V_USART2_CTLR1_IDLEIE         (1 <<  4) /* 00000010: IDLE interrupt enable */
#define CH32V_USART2_CTLR1_TE             (1 <<  3) /* 00000008: Transmitter enable */
#define CH32V_USART2_CTLR1_RE             (1 <<  2) /* 00000004: Receiver enable */
#define CH32V_USART2_CTLR1_RWU            (1 <<  1) /* 00000002: Receiver wakeup */
#define CH32V_USART2_CTLR1_SBK            (1 <<  0) /* 00000001: Send break */
#define CH32V_USART2_CTLR2_OFFSET         0x0010
#define CH32V_USART2_CTLR2                (CH32V_USART2_BASE + CH32V_USART2_CTLR2_OFFSET) /* read-write */
#define CH32V_USART2_CTLR2_LINEN          (1 << 14) /* 00004000: LIN mode enable */
#define CH32V_USART2_CTLR2_STOP           (0x3 << 12) /* 00003000: STOP bits */
#define CH32V_USART2_CTLR2_STOP_MASK      (0x3 << 12)
#define CH32V_USART2_CTLR2_CLKEN          (1 << 11) /* 00000800: Clock enable */
#define CH32V_USART2_CTLR2_CPOL           (1 << 10) /* 00000400: Clock polarity */
#define CH32V_USART2_CTLR2_CPHA           (1 <<  9) /* 00000200: Clock phase */
#define CH32V_USART2_CTLR2_LBCL           (1 <<  8) /* 00000100: Last bit clock pulse */
#define CH32V_USART2_CTLR2_LBDIE          (1 <<  6) /* 00000040: LIN break detection interrupt enable */
#define CH32V_USART2_CTLR2_LBDL           (1 <<  5) /* 00000020: lin break detection length */
#define CH32V_USART2_CTLR2_ADD            (0xf << 0) /* 0000000f: Address of the USART node */
#define CH32V_USART2_CTLR2_ADD_MASK       (0xf << 0)
#define CH32V_USART2_CTLR3_OFFSET         0x0014
#define CH32V_USART2_CTLR3                (CH32V_USART2_BASE + CH32V_USART2_CTLR3_OFFSET) /* read-write */
#define CH32V_USART2_CTLR3_CTSIE          (1 << 10) /* 00000400: CTS interrupt enable */
#define CH32V_USART2_CTLR3_CTSE           (1 <<  9) /* 00000200: CTS enable */
#define CH32V_USART2_CTLR3_RTSE           (1 <<  8) /* 00000100: RTS enable */
#define CH32V_USART2_CTLR3_DMAT           (1 <<  7) /* 00000080: DMA enable transmitter */
#define CH32V_USART2_CTLR3_DMAR           (1 <<  6) /* 00000040: DMA enable receiver */
#define CH32V_USART2_CTLR3_SCEN           (1 <<  5) /* 00000020: Smartcard mode enable */
#define CH32V_USART2_CTLR3_NACK           (1 <<  4) /* 00000010: Smartcard NACK enable */
#define CH32V_USART2_CTLR3_HDSEL          (1 <<  3) /* 00000008: Half-duplex selection */
#define CH32V_USART2_CTLR3_IRLP           (1 <<  2) /* 00000004: IrDA low-power */
#define CH32V_USART2_CTLR3_IREN           (1 <<  1) /* 00000002: IrDA mode enable */
#define CH32V_USART2_CTLR3_EIE            (1 <<  0) /* 00000001: Error interrupt enable */
#define CH32V_USART2_GPR_OFFSET           0x0018
#define CH32V_USART2_GPR                  (CH32V_USART2_BASE + CH32V_USART2_GPR_OFFSET) /* read-write */
#define CH32V_USART2_GPR_GT               (0xff << 8) /* 0000ff00: Guard time value */
#define CH32V_USART2_GPR_GT_MASK          (0xff << 8)
#define CH32V_USART2_GPR_PSC              (0xff << 0) /* 000000ff: Prescaler value */
#define CH32V_USART2_GPR_PSC_MASK         (0xff << 0)

/* USART3 is derived from USART1. */
#define CH32V_USART3_BASE                 0x40004800
#define CH32V_USART3_STATR_OFFSET         0x0000
#define CH32V_USART3_STATR                (CH32V_USART3_BASE + CH32V_USART3_STATR_OFFSET)
#define CH32V_USART3_STATR_CTS            (1 <<  9) /* 00000200: CTS flag */
#define CH32V_USART3_STATR_LBD            (1 <<  8) /* 00000100: LIN break detection flag */
#define CH32V_USART3_STATR_TXE            (1 <<  7) /* 00000080: Transmit data register empty */
#define CH32V_USART3_STATR_TC             (1 <<  6) /* 00000040: Transmission complete */
#define CH32V_USART3_STATR_RXNE           (1 <<  5) /* 00000020: Read data register not empty */
#define CH32V_USART3_STATR_IDLE           (1 <<  4) /* 00000010: IDLE line detected */
#define CH32V_USART3_STATR_ORE            (1 <<  3) /* 00000008: Overrun error */
#define CH32V_USART3_STATR_NE             (1 <<  2) /* 00000004: Noise error flag */
#define CH32V_USART3_STATR_FE             (1 <<  1) /* 00000002: Framing error */
#define CH32V_USART3_STATR_PE             (1 <<  0) /* 00000001: Parity error */
#define CH32V_USART3_DATAR_OFFSET         0x0004
#define CH32V_USART3_DATAR                (CH32V_USART3_BASE + CH32V_USART3_DATAR_OFFSET) /* read-write */
#define CH32V_USART3_DATAR_DR             (0x1ff << 0) /* 000001ff: Data value */
#define CH32V_USART3_DATAR_DR_MASK        (0x1ff << 0)
#define CH32V_USART3_BRR_OFFSET           0x0008
#define CH32V_USART3_BRR                  (CH32V_USART3_BASE + CH32V_USART3_BRR_OFFSET) /* read-write */
#define CH32V_USART3_BRR_DIV_Mantissa     (0xfff << 4) /* 0000fff0: mantissa of USARTDIV */
#define CH32V_USART3_BRR_DIV_Mantissa_MASK (0xfff << 4)
#define CH32V_USART3_BRR_DIV_Fraction     (0xf << 0) /* 0000000f: fraction of USARTDIV */
#define CH32V_USART3_BRR_DIV_Fraction_MASK (0xf << 0)
#define CH32V_USART3_CTLR1_OFFSET         0x000c
#define CH32V_USART3_CTLR1                (CH32V_USART3_BASE + CH32V_USART3_CTLR1_OFFSET) /* read-write */
#define CH32V_USART3_CTLR1_UE             (1 << 13) /* 00002000: USART enable */
#define CH32V_USART3_CTLR1_M              (1 << 12) /* 00001000: Word length */
#define CH32V_USART3_CTLR1_WAKE           (1 << 11) /* 00000800: Wakeup method */
#define CH32V_USART3_CTLR1_PCE            (1 << 10) /* 00000400: Parity control enable */
#define CH32V_USART3_CTLR1_PS             (1 <<  9) /* 00000200: Parity selection */
#define CH32V_USART3_CTLR1_PEIE           (1 <<  8) /* 00000100: PE interrupt enable */
#define CH32V_USART3_CTLR1_TXEIE          (1 <<  7) /* 00000080: TXE interrupt enable */
#define CH32V_USART3_CTLR1_TCIE           (1 <<  6) /* 00000040: Transmission complete interrupt enable */
#define CH32V_USART3_CTLR1_RXNEIE         (1 <<  5) /* 00000020: RXNE interrupt enable */
#define CH32V_USART3_CTLR1_IDLEIE         (1 <<  4) /* 00000010: IDLE interrupt enable */
#define CH32V_USART3_CTLR1_TE             (1 <<  3) /* 00000008: Transmitter enable */
#define CH32V_USART3_CTLR1_RE             (1 <<  2) /* 00000004: Receiver enable */
#define CH32V_USART3_CTLR1_RWU            (1 <<  1) /* 00000002: Receiver wakeup */
#define CH32V_USART3_CTLR1_SBK            (1 <<  0) /* 00000001: Send break */
#define CH32V_USART3_CTLR2_OFFSET         0x0010
#define CH32V_USART3_CTLR2                (CH32V_USART3_BASE + CH32V_USART3_CTLR2_OFFSET) /* read-write */
#define CH32V_USART3_CTLR2_LINEN          (1 << 14) /* 00004000: LIN mode enable */
#define CH32V_USART3_CTLR2_STOP           (0x3 << 12) /* 00003000: STOP bits */
#define CH32V_USART3_CTLR2_STOP_MASK      (0x3 << 12)
#define CH32V_USART3_CTLR2_CLKEN          (1 << 11) /* 00000800: Clock enable */
#define CH32V_USART3_CTLR2_CPOL           (1 << 10) /* 00000400: Clock polarity */
#define CH32V_USART3_CTLR2_CPHA           (1 <<  9) /* 00000200: Clock phase */
#define CH32V_USART3_CTLR2_LBCL           (1 <<  8) /* 00000100: Last bit clock pulse */
#define CH32V_USART3_CTLR2_LBDIE          (1 <<  6) /* 00000040: LIN break detection interrupt enable */
#define CH32V_USART3_CTLR2_LBDL           (1 <<  5) /* 00000020: lin break detection length */
#define CH32V_USART3_CTLR2_ADD            (0xf << 0) /* 0000000f: Address of the USART node */
#define CH32V_USART3_CTLR2_ADD_MASK       (0xf << 0)
#define CH32V_USART3_CTLR3_OFFSET         0x0014
#define CH32V_USART3_CTLR3                (CH32V_USART3_BASE + CH32V_USART3_CTLR3_OFFSET) /* read-write */
#define CH32V_USART3_CTLR3_CTSIE          (1 << 10) /* 00000400: CTS interrupt enable */
#define CH32V_USART3_CTLR3_CTSE           (1 <<  9) /* 00000200: CTS enable */
#define CH32V_USART3_CTLR3_RTSE           (1 <<  8) /* 00000100: RTS enable */
#define CH32V_USART3_CTLR3_DMAT           (1 <<  7) /* 00000080: DMA enable transmitter */
#define CH32V_USART3_CTLR3_DMAR           (1 <<  6) /* 00000040: DMA enable receiver */
#define CH32V_USART3_CTLR3_SCEN           (1 <<  5) /* 00000020: Smartcard mode enable */
#define CH32V_USART3_CTLR3_NACK           (1 <<  4) /* 00000010: Smartcard NACK enable */
#define CH32V_USART3_CTLR3_HDSEL          (1 <<  3) /* 00000008: Half-duplex selection */
#define CH32V_USART3_CTLR3_IRLP           (1 <<  2) /* 00000004: IrDA low-power */
#define CH32V_USART3_CTLR3_IREN           (1 <<  1) /* 00000002: IrDA mode enable */
#define CH32V_USART3_CTLR3_EIE            (1 <<  0) /* 00000001: Error interrupt enable */
#define CH32V_USART3_GPR_OFFSET           0x0018
#define CH32V_USART3_GPR                  (CH32V_USART3_BASE + CH32V_USART3_GPR_OFFSET) /* read-write */
#define CH32V_USART3_GPR_GT               (0xff << 8) /* 0000ff00: Guard time value */
#define CH32V_USART3_GPR_GT_MASK          (0xff << 8)
#define CH32V_USART3_GPR_PSC              (0xff << 0) /* 000000ff: Prescaler value */
#define CH32V_USART3_GPR_PSC_MASK         (0xff << 0)

